anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
#include <Arduino.h>
#include <Preferences.h>
#include <SPI.h>
#include <TFT_eSPI.h>
#include <Wire.h>

#include <algorithm>
#include <array>
#include <cstddef>
#include <cstdint>
#include <cstdio>
#include <cstring>
#include <new>
#include <type_traits>

#include <esp_system.h>
#include <esp_sleep.h>
#include <esp_task_wdt.h>
#include <esp_timer.h>
#include <esp_app_desc.h>
#include <esp_attr.h>
#include <esp_heap_caps.h>
#include <esp_mac.h>
#include <esp_private/startup_internal.h>
#include <esp_private/system_internal.h>
#include <esp_rom_sys.h>
#include <hal/wdt_hal.h>
#include <soc/gpio_struct.h>
#include <soc/rtc.h>
#include <mbedtls/sha256.h>
#include <freertos/FreeRTOS.h>
#include <freertos/queue.h>
#include <freertos/semphr.h>
#include <freertos/task.h>

#include "apps/library/LibraryController.h"
#include "apps/library/SessionCatalog.h"
#include "apps/automation/AutomationInspectorController.h"
#include "apps/guard/AirspaceGuardController.h"
#include "apps/auth/WifiAuthenticationCaptureController.h"
#include "apps/auth/WifiAuthenticationArtifactPolicy.h"
#include "apps/auth/WifiAuthenticationHc22000.h"
#include "apps/auth/WifiAuthenticationPersistenceHilFixture.h"
#include "apps/auth/WifiAuthenticationSyntheticHilFixture.h"
#include "apps/capture/RadiotapPcap.h"
#include "apps/capture/InfraredCapture.h"
#include "apps/capture/InfraredCsv.h"
#include "apps/capture/SubGhzRawCapture.h"
#include "apps/capture/SubGhzRawCsv.h"
#include "apps/capture/WifiFrameCapture.h"
#include "apps/device/DeviceLockController.h"
#include "apps/self_test/SelfTestController.h"
#include "apps/spectrum/Cc1101SignalFinder.h"
#include "apps/spectrum/Cc1101SpectrumController.h"
#include "apps/spectrum/Nrf24SignalFinder.h"
#include "apps/spectrum/Nrf24SpectrumController.h"
#include "apps/spectrum/SpectrumViewport.h"
#include "apps/survey/FieldSurveyNativeCsv.h"
#include "apps/survey/FieldSurveyStation.h"
#include "apps/survey/FieldSurveyTracker.h"
#include "apps/survey/FieldSurveyWigleCsv.h"
#include "apps/survey/ProductSurveyAdmission.h"
#include "apps/survey/SurveyController.h"
#include "apps/survey/SurveyPipeline.h"
#include "apps/survey/SurveySourceController.h"
#include "apps/survey/SurveyWorkflow.h"
#include "apps/targets/TargetsController.h"
#include "apps/ble/BleCompanyDatabase.h"
#include "apps/ble/BleDeviceCatalog.h"
#include "apps/ble/BleDeviceIntelligence.h"
#include "apps/ble/BleDeviceNavigationOrder.h"
#include "apps/wifi/WifiNetworkCatalog.h"
#include "apps/wifi/WifiNetworkNavigationOrder.h"
#include "apps/wifi/WifiDeviceCatalog.h"
#include "apps/wifi/WifiDeviceNavigationOrder.h"
#include "apps/wifi/WifiOuiDatabase.h"
#include "boards/esp32_div_v2/BoardProfile.h"
#include "domain/apps/AppCatalog.h"
#include "domain/hardware/HardwareInventory.h"
#include "domain/observations/Observation.h"
#include "drivers/ble/BlePassiveContract.h"
#include "drivers/radio/Cc1101PassiveSpectrum.h"
#include "drivers/radio/Nrf24PassiveSpectrum.h"
#include "drivers/radio/ShieldReceiverIdentity.h"
#include "drivers/wifi/WifiPassiveContract.h"
#include "kernel/runtime/AppRuntime.h"
#include "kernel/runtime/ResourceBroker.h"
#include "kernel/safety/SafetySupervisor.h"
#include "kernel/safety/WorkerDeadlineSupervisor.h"
#include "platform/arduino/BoardSafeOutputs.h"
#include "platform/arduino/BoardAntennaStatusLeds.h"
#include "platform/arduino/BoardInfraredReceiver.h"
#include "platform/arduino/BoardCc1101PassiveSpectrum.h"
#include "platform/arduino/BoardNrf24PassiveSpectrum.h"
#include "platform/arduino/BoardShieldReceiverProbe.h"
#include "platform/arduino/ArduinoFsSessionStoreIo.h"
#include "platform/arduino/ArduinoCompanionWebService.h"
#include "platform/arduino/ArduinoDeviceLockSecurity.h"
#include "platform/arduino/ArduinoLittleFsSessionStoreIo.h"
#include "platform/arduino/ArduinoSerialConsoleEndpoint.h"
#include "platform/arduino/BoardSdFilesystem.h"
#include "platform/arduino/BoardAutomationPackageReader.h"
#include "platform/arduino/BoardStorageAdapter.h"
#include "platform/arduino/BoardTouchInput.h"
#include "platform/arduino/BoardBlePassiveScanner.h"
#include "platform/arduino/BoardSdSpiTransport.h"
#include "platform/arduino/BoardWifiPassiveScanner.h"
#include "platform/arduino/BoardWifiPassiveCapture.h"
#include "platform/arduino/DisposableOtaLittleFs.h"
#include "platform/arduino/RamSessionStoreIo.h"
#include "services/companion/CompanionProtocol.h"
#include "services/actions/ActionDispatcher.h"
#include "services/actions/ActionsCli.h"
#include "services/companion/CompanionConnectivity.h"
#include "services/companion/CompanionWebAdapter.h"
#include "services/companion/CompanionMutationAdapter.h"
#include "services/companion/CompanionReadAdapter.h"
#include "services/diagnostics/BootReport.h"
#include "services/diagnostics/HilSession.h"
#include "services/auth/WifiAuthenticationCapture.h"
#include "services/ble/BleInspector.h"
#include "services/ble/BleInspectorExport.h"
#include "services/power/PowerSafetyPolicy.h"
#include "services/security/DeviceLock.h"
#include "services/serial/SerialConsoleContract.h"
#include "services/targets/CorrelationService.h"
#include "services/targets/SessionTargetAdmission.h"
#include "services/targets/SurveySessionTargetEvidenceLookup.h"
#include "services/targets/TargetMergeService.h"
#include "services/targets/TargetService.h"
#include "services/survey/IngressTiming.h"
#include "services/survey/ObservationQueue.h"
#include "services/survey/SessionBatchPolicy.h"
#include "services/survey/SourceDegradation.h"
#include "services/survey/SourceTimeline.h"
#include "services/survey/SurveySession.h"
#include "storage/AtomicHead.h"
#include "storage/MediaDiscovery.h"
#include "storage/MountPolicy.h"
#include "storage/ProductStorePolicy.h"
#include "storage/ProductBootRetry.h"
#include "storage/ProductStartRetry.h"
#include "storage/SdReadOnlyProtocol.h"
#include "storage/SdIdentification.h"
#include "storage/SdIdentificationTransport.h"
#include "storage/SdSectorInspection.h"
#include "storage/SdSpiWireCodec.h"
#include "storage/SessionCodec.h"
#include "storage/SessionStore.h"
#include "storage/SessionStoreBoundary.h"
#include "storage/SessionStoreIoRouter.h"
#include "storage/StorageGuard.h"
#include "storage/StorageTiming.h"
#include "storage/TargetStateStore.h"
#include "ui/Pcf8574ButtonInput.h"
#include "ui/TouchTargets.h"
#include "ui/InterfaceSettingsController.h"
#include "ui/AntennaStatusController.h"
#include "ui/AirspaceGuardPresenter.h"
#include "ui/LanguageController.h"
#include "ui/UiComponents.h"
#include "ui/UiController.h"
#include "ui/UiStrings.h"
#include "ui/WifiAuthenticationCapturePresenter.h"
#include "ui/VisualTheme.h"
#include "ui/fonts/RobotoCondensedGfx.h"

namespace {

extern const std::uint8_t wifiOuiAssetStart[]
    asm("_binary_assets_oui_bin_start");
extern const std::uint8_t wifiOuiAssetEnd[]
    asm("_binary_assets_oui_bin_end");
extern const std::uint8_t bleCompanyAssetStart[]
    asm("_binary_assets_bluetooth_companies_bin_start");
extern const std::uint8_t bleCompanyAssetEnd[]
    asm("_binary_assets_bluetooth_companies_bin_end");

using leshy1::boards::esp32_div_v2::BoardProfile;
using leshy1::apps::library::LibraryController;
using leshy1::apps::library::LibraryEntry;
using leshy1::apps::library::LibraryView;
using leshy1::apps::library::SessionCatalog;
using leshy1::apps::library::SessionIntegrity;
using leshy1::apps::automation::AutomationInspectorController;
using leshy1::apps::automation::AutomationInspectorModel;
using leshy1::apps::automation::AutomationInspectorSourceStatus;
using leshy1::apps::automation::AutomationPackageCatalog;
using leshy1::apps::automation::AutomationPackageCatalogEntry;
using leshy1::apps::automation::AutomationPackageKind;
using leshy1::apps::automation::AutomationParseStatus;
using leshy1::apps::automation::AutomationPolicyStatus;
using leshy1::apps::automation::AutomationTargetClass;
using leshy1::apps::automation::AutomationTrustStatus;
using leshy1::apps::guard::AirspaceGuardController;
using leshy1::apps::guard::AirspaceGuardView;
using leshy1::apps::auth::WifiAuthenticationCaptureAction;
using leshy1::apps::auth::WifiAuthenticationCaptureController;
using leshy1::apps::auth::WifiAuthenticationCaptureLoadStatus;
using leshy1::apps::auth::WifiAuthenticationCaptureView;
using leshy1::apps::auth::WifiAuthenticationPersistenceHilContext;
using leshy1::apps::auth::WifiAuthenticationPersistenceHilFixture;
using leshy1::apps::auth::WifiAuthenticationPersistenceHilStatus;
using leshy1::apps::auth::WifiAuthenticationSyntheticHilContext;
using leshy1::apps::auth::WifiAuthenticationSyntheticHilFixture;
using leshy1::apps::auth::WifiAuthenticationSyntheticHilStatus;
using leshy1::apps::capture::PcapExportResult;
using leshy1::apps::capture::InfraredCapture;
using leshy1::apps::capture::InfraredCapturePlan;
using leshy1::apps::capture::InfraredCaptureState;
using leshy1::apps::capture::SubGhzRawCapture;
using leshy1::apps::capture::SubGhzRawCapturePlan;
using leshy1::apps::capture::SubGhzRawCaptureState;
using leshy1::apps::capture::SubGhzRawRssiSample;
using leshy1::apps::capture::WifiFrameCapture;
using leshy1::apps::capture::WifiFrameCapturePlan;
using leshy1::apps::capture::WifiFrameCaptureState;
using leshy1::apps::device::DeviceLockActivation;
using leshy1::apps::device::DeviceLockController;
using leshy1::apps::device::DeviceLockIntent;
using leshy1::apps::device::DeviceLockSubmission;
using leshy1::apps::device::DeviceLockUiOutcome;
using leshy1::apps::device::DeviceLockView;
using leshy1::apps::self_test::SelfTestController;
using leshy1::apps::self_test::SelfTestFacts;
using leshy1::apps::self_test::SelfTestMode;
using leshy1::apps::self_test::SelfTestReport;
using leshy1::apps::self_test::SelfTestResultStatus;
using leshy1::apps::self_test::SelfTestView;
using leshy1::apps::spectrum::Cc1101SignalFinder;
using leshy1::apps::spectrum::Cc1101SignalFinderState;
using leshy1::apps::spectrum::Cc1101SpectrumController;
using leshy1::apps::spectrum::Cc1101SpectrumViewState;
using leshy1::apps::spectrum::Nrf24SignalFinder;
using leshy1::apps::spectrum::Nrf24SignalFinderState;
using leshy1::apps::spectrum::Nrf24SpectrumController;
using leshy1::apps::spectrum::Nrf24SpectrumMetric;
using leshy1::apps::spectrum::Nrf24SpectrumViewState;
using leshy1::apps::spectrum::SpectrumDisplayMode;
using leshy1::apps::spectrum::SpectrumViewport;
using leshy1::apps::survey::FieldSurveyTracker;
using leshy1::apps::survey::FieldSurveyCatalog;
using leshy1::apps::survey::FieldSurveyVisitStatus;
using leshy1::apps::survey::fieldSurveyBuildStatusName;
using leshy1::apps::survey::fieldSurveyVisitStatusName;
using leshy1::apps::survey::SurveyController;
using leshy1::apps::survey::ObservationHistory;
using leshy1::apps::survey::SurveyFilter;
using leshy1::apps::survey::SurveyPipeline;
using leshy1::apps::survey::SurveyPipelineProgress;
using leshy1::apps::survey::SurveyPipelineStatus;
using leshy1::apps::survey::SurveySetupActivation;
using leshy1::apps::survey::SurveySetupView;
using leshy1::apps::survey::SurveySourceController;
using leshy1::apps::survey::SurveySourceKind;
using leshy1::apps::survey::SurveySourceOption;
using leshy1::apps::survey::SurveySourceScope;
using leshy1::apps::survey::SurveySourceState;
using leshy1::apps::survey::SurveyView;
using leshy1::apps::survey::SurveyWorkflow;
using leshy1::apps::survey::SurveyWorkflowState;
using leshy1::apps::survey::SurveyWorkflowStatus;
using leshy1::apps::targets::TargetListRow;
using leshy1::apps::targets::TargetComparisonSide;
using leshy1::apps::targets::TargetProductBinding;
using leshy1::apps::targets::TargetsController;
using leshy1::apps::targets::TargetsLoadStatus;
using leshy1::apps::targets::TargetsView;
using leshy1::apps::targets::TargetsWorkspace;
using leshy1::apps::ble::BleDeviceCatalog;
using leshy1::apps::ble::BleCompanyDatabase;
using leshy1::apps::ble::BleDeviceKind;
using leshy1::apps::ble::BleDeviceNavigationOrder;
using leshy1::apps::ble::BleDeviceSignalStats;
using leshy1::apps::ble::BleSubtype;
using leshy1::apps::ble::BleTrackerKind;
using leshy1::apps::wifi::WifiNetworkCatalog;
using leshy1::apps::wifi::WifiNetworkNavigationOrder;
using leshy1::apps::wifi::WifiNetworkSignalStats;
using leshy1::apps::wifi::WifiDeviceCatalog;
using leshy1::apps::wifi::WifiDeviceObservation;
using leshy1::apps::wifi::WifiDeviceRecord;
using leshy1::apps::wifi::WifiDeviceNavigationOrder;
using leshy1::apps::wifi::WifiOuiDatabase;
using leshy1::apps::wifi::WifiDeviceGeneration;
using leshy1::apps::wifi::WifiDeviceState;
using leshy1::apps::wifi::WifiChannelLoadSnapshot;
using leshy1::domain::apps::AppCatalog;
using leshy1::domain::apps::AppMenuItem;
using leshy1::domain::hardware::CapabilityRecord;
using leshy1::domain::targets::TargetChangeKind;
using leshy1::domain::targets::TargetComparisonClass;
using leshy1::domain::targets::TargetCatalog;
using leshy1::domain::targets::CorrelationDecisionLog;
using leshy1::domain::targets::CorrelationProposal;
using leshy1::domain::targets::CorrelationDecision;
using leshy1::domain::targets::TargetId;
using leshy1::domain::targets::TargetMergeHistory;
using leshy1::domain::targets::TargetMergeId;
using leshy1::domain::targets::TargetMergeRecord;
using leshy1::domain::targets::TargetMergeStatus;
using leshy1::domain::targets::TargetRecord;
using leshy1::domain::hardware::CapabilityState;
using leshy1::domain::hardware::HardwareInventory;
using leshy1::domain::observations::Observation;
using leshy1::domain::observations::RadioKind;
using leshy1::drivers::ble::BleAdvertisementRecord;
using leshy1::drivers::radio::ShieldReceiverProbeReport;
using leshy1::drivers::radio::ShieldReceiverProbeStatus;
using leshy1::drivers::radio::Cc1101PassiveSample;
using leshy1::drivers::radio::Cc1101PassiveSpectrumPlan;
using leshy1::drivers::radio::Cc1101PassiveSpectrumReport;
using leshy1::drivers::radio::Cc1101PassiveSpectrumStatus;
using leshy1::drivers::radio::Nrf24PassiveSpectrumPlan;
using leshy1::drivers::radio::Nrf24PassiveSpectrumReport;
using leshy1::drivers::radio::Nrf24PassiveSpectrumStatus;
using leshy1::drivers::radio::Nrf24PassiveSweep;
using leshy1::drivers::wifi::WifiScanRecord;
using leshy1::kernel::runtime::AppRuntime;
using leshy1::kernel::runtime::LaunchStatus;
using leshy1::kernel::runtime::Resource;
using leshy1::kernel::runtime::ResourceBroker;
using leshy1::kernel::safety::SafetyReason;
using leshy1::kernel::safety::SafetyRetainedRecord;
using leshy1::kernel::safety::SafetyState;
using leshy1::kernel::safety::SafetySupervisor;
using leshy1::kernel::safety::SupervisedWorker;
using leshy1::kernel::safety::WorkerDeadlineSnapshot;
using leshy1::services::power::PowerSafetyPolicy;
using leshy1::services::power::PowerTelemetryState;
using leshy1::services::power::PowerWriteDisposition;
using leshy1::services::guard::AirspaceGuardBleRetention;
using leshy1::services::guard::AirspaceGuardBleRetentionStats;
using leshy1::services::guard::AirspaceGuardPolicy;
using leshy1::services::guard::AirspaceGuardReport;
using leshy1::services::guard::AirspaceGuardStatus;
using leshy1::services::guard::BleLiveRetentionDisposition;
using leshy1::services::auth::WifiAuthenticationCaptureInput;
using leshy1::services::auth::WifiAuthenticationCaptureOutcome;
using leshy1::services::auth::WifiAuthenticationCaptureReport;
using leshy1::services::ble::BleInspectorCapture;
using leshy1::services::ble::BleInspectorCaptureCounters;
using leshy1::services::ble::BleInspectorCaptureDisposition;
using leshy1::services::ble::BleInspectorCaptureState;
using leshy1::services::ble::BleInspectorExportStatus;
using leshy1::services::ble::BleInspectorRawAdvertisement;
using leshy1::services::ble::BleInspectorTarget;
using leshy1::services::ble::BleGattCharacteristicFact;
using leshy1::services::ble::BleGattInspector;
using leshy1::services::ble::BleGattInspectorFailure;
using leshy1::services::ble::BleGattInspectorPermission;
using leshy1::services::ble::BleGattInspectorState;
using leshy1::services::ble::BleGattServiceFact;
using leshy1::ui::WifiAuthenticationCaptureLiveProgress;
using leshy1::ui::WifiAuthenticationCapturePersistence;
using leshy1::ui::WifiAuthenticationCaptureUiFailure;
using leshy1::ui::WifiAuthenticationCaptureUiInput;
using leshy1::ui::WifiAuthenticationCaptureUiMetric;
using leshy1::ui::WifiAuthenticationCaptureUiModel;
using leshy1::ui::WifiAuthenticationCaptureUiPhase;
using leshy1::ui::WifiAuthenticationCaptureUiTone;
using leshy1::ui::uiTextSpec;
using leshy1::services::targets::TargetAction;
using leshy1::services::targets::TargetActionKind;
using leshy1::services::targets::TargetService;
using leshy1::services::targets::TargetMergeAction;
using leshy1::services::targets::TargetMergeActionKind;
using leshy1::services::targets::TargetMergeService;
using leshy1::services::targets::CorrelationAction;
using leshy1::services::targets::CorrelationActionKind;
using leshy1::services::targets::CorrelationDecisionStatus;
using leshy1::services::targets::CorrelationService;
using leshy1::services::targets::SurveySessionTargetEvidenceLookup;
using leshy1::apps::targets::TargetActionItem;
using leshy1::kernel::safety::WorkerDeadlineSupervisor;
using leshy1::platform::arduino::BoardSafeOutputs;
using leshy1::platform::arduino::BoardAntennaStatusLeds;
using leshy1::platform::arduino::BoardInfraredReceiver;
using leshy1::platform::arduino::InfraredReceiverReport;
using leshy1::platform::arduino::InfraredReceiverStatus;
using leshy1::platform::arduino::BoardCc1101PassiveSpectrum;
using leshy1::platform::arduino::BoardNrf24PassiveSpectrum;
using leshy1::platform::arduino::BoardShieldReceiverProbe;
using leshy1::platform::arduino::ArduinoFsSessionStoreIo;
using leshy1::platform::arduino::ArduinoFsSessionStoreWorkspace;
using leshy1::platform::arduino::ArduinoLittleFsSessionStoreIo;
using leshy1::platform::arduino::BoardSdFilesystem;
using leshy1::platform::arduino::BoardAutomationPackageReader;
using leshy1::platform::arduino::BoardAutomationPackageStatus;
using leshy1::platform::arduino::BoardStorageAdapter;
using leshy1::platform::arduino::BoardTouchInput;
using leshy1::platform::arduino::TouchCalibrationSource;
using leshy1::platform::arduino::BoardBlePassiveScanner;
using leshy1::platform::arduino::BoardBleGattInspectorTransport;
using leshy1::platform::arduino::BoardBleGattHilFault;
using leshy1::platform::arduino::boardBleGattHilFaultName;
using leshy1::platform::arduino::BoardBlePassiveScanResult;
using leshy1::platform::arduino::BoardBleBeginDiagnostic;
using leshy1::platform::arduino::BleRecordDisposition;
using leshy1::platform::arduino::BoardSdSpiTransport;
using leshy1::platform::arduino::BoardWifiPassiveScanner;
using leshy1::platform::arduino::BoardWifiPassiveCapture;
using leshy1::platform::arduino::BoardWifiPassiveScanResult;
using leshy1::platform::arduino::boardWifiPassiveBeginFailureStageName;
using leshy1::platform::arduino::DisposableOtaLittleFs;
using leshy1::platform::arduino::WifiRecordDisposition;
using leshy1::platform::arduino::RamSessionStoreIo;
using leshy1::services::diagnostics::BootMetrics;
using leshy1::services::diagnostics::HilSession;
using leshy1::services::diagnostics::HilSessionStatus;
using leshy1::services::survey::SessionState;
using leshy1::services::survey::SessionStatus;
using leshy1::services::survey::CaptureMetadata;
using leshy1::services::survey::CaptureMetadataStatus;
using leshy1::services::survey::FramePayloadFormat;
using leshy1::services::survey::SourceFailureClass;
using leshy1::services::survey::SourceTimeline;
using leshy1::services::survey::SourceTimelineState;
using leshy1::services::survey::SourceTimelineStatus;
using leshy1::services::survey::SourceWindow;
using leshy1::services::survey::SourceWindowReason;
using leshy1::services::survey::SourceWindowState;
using leshy1::services::survey::SurveySession;
using leshy1::ui::UiAction;
using leshy1::ui::AirspaceGuardUiModel;
using leshy1::ui::AirspaceGuardUiTone;
using leshy1::ui::UiController;
using leshy1::ui::UiLanguage;
using leshy1::ui::InterfaceSetting;
using leshy1::ui::InterfaceSettingsController;
using leshy1::ui::InterfaceTheme;
using leshy1::ui::AntennaStatusController;
using leshy1::ui::UiTextId;
using leshy1::ui::UiTextRole;
using leshy1::ui::LanguageController;
using leshy1::ui::Pcf8574ButtonInput;
using leshy1::ui::TouchPoint;
using leshy1::ui::TouchTarget;
using leshy1::ui::TouchTargetLayout;
using leshy1::ui::visual::Layout;
using leshy1::ui::visual::Palette;
using leshy1::ui::visual::Components;
using leshy1::ui::visual::Rect;
using leshy1::ui::visual::Tone;

