anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
constexpr std::uint32_t kConsoleBaud = 115200;
constexpr std::uint32_t kI2cHz = 100000;
constexpr std::uint8_t kInputProbeMaxAttempts = 8;
constexpr std::uint32_t kInputProbeRetryDelayMs = 5;
constexpr leshy1::kernel::runtime::ResourceOwner kSdIdentificationOwner = 2;
constexpr leshy1::kernel::runtime::ResourceOwner kWifiIngressOwner = 3;
constexpr leshy1::kernel::runtime::ResourceOwner kBootCatalogOwner = 4;
constexpr leshy1::kernel::runtime::ResourceOwner kLittleFsHilOwner = 5;
constexpr leshy1::kernel::runtime::ResourceOwner kBleGattHilConflictOwner = 7;
constexpr std::size_t kSdThroughputSamples = 32;
constexpr std::size_t kWifiIngressMaxSamples = 32;
constexpr std::uint64_t kWifiIngressP99EncodedBytesPerSecond = 546;
constexpr std::uint32_t kStorageRateSafetyMultiplier = 4;
constexpr std::uint64_t kStorageRequiredEncodedBytesPerSecond =
    kWifiIngressP99EncodedBytesPerSecond * kStorageRateSafetyMultiplier;
constexpr std::uint64_t kProductSurveyCommitBytes = 64U * 1024U;
constexpr std::uint64_t kProductSurveyReserveBytes = 1024U * 1024U;
constexpr unsigned kWifiPersistMaxScans = 8;
constexpr const char* kFullGuidedDisposableRunId = "full-guided-v10";
constexpr std::uint64_t kFullGuidedDisposableBytes = 64U * 1024U;
constexpr std::uint64_t kFullGuidedDisposableReserve = 1024U * 1024U;
constexpr std::uint8_t kFullGuidedReceiveSamples = 32;
constexpr std::uint8_t kFullGuidedInfraredSamples = 64;
constexpr const char* kSdSessionStorePrefix =
    "storage.sd.session-store disposable-write ";
constexpr const char* kSdSessionThroughputPrefix =
    "storage.sd.session-store throughput disposable-write ";
constexpr const char* kSdSessionBatchThroughputPrefix =
    "storage.sd.session-store batch-throughput disposable-write ";
constexpr const char* kWifiPersistPrefix =
    "survey.wifi.passive-persist disposable-write ";
constexpr const char* kSdSessionResetPrefix =
    "storage.sd.session-store reset disposable-write ";
constexpr const char* kSdSessionRecoverPrefix =
    "storage.sd.session-store recover disposable-read-only ";
constexpr const char* kSdSessionPowerCutPrefix =
    "storage.sd.session-store power-cut disposable-write ";
constexpr const char* kSdSessionPowerCutRecoverPrefix =
    "storage.sd.session-store power-cut-recover disposable-read-only ";
constexpr const char* kSdReadOnlyMountPrefix =
    "storage.sd.readonly-mount disposable-read-only ";
constexpr const char* kWifiIngressPrefix =
    "survey.wifi.passive-ingress measure passive-only ";
constexpr const char* kWifiNetworkHilSelectPrefix =
    "wifi.network.hil-select-label-fnv1a64 ";
constexpr const char* kBleDeviceHilSelectPrefix =
    "ble.device.hil-select-label-fnv1a64 ";
constexpr const char* kProductBootstrapPrefix =
    "storage.product.bootstrap disposable-write ";
constexpr const char* kProductEnrollPrefix =
    "storage.product.enroll disposable-read-only ";
constexpr const char* kLittleFsParityPrefix =
    "storage.littlefs.parity disposable-ota1 ";
constexpr const char* kLittleFsResetPrefix =
    "storage.littlefs.reset disposable-ota1 ";
constexpr const char* kLittleFsResetRecoverPrefix =
    "storage.littlefs.reset recover read-only ";
constexpr const char* kTargetsMergeFixturePreparePrefix =
    "targets.merge-split-fixture prepare disposable-ota1 ";
constexpr const char* kTargetsMergeFixtureClearPrefix =
    "targets.merge-split-fixture clear disposable-ota1 ";
constexpr std::uint64_t kTargetsMergeFixtureByteLimit = 256U * 1024U;
constexpr const char* kProductEnrollmentNamespace = "leshy1";
constexpr const char* kProductEnrollmentKey = "sd.cid.v1";
constexpr const char* kUiPreferencesNamespace = "leshy1-ui";
constexpr const char* kUiLanguageKey = "lang.v1";
constexpr const char* kUiBrightnessKey = "bright.v1";
constexpr const char* kUiThemeKey = "theme.v1";
constexpr const char* kStatusLedBrightnessKey = "led.v1";
constexpr const char* kLegacyUiPreferencesNamespace = "leshy";
constexpr const char* kLegacyStatusLedBrightnessKey = "led_br";
HardwareInventory inventory;
AppCatalog appCatalog;
leshy1::platform::arduino::MbedTlsDeviceLockCrypto deviceLockCrypto;
leshy1::platform::arduino::MbedTlsProtectedDataCipher protectedDataCipher;
leshy1::platform::arduino::NvsDeviceLockStore deviceLockStore;
leshy1::services::security::DeviceLock deviceLock(deviceLockStore,
                                                   deviceLockCrypto);
bool deviceLockRestoreSucceeded = false;
ResourceBroker resourceBroker;
leshy1::platform::arduino::ArduinoSerialConsoleEndpoint
    serialConsoleEndpoint(Serial1);
leshy1::services::actions::ActionDispatcher
    serialConsoleActionDispatcher(resourceBroker);
leshy1::services::serial::SerialConsoleConfig serialConsoleLastConfig{};
leshy1::services::serial::SerialConsolePreflightStatus
    serialConsoleLastPreflight =
        leshy1::services::serial::SerialConsolePreflightStatus::
            ProfileUnavailable;
AppRuntime appRuntime(resourceBroker);
SurveySession surveySession;
SurveyController surveyController(surveySession);
SurveySourceController surveySourceController;
FieldSurveyTracker fieldSurveyTracker;
SurveySession librarySession;
// Destructive storage fixtures and Self-Test are admitted only while the
// foreground Survey workflow is stopped. Reuse its bounded session instead of
// permanently reserving another 10 KiB on N16 boards without PSRAM.
SurveySession& littleFsResetSession = surveySession;
LibraryController libraryController;
AutomationPackageCatalog automationPackageCatalog;
AutomationInspectorController automationInspectorController;
BoardAutomationPackageStatus automationCatalogStatus =
    BoardAutomationPackageStatus::DirectoryUnavailable;
std::uint32_t automationCatalogOmittedEntries = 0U;
bool automationCatalogRefreshPending = false;
bool automationInspectionPending = false;
SessionCatalog sessionCatalog;
struct TargetsProductRuntime final {
    TargetCatalog* catalogStorage = nullptr;
    CorrelationDecisionLog* decisionsStorage = nullptr;
    TargetMergeHistory* mergesStorage = nullptr;
    leshy1::services::targets::SessionCorrelationProposalSet*
        correlationsStorage = nullptr;
    leshy1::domain::targets::TargetComparisonResult* comparisonStorage =
        nullptr;
    TargetsWorkspace* workspaceStorage = nullptr;
    TargetsController* controllerStorage = nullptr;
    TargetsWorkspace& workspace;
    TargetsController& controller;
    TargetMergeHistory& merges;

    TargetsProductRuntime(TargetCatalog* catalogValue,
                          CorrelationDecisionLog* decisionsValue,
                          TargetMergeHistory* mergesValue,
                          leshy1::services::targets::
                              SessionCorrelationProposalSet* correlationsValue,
                          leshy1::domain::targets::TargetComparisonResult*
                              comparisonValue,
                          TargetsWorkspace* workspaceValue,
                          TargetsController* controllerValue)
        : catalogStorage(catalogValue),
          decisionsStorage(decisionsValue),
          mergesStorage(mergesValue),
          correlationsStorage(correlationsValue),
          comparisonStorage(comparisonValue),
          workspaceStorage(workspaceValue),
          controllerStorage(controllerValue),
          workspace(*workspaceValue),
          controller(*controllerValue),
          merges(*mergesValue) {}

