anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    bool detachState(TargetCatalog** catalog, CorrelationDecisionLog** decisions,
                     TargetMergeHistory** mergesValue) {
        if (catalog == nullptr || decisions == nullptr || mergesValue == nullptr ||
            catalogStorage == nullptr || decisionsStorage == nullptr ||
            mergesStorage == nullptr) {
            return false;
        }
        // The UI/controller graph contains references into the state blocks, so
        // destroy it before handing those blocks to the persistence worker.
        delete controllerStorage;
        controllerStorage = nullptr;
        delete workspaceStorage;
        workspaceStorage = nullptr;
        delete comparisonStorage;
        comparisonStorage = nullptr;
        delete correlationsStorage;
        correlationsStorage = nullptr;
        *catalog = catalogStorage;
        *decisions = decisionsStorage;
        *mergesValue = mergesStorage;
        catalogStorage = nullptr;
        decisionsStorage = nullptr;
        mergesStorage = nullptr;
        return true;
    }
    bool detachForWeb(
        TargetCatalog** catalog, CorrelationDecisionLog** decisions,
        TargetMergeHistory** mergesValue,
        leshy1::domain::targets::TargetComparisonResult** comparisonValue) {
        if (catalog == nullptr || decisions == nullptr ||
            mergesValue == nullptr || comparisonValue == nullptr ||
            catalogStorage == nullptr || decisionsStorage == nullptr ||
            mergesStorage == nullptr || comparisonStorage == nullptr) {
            return false;
        }
        // The local AP needs contiguous internal heap. Keep only the immutable
        // read/mutation state needed by Companion and release the controller,
        // editing workspaces and correlation proposals while Web is active.
        delete controllerStorage;
        controllerStorage = nullptr;
        delete workspaceStorage;
        workspaceStorage = nullptr;
        delete correlationsStorage;
        correlationsStorage = nullptr;
        *catalog = catalogStorage;
        *decisions = decisionsStorage;
        *mergesValue = mergesStorage;
        *comparisonValue = comparisonStorage;
        catalogStorage = nullptr;
        decisionsStorage = nullptr;
        mergesStorage = nullptr;
        comparisonStorage = nullptr;
        return true;
    }
    ~TargetsProductRuntime() {
        delete controllerStorage;
        delete workspaceStorage;
        delete comparisonStorage;
        delete correlationsStorage;
        delete decisionsStorage;
        delete catalogStorage;
        delete mergesStorage;
    }
};
TargetsProductRuntime* targetsProductRuntime = nullptr;
const char* targetsProductStatus = "not_loaded";
std::uint32_t targetsHeapFreeBefore = 0;
std::uint32_t targetsHeapFreeAfter = 0;
std::uint64_t targetsLoadElapsedUs = 0;
std::uint64_t targetsLoadMaximumPhaseUs = 0;
std::uint32_t targetsLoadWatchdogFeeds = 0;
std::uint32_t targetsBlockedWriteAttempts = 0;
int targetsFilesystemMountError = 0;
std::uint8_t targetsIdentityAttempts = 0;
std::uint8_t targetsIdentityTransientRetries = 0;
bool targetsIdentityCleanupComplete = true;
std::uint8_t targetsFilesystemMountAttempts = 0;
std::uint8_t targetsFilesystemMountTransientRetries = 0;
bool targetsCleanupComplete = true;
bool targetsMergeFixtureRuntime = false;
bool targetsMergeFixtureSdAccessed = false;
bool targetsMergeFixtureProductStateTouched = false;
TargetProductBinding targetsBaselineBinding{};
TargetProductBinding targetsCurrentBinding{};
bool targetsComparisonLoaded = false;
leshy1::services::companion::CompanionConnection usbCompanionConnection{};
leshy1::services::companion::CompanionConnection webCompanionConnection{};
struct CompanionMutationRuntime final {
    leshy1::services::companion::CompanionMutationState state =
        leshy1::services::companion::CompanionMutationState::None;
    leshy1::services::companion::CompanionMutationStatus status =
        leshy1::services::companion::CompanionMutationStatus::InvalidRequest;
    leshy1::services::companion::CompanionMutationId id{};
    TargetAction action{};
    std::uint32_t targetRevision = 0;
    std::uint32_t stateGeneration = 0;
};
CompanionMutationRuntime usbCompanionMutation{};
CompanionMutationRuntime webCompanionMutation{};
leshy1::services::companion::CompanionConnectivity webCompanionConnectivity;
leshy1::services::companion::CompanionLocalCredentials
    webCompanionCredentials{};
std::array<std::uint8_t, 16> webCompanionHilEntropy{};
bool webCompanionHilEntropyPresent = false;
leshy1::platform::arduino::ArduinoCompanionWebService
    arduinoCompanionWebService;
bool webCompanionOverlay = false;
std::uint32_t webCompanionGeneration = 0;
TargetCatalog* webCompanionCatalog = nullptr;
CorrelationDecisionLog* webCompanionDecisions = nullptr;
TargetMergeHistory* webCompanionMerges = nullptr;
leshy1::domain::targets::TargetComparisonResult* webCompanionComparison =
    nullptr;
TargetId webCompanionSelectedTargetId{};
std::uint32_t webCompanionHeapBeforeSuspend = 0;
std::uint32_t webCompanionHeapAfterSuspend = 0;
bool webCompanionSurveyWorkerSuspended = false;
std::uint32_t webCompanionHeapBeforeWorkerSuspend = 0;
std::uint32_t webCompanionHeapAfterWorkerSuspend = 0;

void clearWebCompanionEntropy(std::array<std::uint8_t, 16>& entropy) {
    volatile std::uint8_t* cursor = entropy.data();
    for (std::size_t remaining = entropy.size();
         remaining != 0U; --remaining) {
        *cursor++ = 0;
    }
}

void clearWebCompanionHilEntropy() {
    clearWebCompanionEntropy(webCompanionHilEntropy);
    webCompanionHilEntropyPresent = false;
}

std::uint32_t targetsStateGeneration = 0;
leshy1::storage::RecoveryChoice targetsStateHead =
    leshy1::storage::RecoveryChoice::None;
enum class TargetsMutationState : std::uint8_t {
    Idle,
    Saving,
    Saved,
    Failed,
};
const char* targetsMutationStateName(TargetsMutationState state) {
    switch (state) {
        case TargetsMutationState::Idle: return "idle";
        case TargetsMutationState::Saving: return "saving";
        case TargetsMutationState::Saved: return "saved";
        case TargetsMutationState::Failed: return "failed";
    }
    return "failed";
}
struct TargetsMutationEvent final {
    const char* status = "not_started";
    bool persisted = false;
    bool catalogRecovered = false;
    bool cleanupComplete = false;
    bool favorite = false;
    TargetActionKind actionKind = TargetActionKind::SetFavorite;
    bool correlation = false;
    bool merge = false;
    TargetMergeActionKind mergeKind = TargetMergeActionKind::Merge;
    TargetMergeStatus mergeStatus = TargetMergeStatus::InvalidArgument;
    TargetMergeId mergeOperationId{};
    TargetId mergeSourceId{};
    CorrelationActionKind correlationKind = CorrelationActionKind::Accept;
    CorrelationDecisionStatus correlationStatus =
        CorrelationDecisionStatus::InvalidArgument;
    std::array<char, TargetRecord::kNotesCapacity + 1> name{};
    std::uint16_t nameLength = 0;
    TargetId targetId{};
    std::uint32_t expectedRevision = 0;
    std::uint32_t targetRevision = 0;
    bool companion = false;
    bool companionWeb = false;
    std::uint32_t generation = 0;
    leshy1::storage::RecoveryChoice head =
        leshy1::storage::RecoveryChoice::None;
    leshy1::storage::TargetStateStoreStatus storeStatus =
        leshy1::storage::TargetStateStoreStatus::InvalidArgument;
    leshy1::storage::CommitStage commitStage =
        leshy1::storage::CommitStage::WritePayloads;
    std::uint64_t elapsedUs = 0;
    std::uint64_t bytesWritten = 0;
    std::uint32_t writeCalls = 0;
    std::uint32_t fileSyncs = 0;
    std::uint32_t directorySyncs = 0;
    std::uint32_t heapFreeBeforeMount = 0;
    std::uint32_t heapLargestBeforeMount = 0;
    int filesystemMountError = 0;
    std::uint8_t identityAttempts = 0;
    std::uint8_t identityTransientRetries = 0;
    char expectedFingerprint[33] = {};
    char observedFingerprint[33] = {};
};
TargetsMutationState targetsMutationState = TargetsMutationState::Idle;
const char* targetsMutationStatus = "idle";
TargetsMutationEvent targetsMutationReport{};
TargetCatalog* targetsMutationCatalog = nullptr;
CorrelationDecisionLog* targetsMutationDecisions = nullptr;
TargetMergeHistory* targetsMutationMerges = nullptr;
TargetId targetsMutationTargetId{};
bool targetsMutationFavorite = false;
TargetActionKind targetsMutationKind = TargetActionKind::SetFavorite;
bool targetsMutationCorrelation = false;
CorrelationActionKind targetsMutationCorrelationKind =
    CorrelationActionKind::Accept;
CorrelationProposal targetsMutationProposal{};
bool targetsMutationMerge = false;
TargetMergeActionKind targetsMutationMergeKind =
    TargetMergeActionKind::Merge;
TargetMergeId targetsMutationMergeOperationId{};
TargetId targetsMutationMergeSourceId{};
std::array<char, TargetRecord::kNotesCapacity + 1> targetsMutationText{};
std::uint16_t targetsMutationTextLength = 0;
std::uint32_t targetsMutationExpectedRevision = 0;
bool targetsMutationCompanion = false;
bool targetsMutationCompanionWeb = false;
std::uint64_t targetsMutationStartActionUs = 0;
QueueHandle_t targetsMutationEvents = nullptr;
TaskHandle_t targetsMutationTaskHandle = nullptr;
leshy1::services::survey::ObservationQueue surveyIngressQueue;
union TargetsStoreCodecWorkspace final {
    leshy1::storage::SessionStoreWorkspace session;
    leshy1::storage::TargetDecisionStateStoreWorkspace targetDecision;
    TargetCatalog admissionScratch;
    FieldSurveyCatalog fieldSurveyScratch;
    SpectrumViewport spectrum;

    TargetsStoreCodecWorkspace() : session{} {}
    ~TargetsStoreCodecWorkspace() {}
};
static_assert(
    sizeof(TargetsStoreCodecWorkspace) >=
            sizeof(leshy1::storage::TargetDecisionStateStoreWorkspace) &&
        sizeof(TargetsStoreCodecWorkspace) -
                sizeof(leshy1::storage::TargetDecisionStateStoreWorkspace) <
            alignof(TargetsStoreCodecWorkspace),
    "shared store codec workspace must add only the larger member");
static_assert(sizeof(TargetCatalog) <= sizeof(TargetsStoreCodecWorkspace),
              "admission scratch must fit the shared store workspace");
static_assert(sizeof(FieldSurveyCatalog) <= sizeof(TargetsStoreCodecWorkspace),
              "field survey scratch must fit the shared store workspace");
static_assert(sizeof(SpectrumViewport) <= sizeof(TargetsStoreCodecWorkspace),
              "spectrum history must fit the shared store workspace");
static_assert(
    sizeof(SpectrumViewport) <=
        sizeof(leshy1::storage::TargetDecisionStateStoreWorkspace),
    "spectrum history must not grow the pre-existing largest workspace");
enum class TargetsStoreCodecWorkspaceOwner : std::uint8_t {
    Session,
    TargetDecision,
    AdmissionScratch,
    FieldSurveyScratch,
    Spectrum,
};
TargetsStoreCodecWorkspace targetsStoreCodecWorkspace;
TargetsStoreCodecWorkspaceOwner targetsStoreCodecWorkspaceOwner =
    TargetsStoreCodecWorkspaceOwner::Session;
extern SurveyWorkflow surveyWorkflow;

bool sessionStoreWorkspaceAvailable() {
    return targetsStoreCodecWorkspaceOwner ==
        TargetsStoreCodecWorkspaceOwner::Session;
}

leshy1::storage::SessionStoreWorkspace& sessionStoreWorkspace() {
    // All asynchronous and console callers are serialized by the single owner
    // guard below.  This accessor creates a fresh, short-lived reference only
    // while the Session union member is active; no reference survives a
    // placement-new lifetime transition.
    return targetsStoreCodecWorkspace.session;
}

leshy1::storage::TargetDecisionStateStoreWorkspace*
acquireTargetsStoreCodecWorkspace() {
    if (targetsStoreCodecWorkspaceOwner !=
        TargetsStoreCodecWorkspaceOwner::Session) return nullptr;
    surveyWorkflow.bindWorkspace(nullptr);
    targetsStoreCodecWorkspace.session.~SessionStoreWorkspace();
    auto* workspace = new (&targetsStoreCodecWorkspace.targetDecision)
        leshy1::storage::TargetDecisionStateStoreWorkspace();
    targetsStoreCodecWorkspaceOwner =
        TargetsStoreCodecWorkspaceOwner::TargetDecision;
    return workspace;
}

