anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void releaseTargetsStoreCodecWorkspace(
    leshy1::storage::TargetDecisionStateStoreWorkspace* workspace) {
    if (targetsStoreCodecWorkspaceOwner !=
            TargetsStoreCodecWorkspaceOwner::TargetDecision ||
        workspace != &targetsStoreCodecWorkspace.targetDecision) {
        return;
    }
    workspace->~TargetDecisionStateStoreWorkspace();
    new (&targetsStoreCodecWorkspace.session)
        leshy1::storage::SessionStoreWorkspace();
    targetsStoreCodecWorkspaceOwner =
        TargetsStoreCodecWorkspaceOwner::Session;
    surveyWorkflow.bindWorkspace(&targetsStoreCodecWorkspace.session);
}

TargetCatalog* acquireTargetsAdmissionScratch() {
    if (targetsStoreCodecWorkspaceOwner !=
        TargetsStoreCodecWorkspaceOwner::Session) return nullptr;
    surveyWorkflow.bindWorkspace(nullptr);
    targetsStoreCodecWorkspace.session.~SessionStoreWorkspace();
    auto* scratch = new (&targetsStoreCodecWorkspace.admissionScratch)
        TargetCatalog();
    targetsStoreCodecWorkspaceOwner =
        TargetsStoreCodecWorkspaceOwner::AdmissionScratch;
    return scratch;
}

void releaseTargetsAdmissionScratch(TargetCatalog* scratch) {
    if (targetsStoreCodecWorkspaceOwner !=
            TargetsStoreCodecWorkspaceOwner::AdmissionScratch ||
        scratch != &targetsStoreCodecWorkspace.admissionScratch) {
        return;
    }
    scratch->~TargetCatalog();
    new (&targetsStoreCodecWorkspace.session)
        leshy1::storage::SessionStoreWorkspace();
    targetsStoreCodecWorkspaceOwner =
        TargetsStoreCodecWorkspaceOwner::Session;
    surveyWorkflow.bindWorkspace(&targetsStoreCodecWorkspace.session);
}

FieldSurveyCatalog* acquireFieldSurveyScratch() {
    if (targetsStoreCodecWorkspaceOwner !=
        TargetsStoreCodecWorkspaceOwner::Session) return nullptr;
    surveyWorkflow.bindWorkspace(nullptr);
    targetsStoreCodecWorkspace.session.~SessionStoreWorkspace();
    auto* scratch = new (&targetsStoreCodecWorkspace.fieldSurveyScratch)
        FieldSurveyCatalog();
    targetsStoreCodecWorkspaceOwner =
        TargetsStoreCodecWorkspaceOwner::FieldSurveyScratch;
    return scratch;
}

void releaseFieldSurveyScratch(FieldSurveyCatalog* scratch) {
    if (targetsStoreCodecWorkspaceOwner !=
            TargetsStoreCodecWorkspaceOwner::FieldSurveyScratch ||
        scratch != &targetsStoreCodecWorkspace.fieldSurveyScratch) {
        return;
    }
    scratch->~FieldSurveyCatalog();
    new (&targetsStoreCodecWorkspace.session)
        leshy1::storage::SessionStoreWorkspace();
    targetsStoreCodecWorkspaceOwner =
        TargetsStoreCodecWorkspaceOwner::Session;
    surveyWorkflow.bindWorkspace(&targetsStoreCodecWorkspace.session);
}

bool captureFieldSurveyPrevious(const SurveySession& session) {
    FieldSurveyCatalog* scratch = acquireFieldSurveyScratch();
    if (scratch == nullptr) {
        fieldSurveyTracker.clearPrevious();
        return false;
    }
    const bool captured = fieldSurveyTracker.capturePrevious(session, *scratch);
    releaseFieldSurveyScratch(scratch);
    return captured;
}

const leshy1::apps::survey::FieldSurveyVisitResult&
completeFieldSurveyVisit(const SurveySession& session) {
    FieldSurveyCatalog* scratch = acquireFieldSurveyScratch();
    if (scratch == nullptr) return fieldSurveyTracker.rejectVisit();
    const auto& result = fieldSurveyTracker.completeVisit(session, *scratch);
    releaseFieldSurveyScratch(scratch);
    return result;
}
ArduinoFsSessionStoreWorkspace sdSessionStoreIoWorkspace;
RamSessionStoreIo ramSessionStore;
leshy1::storage::SessionStoreIoRouter surveyStoreRouter(ramSessionStore);
bool serviceProductSurveyCommitBoundary();
bool productSurveyCommitSupervisionActive = false;
// Every physical-store path owns Storage+RadioSpi exclusively and closes its
// adapter before releasing that lease. Product and diagnostic paths therefore
// share one 4.4 KiB I/O workspace safely.
ArduinoFsSessionStoreIo productSurveyStore(
    sdSessionStoreIoWorkspace, serviceProductSurveyCommitBoundary,
    &protectedDataCipher, &deviceLock);
BoardSdFilesystem productSurveyFilesystem;
SurveyWorkflow surveyWorkflow(surveyController, surveyStoreRouter,
                              sessionStoreWorkspace(), librarySession,
                              libraryController, false, true);
SurveyPipeline surveyPipeline(surveyWorkflow, surveyIngressQueue);
SourceTimeline productSurveyTimeline;
BoardStorageAdapter boardStorageAdapter;
leshy1::storage::MediaDiscovery storageDiscovery;
bool storageDiscoveryReady = false;
bool surveyDemoReady = false;
bool libraryDemoReady = false;
const char* lastRuntimeEvent = "idle";
BootMetrics bootMetrics;
char runningAppElfSha256[65] = {};
HilSession hilSession;
TFT_eSPI display;
// Reuse one 1-bpp off-screen row for all live text fields. At 216x24 it costs
// only 648 bytes, which is small enough for the no-PSRAM board while still
// replacing an erase-then-draw pair with one opaque TFT transfer. This keeps
// the proven 0.x sprite strategy without reserving a full RGB565 framebuffer.
TFT_eSprite liveTextRowSprite(&display);
// Dense metadata rows are 19 px apart. A second 216x19 1-bpp compositor costs
// 513 bytes and lets a later BLE advertisement replace one complete field
// without clearing either the whole card or the neighbouring row first.
TFT_eSprite liveMetaTextRowSprite(&display);
BoardTouchInput boardTouchInput;
bool touchCalibrationRequiredAtBoot = false;
bool touchCalibrationSucceededAtBoot = false;
UiController uiController;
LanguageController languageController;
InterfaceSettingsController interfaceSettingsController;
AntennaStatusController antennaStatusController;
BoardAntennaStatusLeds boardAntennaStatusLeds;
SelfTestController selfTestController;
constexpr std::uint8_t kDevicePage = 9;
constexpr std::uint8_t kAboutPage = 10;
constexpr std::uint8_t kPowerPage = 11;
constexpr std::uint8_t kDeviceLockPage = 12;
constexpr std::uint8_t kSerialConsolePage = 13;
constexpr std::uint8_t kAutomationInspectorPage = 14;
constexpr std::uint16_t kAutomationActionApiVersion = 1U;
constexpr std::uint8_t kDeviceItemCount = 7;
std::uint8_t deviceSelection = 0;
enum class SerialConsoleUiView : std::uint8_t {
    Setup,
    Confirm,
    Running,
    Result,
};
SerialConsoleUiView serialConsoleUiView = SerialConsoleUiView::Setup;
std::uint8_t serialConsoleUiSelection = 0;
std::uint8_t serialConsoleBaudIndex = 4;
std::uint8_t serialConsoleDurationIndex = 1;
constexpr std::array<std::uint32_t, 5> kSerialConsoleUiBauds = {
    9600U, 19200U, 38400U, 57600U, 115200U,
};
