anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
constexpr std::array<std::uint32_t, 3> kSerialConsoleUiDurationsMs = {
    30000U, 60000U, 300000U,
};
leshy1::services::serial::SerialConsoleMode serialConsoleUiMode =
    leshy1::services::serial::SerialConsoleMode::Monitor;
leshy1::services::actions::ActionStatus serialConsoleUiActionStatus =
    leshy1::services::actions::ActionStatus::Ready;
std::array<char, 41> serialConsoleLiveLine{};
std::uint8_t serialConsoleLiveLineLength = 0;
bool serialConsoleLiveDirty = false;
std::uint32_t serialConsoleNextUiRefreshMs = 0;
leshy1::services::serial::SerialConsoleHardware serialConsoleHardware();
leshy1::services::actions::ActionContext serialConsoleActionContext(
    const leshy1::services::actions::ActionDescriptor& descriptor,
    bool confirmed);
DeviceLockController deviceLockController;
enum class DeviceLockWorkerMode : std::uint8_t {
    Product,
    KdfBenchmark,
};
struct DeviceLockWorkerEvent final {
    DeviceLockWorkerMode mode = DeviceLockWorkerMode::Product;
    bool success = false;
    std::uint64_t elapsedUs = 0;
    std::uint32_t heapBefore = 0;
    std::uint32_t heapAfter = 0;
    std::uint32_t minimumHeapAfter = 0;
    leshy1::services::security::DeviceLockAudit audit{};
};
struct DeviceLockKdfBenchmarkReport final {
    bool requested = false;
    bool complete = false;
    bool success = false;
    std::uint64_t elapsedUs = 0;
    std::uint32_t heapBefore = 0;
    std::uint32_t heapAfter = 0;
    std::uint32_t minimumHeapAfter = 0;
};
QueueHandle_t deviceLockWorkerEvents = nullptr;
TaskHandle_t deviceLockWorkerTaskHandle = nullptr;
DeviceLockSubmission deviceLockWorkerRequest{};
DeviceLockWorkerMode deviceLockWorkerMode = DeviceLockWorkerMode::Product;
DeviceLockKdfBenchmarkReport deviceLockKdfBenchmark{};
std::uint64_t deviceLockLastKdfUs = 0;
bool deviceLockPersistenceHilActive = false;
bool deviceLockPersistenceHilCleanupRequired = false;
bool deviceLockProtectedUiHilActive = false;
bool deviceLockProtectedReadHilActive = false;
leshy1::services::security::DeviceLockOperation deviceLockLastAdmissionOperation =
    leshy1::services::security::DeviceLockOperation::Status;
leshy1::services::security::DeviceLockAccess deviceLockLastAdmissionAccess =
    leshy1::services::security::DeviceLockAccess::SetupRequired;
std::uint32_t deviceLockAdmissionChecks = 0;
std::uint32_t deviceLockAdmissionBlocks = 0;

class DeviceLockFixtureProtectedDataEraser final
    : public leshy1::services::security::DeviceLockProtectedDataEraser {
public:
    bool eraseProtectedData() override {
        ++calls;
        leshy1::services::security::DeviceLockCredential current{};
        credentialPresentDuringErase =
            deviceLockPersistenceHilActive &&
            deviceLockStore.hilFixtureNamespaceActive() &&
            deviceLockStore.load(&current) ==
                leshy1::services::security::DeviceLockLoadStatus::Loaded;
        current.clear();
        fixtureProtectedDataErased = credentialPresentDuringErase;
        return fixtureProtectedDataErased;
    }

    void reset() {
        calls = 0;
        credentialPresentDuringErase = false;
        fixtureProtectedDataErased = false;
    }

    std::uint32_t calls = 0;
    bool credentialPresentDuringErase = false;
    bool fixtureProtectedDataErased = false;
};

DeviceLockFixtureProtectedDataEraser deviceLockFixtureEraser;

leshy1::services::security::DeviceLockAccess checkDeviceLockAdmission(
    leshy1::services::security::DeviceLockOperation operation) {
    std::uint64_t nowUs = static_cast<std::uint64_t>(esp_timer_get_time());
    if (nowUs == 0U) nowUs = 1U;
    deviceLockLastAdmissionOperation = operation;
    deviceLockLastAdmissionAccess = deviceLock.access(operation, nowUs);
    ++deviceLockAdmissionChecks;
    if (deviceLockLastAdmissionAccess !=
        leshy1::services::security::DeviceLockAccess::Allowed) {
        ++deviceLockAdmissionBlocks;
    }
    return deviceLockLastAdmissionAccess;
}

bool deviceLockOperationAllowed(
    leshy1::services::security::DeviceLockOperation operation) {
    // A physically attached, exact-candidate HIL session may exercise the UI
    // while a virgin product Device Lock is still unconfigured.  This lease is
    // deliberately narrower than DeviceLock::access(): it admits only page
    // navigation, remains RAM-only, and never replaces the product data key.
    // Storage and every sensitive operation continue through their normal
    // Device Lock and product-media policy gates.
    const bool hilProtectedUi =
        operation ==
            leshy1::services::security::DeviceLockOperation::ProtectedUi &&
        (deviceLockProtectedUiHilActive ||
         deviceLockProtectedReadHilActive) &&
        hilSession.active();
    const bool hilProtectedRead =
        operation ==
            leshy1::services::security::DeviceLockOperation::Companion &&
        deviceLockProtectedReadHilActive && hilSession.active();
    if (hilProtectedUi || hilProtectedRead) {
        deviceLockLastAdmissionOperation = operation;
        deviceLockLastAdmissionAccess =
            leshy1::services::security::DeviceLockAccess::Allowed;
        ++deviceLockAdmissionChecks;
        return true;
    }
    return checkDeviceLockAdmission(operation) ==
        leshy1::services::security::DeviceLockAccess::Allowed;
}

bool deviceLockProtectedPage(std::uint8_t page) {
    return page == 2U || page == 3U || page == 4U || page == 5U ||
        page == 7U || page == 8U || page == kAutomationInspectorPage;
}

void noteDeviceLockAdmissionBlocked() {
    lastRuntimeEvent =
        leshy1::services::security::deviceLockAccessName(
            deviceLockLastAdmissionAccess);
}
PowerSafetyPolicy powerSafetyPolicy;
bool powerManagerAddressAck = false;
std::uint32_t boundedSleepCount = 0;
std::uint64_t lastBoundedSleepRequestedUs = 0;
std::uint64_t lastBoundedSleepElapsedUs = 0;
esp_sleep_wakeup_cause_t lastBoundedSleepWakeCause = ESP_SLEEP_WAKEUP_UNDEFINED;
// ESP32-S3 timer wakeup can return a few milliseconds before the programmed
// interval because of RTC-domain entry/exit calibration.  Keep the acceptance
// window explicit and bounded instead of pretending the wall clock is exact.
constexpr std::uint64_t kLightSleepTimerToleranceUs = 20000ULL;
// Native USB is suspended while the S3 is in light sleep.  Give its endpoint
// time to resume before a HIL reply or the next UI action is emitted.
constexpr std::uint32_t kLightSleepTransportRecoveryMs = 150U;
struct PowerSleepTestReport {
    bool available = false;
    bool passed = false;
    bool inputTaskRetained = false;
    bool buzzerInactive = false;
    std::uint64_t requestedUs = 0;
    std::uint64_t elapsedUs = 0;
    esp_sleep_wakeup_cause_t wakeCause = ESP_SLEEP_WAKEUP_UNDEFINED;
    std::uint32_t generationBefore = 0;
    std::uint32_t generationAfter = 0;
    std::size_t observationsBefore = 0;
    std::size_t observationsAfter = 0;
    std::uint32_t heapBefore = 0;
    std::uint32_t heapAfter = 0;
    std::uint32_t minimumHeapBefore = 0;
    std::uint32_t minimumHeapAfter = 0;
    std::uint32_t leaseMask = 0;
};
