anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
PowerSleepTestReport powerSleepTestReport;
ShieldReceiverProbeReport shieldReceiverProbeReport;
Nrf24SpectrumController nrf24SpectrumController;
Nrf24SignalFinder nrf24SignalFinder;
Nrf24PassiveSpectrumReport nrf24SpectrumReport;
BoardNrf24PassiveSpectrum boardNrf24Spectrum;
Cc1101SignalFinder cc1101SignalFinder;
Cc1101SpectrumController cc1101SpectrumController;
Cc1101PassiveSpectrumReport cc1101SpectrumReport;
BoardCc1101PassiveSpectrum boardCc1101Spectrum;
// The 18.6-KiB waterfall history is needed only while a live spectrum owns the
// RF foreground. Its backing object shares the larger, mutually exclusive
// Session/Targets codec workspace above, so ordinary Wi-Fi/BLE product entry
// retains the internal heap that NimBLE needs. This null-safe facade keeps menu
// and telemetry reads deterministic when no live spectrum owns that storage.
class SpectrumViewportFacade final {
public:
    void bind(SpectrumViewport* viewport) { viewport_ = viewport; }
    void unbind(SpectrumViewport* viewport) {
        if (viewport_ == viewport) viewport_ = nullptr;
    }
    bool bound() const { return viewport_ != nullptr; }
    bool reset(std::size_t bins) {
        return viewport_ != nullptr && viewport_->reset(bins);
    }
    bool push(const std::uint8_t* intensity, std::size_t bins) {
        return viewport_ != nullptr && viewport_->push(intensity, bins);
    }
    bool setMode(SpectrumDisplayMode mode) {
        return viewport_ != nullptr && viewport_->setMode(mode);
    }
    bool previousMode() {
        return viewport_ != nullptr && viewport_->previousMode();
    }
    bool nextMode() {
        return viewport_ != nullptr && viewport_->nextMode();
    }
    SpectrumDisplayMode mode() const {
        return viewport_ == nullptr ? SpectrumDisplayMode::Spectrum
                                    : viewport_->mode();
    }
    std::size_t rowsStored() const {
        return viewport_ == nullptr ? 0U : viewport_->rowsStored();
    }
    std::size_t latestRow() const {
        return viewport_ == nullptr ? 0U : viewport_->latestRow();
    }
    bool rowValid(std::size_t row) const {
        return viewport_ != nullptr && viewport_->rowValid(row);
    }
    std::uint8_t intensity(std::size_t row, std::size_t column) const {
        return viewport_ == nullptr ? 0U : viewport_->intensity(row, column);
    }

private:
    SpectrumViewport* viewport_ = nullptr;
};
SpectrumViewportFacade spectrumViewport;
std::array<std::uint8_t, SpectrumViewport::kMaxBins> spectrumIntensity{};
std::array<std::uint16_t, Layout::ScreenWidth> spectrumScanline{};
constexpr std::uint16_t kSpectrumRenderedIntensityInvalid = UINT16_MAX;
std::array<std::uint16_t, Layout::ScreenWidth> spectrumRenderedIntensity{};
enum class FullGuidedRfStep : std::uint8_t {
    Idle,
    Nrf24Sweep,
    Cc1101Sweep,
    SubGhzOokReceive,
    SubGhzFskReceive,
    InfraredReceive,
    Complete,
    Failed,
    Cancelled,
};
const char* fullGuidedRfStepName(FullGuidedRfStep step) {
    switch (step) {
        case FullGuidedRfStep::Idle: return "idle";
        case FullGuidedRfStep::Nrf24Sweep: return "nrf24_sweep";
        case FullGuidedRfStep::Cc1101Sweep: return "cc1101_sweep";
        case FullGuidedRfStep::SubGhzOokReceive: return "subghz_ook_receive";
        case FullGuidedRfStep::SubGhzFskReceive: return "subghz_fsk_receive";
        case FullGuidedRfStep::InfraredReceive: return "infrared_receive";
        case FullGuidedRfStep::Complete: return "complete";
        case FullGuidedRfStep::Failed: return "failed";
        case FullGuidedRfStep::Cancelled: return "cancelled";
    }
    return "unknown";
}
struct FullGuidedRfState final {
    FullGuidedRfStep step = FullGuidedRfStep::Idle;
    bool resourceAcquired = false;
    bool resourceReleased = true;
    bool cleanupComplete = true;
    bool nrf24Complete = false;
    bool nrf24Passed = false;
    bool cc1101Complete = false;
    bool cc1101Passed = false;
    std::uint8_t cc1101Bins = 0;
    bool subGhzOokComplete = false;
    bool subGhzOokPassed = false;
    std::uint8_t subGhzOokSamples = 0;
    bool subGhzFskComplete = false;
    bool subGhzFskPassed = false;
    std::uint8_t subGhzFskSamples = 0;
    std::uint32_t subGhzFskEdges = 0;
    bool subGhzFskOverflow = false;
    bool infraredComplete = false;
    bool infraredPassed = false;
    std::uint8_t infraredSamples = 0;
};
FullGuidedRfState fullGuidedRfState;
Nrf24PassiveSpectrumReport fullGuidedNrf24Report;
Cc1101PassiveSpectrumReport fullGuidedCc1101Report;
Cc1101PassiveSpectrumReport fullGuidedCc1101OokReport;
Cc1101PassiveSpectrumReport fullGuidedCc1101FskReport;
InfraredReceiverReport fullGuidedInfraredReport;
std::uint64_t fullGuidedRfStartAfterUs = 0;
enum class FullGuidedArtifactStep : std::uint8_t {
    Idle,
    Recover,
    LibraryJson,
    LibraryCsv,
    CapturePcap,
    DisposableCommit,
    DisposableRemountExport,
    DisposableCleanup,
    ProductVerify,
    Complete,
    Failed,
    Cancelled,
};
const char* fullGuidedArtifactStepName(FullGuidedArtifactStep step) {
    switch (step) {
        case FullGuidedArtifactStep::Idle: return "idle";
        case FullGuidedArtifactStep::Recover: return "recover";
        case FullGuidedArtifactStep::LibraryJson: return "library_json";
        case FullGuidedArtifactStep::LibraryCsv: return "library_csv";
        case FullGuidedArtifactStep::CapturePcap: return "capture_pcap";
        case FullGuidedArtifactStep::DisposableCommit:
            return "disposable_commit";
        case FullGuidedArtifactStep::DisposableRemountExport:
            return "disposable_remount_export";
        case FullGuidedArtifactStep::DisposableCleanup:
            return "disposable_cleanup";
        case FullGuidedArtifactStep::ProductVerify: return "product_verify";
        case FullGuidedArtifactStep::Complete: return "complete";
        case FullGuidedArtifactStep::Failed: return "failed";
        case FullGuidedArtifactStep::Cancelled: return "cancelled";
    }
    return "unknown";
}
struct FullGuidedArtifactState final {
    FullGuidedArtifactStep step = FullGuidedArtifactStep::Idle;
    char expectedFingerprint[33] = {};
    bool recoveryComplete = false;
    bool recoveryPassed = false;
    bool libraryComplete = false;
    bool libraryPassed = false;
    bool captureComplete = false;
    bool captureApplicable = false;
    bool capturePassed = false;
    bool cleanupComplete = true;
    std::uint32_t generationBefore = 0;
    std::uint32_t generationAfter = 0;
    std::size_t observationsBefore = 0;
    std::size_t observationsAfter = 0;
    std::size_t jsonBytes = 0;
    std::size_t metadataBytes = 0;
    std::size_t csvBytes = 0;
    std::size_t csvRecords = 0;
    std::size_t csvIndex = 0;
    std::size_t pcapBytes = 0;
    std::size_t pcapFrames = 0;
    std::uint32_t pcapFnv1a = 2166136261U;
    std::uint32_t blockedWriteAttempts = 0;
    bool disposableCommitComplete = false;
    bool disposableCommitPassed = false;
    bool disposableRemountComplete = false;
    bool disposableRemountPassed = false;
    bool disposableExportComplete = false;
    bool disposableExportPassed = false;
    bool disposableCleanupComplete = false;
    bool disposableCleanupPassed = false;
    bool productVerifyComplete = false;
    bool productVerifyPassed = false;
    bool disposableResourceAcquired = false;
    bool disposableResourceReleased = true;
    bool disposableIdentityPassed = false;
    bool scratchPreexisting = false;
    bool scratchCreated = false;
    bool scratchRemoved = false;
    bool workflowPassed = true;
    char disposableObservedFingerprint[33] = {};
    char disposableScratchPath[leshy1::storage::kScratchPathMax] = {};
    std::uint32_t disposableGeneration = 0;
    std::size_t disposableObservations = 0;
    std::size_t disposableJsonBytes = 0;
    std::size_t disposableMetadataBytes = 0;
    std::size_t disposableCsvBytes = 0;
    std::size_t disposableCsvRecords = 0;
    std::uint64_t disposableStorageWriteBytes = 0;
    std::uint32_t disposableStorageWriteCalls = 0;
    std::uint32_t disposableFileSyncs = 0;
    std::uint32_t disposableDirectorySyncs = 0;
    std::uint16_t disposableFilesRemoved = 0;
    std::uint32_t productGenerationFinal = 0;
    std::size_t productObservationsFinal = 0;
};
