anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
struct FullGuidedPcapSink final {
    std::size_t bytes = 0;
    std::uint32_t fnv1a = 2166136261U;
};
bool writeFullGuidedPcapBytes(const std::uint8_t* data, std::size_t size,
                              void* context) {
    if ((data == nullptr && size != 0) || context == nullptr) return false;
    auto* sink = static_cast<FullGuidedPcapSink*>(context);
    for (std::size_t index = 0; index < size; ++index) {
        sink->fnv1a ^= data[index];
        sink->fnv1a *= 16777619U;
    }
    sink->bytes += size;
    return true;
}
FullGuidedArtifactState fullGuidedArtifactState;
std::uint64_t fullGuidedArtifactStartAfterUs = 0;
enum class RfSpectrumKind : std::uint8_t {
    Nrf24,
    Cc1101,
};
enum class RfSpectrumView : std::uint8_t {
    None,
    SourceMenu,
    Nrf24Menu,
    Nrf24Finder,
    SubGhzMenu,
    CcFinder,
    CcBandMenu,
    SubGhzCaptureModeMenu,
    SubGhzCaptureBandMenu,
    SubGhzCaptureLive,
    Live,
};
const char* rfSpectrumViewName(RfSpectrumView view) {
    switch (view) {
        case RfSpectrumView::None: return "none";
        case RfSpectrumView::SourceMenu: return "source_menu";
        case RfSpectrumView::Nrf24Menu: return "nrf24_menu";
        case RfSpectrumView::Nrf24Finder: return "nrf24_finder";
        case RfSpectrumView::SubGhzMenu: return "subghz_menu";
        case RfSpectrumView::CcFinder: return "cc1101_finder";
        case RfSpectrumView::CcBandMenu: return "cc_band_menu";
        case RfSpectrumView::SubGhzCaptureModeMenu:
            return "subghz_capture_mode_menu";
        case RfSpectrumView::SubGhzCaptureBandMenu:
            return "subghz_capture_band_menu";
        case RfSpectrumView::SubGhzCaptureLive:
            return "subghz_capture_live";
        case RfSpectrumView::Live: return "live";
    }
    return "unknown";
}
RfSpectrumView rfSpectrumView = RfSpectrumView::None;
RfSpectrumKind rfSpectrumKind = RfSpectrumKind::Nrf24;
std::uint8_t rfSpectrumSelection = 0;
std::uint8_t nrf24ModeSelection = 0;
std::uint8_t subGhzModeSelection = 0;
std::uint8_t subGhzCaptureModeSelection = 0;
leshy1::domain::captures::SubGhzRawModulation subGhzCaptureModulation =
    leshy1::domain::captures::SubGhzRawModulation::OokEnvelope;
enum class WifiProductView : std::uint8_t {
    None,
    Menu,
    Networks,
    NetworkDetail,
    AuthenticationCapture,
    Devices,
    DeviceDetail,
    Channels,
    Visit,
    AirspaceGuard,
};

const char* wifiProductViewName(WifiProductView view) {
    switch (view) {
        case WifiProductView::Menu: return "menu";
        case WifiProductView::Networks: return "networks";
        case WifiProductView::NetworkDetail: return "network_detail";
        case WifiProductView::AuthenticationCapture:
            return "authentication_capture";
        case WifiProductView::Devices: return "devices";
        case WifiProductView::DeviceDetail: return "device_detail";
        case WifiProductView::Channels: return "channels";
        case WifiProductView::Visit: return "visit";
        case WifiProductView::AirspaceGuard: return "airspace_guard";
        case WifiProductView::None:
        default: return "none";
    }
}
WifiProductView wifiProductView = WifiProductView::None;
std::uint8_t wifiProductSelection = 0;
enum class WifiAuthenticationProductState : std::uint8_t {
    Idle,
    WaitingForSurveyStop,
    Running,
    Result,
    Failed,
};

const char* wifiAuthenticationProductStateName(
    WifiAuthenticationProductState state) {
    switch (state) {
        case WifiAuthenticationProductState::Idle: return "idle";
        case WifiAuthenticationProductState::WaitingForSurveyStop:
            return "waiting_for_survey_stop";
        case WifiAuthenticationProductState::Running: return "running";
        case WifiAuthenticationProductState::Result: return "result";
        case WifiAuthenticationProductState::Failed: return "failed";
    }
    return "unknown";
}

struct WifiAuthenticationTarget final {
    std::array<std::uint8_t, 6> accessPoint{};
    std::array<std::uint8_t, 32> ssid{};
    std::uint8_t ssidLength = 0U;
    bool ssidKnown = false;
    std::uint8_t channel = 0;
};

WifiAuthenticationProductState wifiAuthenticationProductState =
    WifiAuthenticationProductState::Idle;
WifiAuthenticationTarget wifiAuthenticationTarget{};
WifiAuthenticationCaptureReport wifiAuthenticationReport{};
WifiAuthenticationCaptureController wifiAuthenticationController{};
WifiAuthenticationSyntheticHilFixture wifiAuthenticationSyntheticHilFixture{};
WifiAuthenticationPersistenceHilFixture
    wifiAuthenticationPersistenceHilFixture{};
// CAP049's raw fixture is a HIL-only 4.5 KiB object. Keep it off the
// product's resident heap so normal BLE startup has the same memory budget as
// the user firmware; the authenticated fixture command owns its lifetime.
WifiFrameCapture* wifiAuthenticationPersistenceHilCapture = nullptr;
WifiAuthenticationCaptureReport wifiAuthenticationSyntheticHilReport{};
WifiAuthenticationCaptureController wifiAuthenticationSyntheticHilController{};
bool wifiAuthenticationSynthetic = false;
bool wifiAuthenticationPersistenceHil = false;
BoardWifiPassiveCapture wifiFrameCapture;
bool wifiAuthenticationRepeatRequested = false;
std::uint32_t wifiAuthenticationRepeatRequestGeneration = 0;
bool wifiAuthenticationReturnAfterSurveyStop = false;
bool wifiAuthenticationBackDuringWaitObserved = false;
bool wifiAuthenticationSafetyCleanupActive = false;
WifiAuthenticationCaptureUiFailure wifiAuthenticationFailure =
    WifiAuthenticationCaptureUiFailure::None;
WifiAuthenticationCaptureUiModel wifiAuthenticationRenderedModel{};
bool wifiAuthenticationRenderedModelValid = false;
std::uint64_t nextWifiAuthenticationUiRefreshUs = 0;
std::uint32_t wifiAuthenticationGeneration = 0;
std::uint32_t wifiAuthenticationContentRepaints = 0;
std::uint32_t wifiAuthenticationFullRepaints = 0;
std::uint32_t wifiAuthenticationChromeRepaints = 0;
constexpr std::uint32_t kWifiAuthenticationSurveyTerminalHoldTimeoutMs =
    1500U;
bool wifiAuthenticationSurveyTerminalHoldArmed = false;
std::uint64_t wifiAuthenticationSurveyTerminalHoldDeadlineUs = 0;

WifiAuthenticationCaptureController&
activeWifiAuthenticationCaptureController() {
    return wifiAuthenticationSynthetic
        ? wifiAuthenticationSyntheticHilController
        : wifiAuthenticationController;
}

const WifiAuthenticationCaptureReport& activeWifiAuthenticationCaptureReport() {
    return wifiAuthenticationSynthetic
        ? wifiAuthenticationSyntheticHilReport
        : wifiAuthenticationReport;
}

WifiFrameCapture* ensureWifiAuthenticationPersistenceHilCapture() {
    if (wifiAuthenticationPersistenceHilCapture == nullptr) {
        wifiAuthenticationPersistenceHilCapture =
            new (std::nothrow) WifiFrameCapture();
    }
    return wifiAuthenticationPersistenceHilCapture;
}

