anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void releaseWifiAuthenticationPersistenceHilCapture() {
    delete wifiAuthenticationPersistenceHilCapture;
    wifiAuthenticationPersistenceHilCapture = nullptr;
}

const WifiFrameCapture& activeWifiAuthenticationFrameCapture() {
    return wifiAuthenticationPersistenceHil &&
            wifiAuthenticationPersistenceHilCapture != nullptr
        ? *wifiAuthenticationPersistenceHilCapture
        : wifiFrameCapture.capture();
}

leshy1::apps::capture::WifiFrameCaptureStats
activeWifiAuthenticationFrameCaptureStats() {
    return activeWifiAuthenticationFrameCapture().stats();
}

leshy1::platform::arduino::BoardWifiPassiveCapture::AuthenticationCaptureStats
activeWifiAuthenticationIngressStats() {
    if (!wifiAuthenticationPersistenceHil) {
        return wifiFrameCapture.authenticationCaptureStats();
    }
    leshy1::platform::arduino::BoardWifiPassiveCapture::
        AuthenticationCaptureStats stats{};
    if (wifiAuthenticationPersistenceHilCapture == nullptr) {
        return stats;
    }
    const auto capture = wifiAuthenticationPersistenceHilCapture->stats();
    stats.framesObserved = capture.framesReported;
    stats.candidates = capture.framesReported;
    stats.candidatesAccepted = capture.framesAccepted;
    stats.candidatesDropped = capture.framesDroppedCapacity;
    stats.framesInvalid = capture.framesDroppedInvalid;
    stats.active = false;
    stats.cleanupComplete =
        capture.state == WifiFrameCaptureState::Complete;
    return stats;
}

bool activeWifiAuthenticationCaptureCleanupComplete() {
    if (wifiAuthenticationPersistenceHil) {
        return wifiAuthenticationPersistenceHilCapture != nullptr &&
            wifiAuthenticationPersistenceHilCapture->stats().state ==
                WifiFrameCaptureState::Complete;
    }
    const auto ingress = activeWifiAuthenticationIngressStats();
    return wifiFrameCapture.cleanupComplete() && ingress.cleanupComplete &&
        !ingress.active;
}

void clearWifiAuthenticationSyntheticHilState() {
    wifiAuthenticationSyntheticHilController.reset();
    wifiAuthenticationSyntheticHilReport = {};
    wifiAuthenticationSynthetic = false;
    wifiAuthenticationPersistenceHil = false;
    releaseWifiAuthenticationPersistenceHilCapture();
    wifiAuthenticationRenderedModel = {};
    wifiAuthenticationRenderedModelValid = false;
}

bool formatWifiAuthenticationProductionReportFingerprint(
    char* output, std::size_t capacity) {
    if (output == nullptr || capacity < 17U || !hilSession.active()) {
        return false;
    }
    std::uint64_t hash = 14695981039346656037ULL;
    const char* sessionId = hilSession.id();
    for (std::size_t index = 0U; sessionId[index] != '\0'; ++index) {
        hash ^= static_cast<std::uint8_t>(sessionId[index]);
        hash *= 1099511628211ULL;
    }
    const auto* bytes = reinterpret_cast<const std::uint8_t*>(
        &wifiAuthenticationReport);
    for (std::size_t index = 0U; index < sizeof(wifiAuthenticationReport);
        ++index) {
        hash ^= bytes[index];
        hash *= 1099511628211ULL;
    }
    const int formatted = std::snprintf(
        output, capacity, "%016llx",
        static_cast<unsigned long long>(hash));
    return formatted == 16;
}

void clearWifiAuthenticationSurveyTerminalHold() {
    wifiAuthenticationSurveyTerminalHoldArmed = false;
    wifiAuthenticationSurveyTerminalHoldDeadlineUs = 0;
}

void armWifiAuthenticationSurveyTerminalHoldDeadline() {
    if (!wifiAuthenticationSurveyTerminalHoldArmed) return;
    std::uint64_t nowUs = static_cast<std::uint64_t>(esp_timer_get_time());
    if (nowUs == 0U) nowUs = 1U;
    wifiAuthenticationSurveyTerminalHoldDeadlineUs = nowUs +
        static_cast<std::uint64_t>(
            kWifiAuthenticationSurveyTerminalHoldTimeoutMs) * 1000ULL;
}

void expireWifiAuthenticationSurveyTerminalHold() {
    if (!wifiAuthenticationSurveyTerminalHoldArmed ||
        wifiAuthenticationSurveyTerminalHoldDeadlineUs == 0U) {
        return;
    }
    const std::uint64_t nowUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (nowUs >= wifiAuthenticationSurveyTerminalHoldDeadlineUs) {
        clearWifiAuthenticationSurveyTerminalHold();
    }
}
AirspaceGuardController airspaceGuardController;
leshy1::services::guard::AirspaceGuard airspaceGuardDetector;
enum class AirspaceGuardCaptureState : std::uint8_t {
    Idle,
    WifiRunning,
    BleRunning,
    Result,
    Failed,
};
AirspaceGuardCaptureState airspaceGuardCaptureState =
    AirspaceGuardCaptureState::Idle;
bool airspaceGuardCaptureRunning() {
    return airspaceGuardCaptureState ==
               AirspaceGuardCaptureState::WifiRunning ||
        airspaceGuardCaptureState ==
               AirspaceGuardCaptureState::BleRunning;
}
const char* airspaceGuardCaptureStateName(
    AirspaceGuardCaptureState state) {
    switch (state) {
        case AirspaceGuardCaptureState::Idle: return "idle";
        case AirspaceGuardCaptureState::WifiRunning: return "wifi_running";
        case AirspaceGuardCaptureState::BleRunning: return "ble_running";
        case AirspaceGuardCaptureState::Result: return "result";
        case AirspaceGuardCaptureState::Failed: return "failed";
    }
    return "unknown";
}
constexpr std::uint32_t kAirspaceGuardCaptureDurationMs = 10000U;
constexpr std::uint16_t kAirspaceGuardChannelDwellMs = 120U;
std::uint64_t nextAirspaceGuardUiRefreshUs = 0;
std::uint64_t airspaceGuardBleStartedUs = 0;
std::uint32_t airspaceGuardGeneration = 0;
AirspaceGuardReport airspaceGuardWifiReport{};
void resetAirspaceGuardWifiReport() {
    // Only findingCount entries are semantically live. Clearing the aggregate
    // and restoring its non-zero default status avoids constructing a ~4.6-KiB
    // temporary AirspaceGuardReport on Arduino's bounded loop stack.
    std::memset(&airspaceGuardWifiReport, 0,
                sizeof(airspaceGuardWifiReport));
    airspaceGuardWifiReport.status = AirspaceGuardStatus::Inconclusive;
}
bool airspaceGuardResultNeedsContentClear = false;
WifiNetworkCatalog wifiNetworkCatalog;
WifiNetworkNavigationOrder wifiNetworkNavigationOrder;
std::size_t wifiNetworkSelection = 0;
Observation wifiNetworkDetail;
Observation wifiNetworkRenderedDetail;
WifiNetworkSignalStats wifiNetworkDetailSignal;

std::size_t wifiNetworkVisibleSize() {
    return wifiNetworkNavigationOrder.size(wifiNetworkCatalog);
}

