anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
const Observation* wifiNetworkAt(std::size_t index) {
    return wifiNetworkNavigationOrder.at(wifiNetworkCatalog, index);
}

const Observation* liveWifiNetworkDetail() {
    const std::size_t index =
        wifiNetworkCatalog.indexOfIdentity(wifiNetworkDetail);
    const Observation* live = wifiNetworkCatalog.at(index);
    return live == nullptr ? &wifiNetworkDetail : live;
}

const WifiNetworkSignalStats* liveWifiNetworkSignal() {
    const std::size_t index =
        wifiNetworkCatalog.indexOfIdentity(wifiNetworkDetail);
    const WifiNetworkSignalStats* live = wifiNetworkCatalog.signalAt(index);
    return live == nullptr ? &wifiNetworkDetailSignal : live;
}
WifiDeviceCatalog wifiDeviceCatalog;
WifiDeviceNavigationOrder wifiDeviceNavigationOrder;
WifiOuiDatabase wifiOuiDatabase(
    wifiOuiAssetStart,
    static_cast<std::size_t>(wifiOuiAssetEnd - wifiOuiAssetStart));
std::size_t wifiDeviceSelection = 0;
WifiDeviceRecord wifiDeviceDetail;
std::uint64_t nextWifiDeviceUiRefreshUs = 0;

std::size_t wifiDeviceVisibleSize() {
    return wifiDeviceNavigationOrder.size(wifiDeviceCatalog);
}

const WifiDeviceRecord* wifiDeviceAt(std::size_t index) {
    return wifiDeviceNavigationOrder.at(wifiDeviceCatalog, index);
}
enum class BleProductView : std::uint8_t {
    None,
    Devices,
    DeviceDetail,
    InspectorMenu,
    InspectorRaw,
    InspectorGatt,
};
const char* bleProductViewName(BleProductView view) {
    switch (view) {
        case BleProductView::Devices: return "devices";
        case BleProductView::DeviceDetail: return "device_detail";
        case BleProductView::InspectorMenu: return "inspector_menu";
        case BleProductView::InspectorRaw: return "inspector_raw";
        case BleProductView::InspectorGatt: return "inspector_gatt";
        case BleProductView::None:
        default: return "none";
    }
}
BleProductView bleProductView = BleProductView::None;
BleDeviceCatalog bleDeviceCatalog;
BleDeviceNavigationOrder bleDeviceNavigationOrder;
BleCompanyDatabase bleCompanyDatabase(
    bleCompanyAssetStart,
    static_cast<std::size_t>(bleCompanyAssetEnd - bleCompanyAssetStart));
std::size_t bleDeviceSelection = 0;
Observation bleDeviceDetail;
Observation bleDeviceRenderedDetail;
BleDeviceSignalStats bleDeviceDetailSignal;
std::uint8_t bleInspectorModeSelection = 0U;
std::size_t bleGattFactSelection = 0U;
std::uint64_t bleGattConfirmationToken = 0U;
bool bleGattWaitingForSurveyStop = false;
bool bleGattReturnAfterCleanup = false;
std::uint32_t bleGattContentClears = 0U;
std::uint32_t bleGattRowRepaints = 0U;
BleGattInspectorState bleGattRenderedState = BleGattInspectorState::Idle;
std::size_t bleGattRenderedServices = SIZE_MAX;
std::size_t bleGattRenderedCharacteristics = SIZE_MAX;
std::size_t bleGattRenderedSelection = SIZE_MAX;

struct BleInspectorCaptureSummary final {
    BleInspectorCaptureState state = BleInspectorCaptureState::Idle;
    BleInspectorCaptureCounters counters{};
    BleInspectorTarget target{};
    BleInspectorRawAdvertisement latest{};
    std::size_t records = 0U;
    std::uint32_t revision = 0U;
    bool latestPresent = false;
};

portMUX_TYPE bleInspectorCaptureMux = portMUX_INITIALIZER_UNLOCKED;
BleInspectorCapture* bleInspectorCapture = nullptr;
std::uint32_t bleInspectorUiRevision = 0U;
std::uint32_t bleInspectorRenderedRevision = UINT32_MAX;
std::uint32_t bleInspectorContentClears = 0U;
std::uint32_t bleInspectorAtomicRowPushes = 0U;
std::uint64_t nextBleInspectorUiRefreshUs = 0U;

BleInspectorCaptureSummary bleInspectorCaptureSnapshot() {
    BleInspectorCaptureSummary summary{};
    portENTER_CRITICAL(&bleInspectorCaptureMux);
    summary.revision = bleInspectorUiRevision;
    if (bleInspectorCapture != nullptr) {
        summary.state = bleInspectorCapture->state();
        summary.counters = bleInspectorCapture->counters();
        summary.target = bleInspectorCapture->target();
        summary.records = bleInspectorCapture->size();
    }
    if (bleInspectorCapture != nullptr && summary.records != 0U) {
        const BleInspectorRawAdvertisement* latest =
            bleInspectorCapture->at(summary.records - 1U);
        if (latest != nullptr) {
            summary.latest = *latest;
            summary.latestPresent = true;
        }
    }
    portEXIT_CRITICAL(&bleInspectorCaptureMux);
    return summary;
}

BleInspectorTarget bleInspectorTargetFromObservation(
        const Observation& observation) {
    BleInspectorTarget target{};
    target.address = observation.identity;
    target.addressType = observation.bleAdvertisement.addressType;
    target.observedMonotonicUs = observation.monotonicUs;
    return target;
}

bool beginBleInspectorCapture(const Observation& observation) {
    const BleInspectorTarget target =
        bleInspectorTargetFromObservation(observation);
    bool begun = false;
    portENTER_CRITICAL(&bleInspectorCaptureMux);
    if (bleInspectorCapture != nullptr) {
        begun = bleInspectorCapture->begin(target);
    }
    if (begun) ++bleInspectorUiRevision;
    portEXIT_CRITICAL(&bleInspectorCaptureMux);
    if (begun) nextBleInspectorUiRefreshUs = 0U;
    return begun;
}

bool freezeBleInspectorCapture() {
    bool frozen = false;
    portENTER_CRITICAL(&bleInspectorCaptureMux);
    if (bleInspectorCapture != nullptr) {
        frozen = bleInspectorCapture->freeze();
    }
    if (frozen) ++bleInspectorUiRevision;
    portEXIT_CRITICAL(&bleInspectorCaptureMux);
    if (frozen) nextBleInspectorUiRefreshUs = 0U;
    return frozen;
}

void resetBleInspectorCapture() {
    portENTER_CRITICAL(&bleInspectorCaptureMux);
    if (bleInspectorCapture != nullptr) bleInspectorCapture->reset();
    ++bleInspectorUiRevision;
    portEXIT_CRITICAL(&bleInspectorCaptureMux);
    bleInspectorRenderedRevision = UINT32_MAX;
    bleInspectorContentClears = 0U;
    bleInspectorAtomicRowPushes = 0U;
    nextBleInspectorUiRefreshUs = 0U;
}

struct BleDeviceRowVisual final {
    bool present = false;
    bool selected = false;
    bool tracker = false;
    std::int16_t rssiDbm = 0;
    std::array<char, 22> label{};
    std::array<char, 64> note{};

    bool operator==(const BleDeviceRowVisual& other) const {
        return present == other.present && selected == other.selected &&
            tracker == other.tracker && rssiDbm == other.rssiDbm &&
            label == other.label && note == other.note;
    }
};

enum class BleDeviceListRenderState : std::uint8_t {
    Unknown,
    Rows,
    Searching,
    Unavailable,
};

