anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
struct BleDeviceRadarVisual final {
    bool valid = false;
    std::int16_t rssiDbm = 0;
    std::int16_t minimumRssiDbm = 0;
    std::int16_t maximumRssiDbm = 0;
    std::int16_t rssiTrendDb = 0;

    bool operator==(const BleDeviceRadarVisual& other) const {
        return valid == other.valid && rssiDbm == other.rssiDbm &&
            minimumRssiDbm == other.minimumRssiDbm &&
            maximumRssiDbm == other.maximumRssiDbm &&
            rssiTrendDb == other.rssiTrendDb;
    }
};

constexpr std::size_t kVisibleBleDeviceRows = 4U;
std::array<BleDeviceRowVisual, kVisibleBleDeviceRows>
    bleDeviceRenderedRows{};
std::array<bool, kVisibleBleDeviceRows> bleDeviceRenderedRowValid{};
BleDeviceListRenderState bleDeviceListRenderState =
    BleDeviceListRenderState::Unknown;
BleDeviceRadarVisual bleDeviceRenderedRadar{};
constexpr std::uint64_t kBleDeviceUiRefreshPeriodUs = 250000ULL;
std::uint64_t nextBleDeviceUiRefreshUs = 0U;
bool bleDeviceUiRefreshPending = false;
std::uint32_t bleDeviceListRowRepaints = 0U;
std::uint32_t bleDeviceListContentClears = 0U;
std::uint32_t bleDeviceDetailContentClears = 0U;
std::uint32_t bleDeviceRadarFullRepaints = 0U;
std::uint32_t bleDeviceRadarDeltaRepaints = 0U;
std::uint32_t bleDeviceDetailRefreshes = 0U;
std::uint32_t bleDeviceDetailRefreshesDeferred = 0U;
std::uint32_t bleDeviceAtomicTextRowPushes = 0U;
std::uint32_t bleDeviceAtomicTextRowAllocationFailures = 0U;
std::uint32_t bleDeviceDirectTextRowFallbacks = 0U;

std::size_t bleDeviceVisibleSize() {
    return bleDeviceNavigationOrder.size(bleDeviceCatalog);
}

const Observation* bleDeviceAt(std::size_t index) {
    return bleDeviceNavigationOrder.at(bleDeviceCatalog, index);
}

const Observation* liveBleDeviceDetail() {
    const std::size_t index =
        bleDeviceCatalog.indexOfIdentity(bleDeviceDetail);
    const Observation* live = bleDeviceCatalog.at(index);
    return live == nullptr ? &bleDeviceDetail : live;
}

const BleDeviceSignalStats* liveBleDeviceSignal() {
    const std::size_t index =
        bleDeviceCatalog.indexOfIdentity(bleDeviceDetail);
    const BleDeviceSignalStats* live = bleDeviceCatalog.signalAt(index);
    return live == nullptr ? &bleDeviceDetailSignal : live;
}
std::array<std::uint16_t, 13> wifiChannelRenderedLoads{};
std::array<std::uint16_t, 13> wifiChannelRenderedAverages{};
std::uint8_t wifiChannelRenderedBest = 0xffU;
std::uint32_t wifiCaptureRenderedFrames = UINT32_MAX;
std::uint32_t wifiCaptureRenderedDrops = UINT32_MAX;
std::uint8_t wifiCaptureRenderedChannel = 0xffU;
leshy1::drivers::radio::Cc1101SpectrumBand rfCcBandSelection =
    leshy1::drivers::radio::Cc1101SpectrumBand::Band433;
std::uint64_t nextSpectrumUiRefreshUs = 0;
std::array<std::int16_t, Layout::ScreenWidth> nrf24FinderRenderedHeights{};
std::uint32_t nrf24FinderRenderedRevision = UINT32_MAX;
Nrf24SignalFinderState nrf24FinderRenderedState =
    Nrf24SignalFinderState::Idle;
std::uint8_t nrf24FinderRenderedChannel = 0xffU;
bool nrf24FinderRenderedFound = false;
std::array<std::int16_t, Layout::ScreenWidth> ccFinderRenderedHeights{};
std::uint32_t ccFinderRenderedRevision = UINT32_MAX;
Cc1101SignalFinderState ccFinderRenderedState =
    Cc1101SignalFinderState::Idle;
std::uint32_t ccFinderRenderedFrequencyKHz = UINT32_MAX;
bool ccFinderRenderedFound = false;
SubGhzRawCapture subGhzRawCapture;
std::uint64_t nextSubGhzCaptureUiRefreshUs = 0;
std::uint8_t subGhzFskLowCarrierSamples = 0;
std::uint32_t subGhzFskTransportArms = 0;
std::uint32_t subGhzFskEdgesDrained = 0;
std::uint32_t subGhzFskTransportOverflows = 0;
std::uint64_t spectrumWaterfallStartedUs = 0;
std::uint64_t spectrumWaterfallCompletedUs = 0;
std::uint32_t spectrumWaterfallRowsEmitted = 0;
std::uint64_t spectrumWaterfallPreviousRowUs = 0;
std::uint64_t spectrumWaterfallRowIntervalTotalUs = 0;
std::uint64_t spectrumWaterfallRowIntervalMaxUs = 0;
std::uint64_t spectrumWaterfallPushTotalUs = 0;
std::uint64_t spectrumWaterfallPushMaxUs = 0;
std::uint64_t spectrumWaterfallRenderTotalUs = 0;
std::uint64_t spectrumWaterfallRenderMaxUs = 0;
std::uint64_t spectrumWaterfallServiceMaxUs = 0;
std::uint64_t nrf24SpectrumChunkMaxUs = 0;
std::uint64_t spectrumLoopPreviousUs = 0;
std::uint64_t spectrumLoopIntervalTotalUs = 0;
std::uint64_t spectrumLoopIntervalMaxUs = 0;
std::uint64_t spectrumLoopCount = 0;
std::uint64_t spectrumTouchPollTotalUs = 0;
std::uint64_t spectrumTouchPollMaxUs = 0;
std::uint64_t spectrumTouchPollCount = 0;
std::uint32_t spectrumWaterfallSourceSweepBaseline = 0;
std::uint32_t spectrumWaterfallLastSourceSweep = 0;
std::uint32_t spectrumWaterfallMeasurementsConsumed = 0;
std::uint32_t spectrumWaterfallMeasurementsSkipped = 0;
std::uint64_t spectrumWaterfallFillElapsedUs() {
    return spectrumWaterfallCompletedUs >= spectrumWaterfallStartedUs
        ? spectrumWaterfallCompletedUs - spectrumWaterfallStartedUs : 0;
}

void resetSpectrumWaterfallTiming() {
    spectrumWaterfallStartedUs = 0;
    spectrumWaterfallCompletedUs = 0;
    spectrumWaterfallRowsEmitted = 0;
    spectrumWaterfallPreviousRowUs = 0;
    spectrumWaterfallRowIntervalTotalUs = 0;
    spectrumWaterfallRowIntervalMaxUs = 0;
    spectrumWaterfallPushTotalUs = 0;
    spectrumWaterfallPushMaxUs = 0;
    spectrumWaterfallRenderTotalUs = 0;
    spectrumWaterfallRenderMaxUs = 0;
    spectrumWaterfallServiceMaxUs = 0;
    spectrumLoopPreviousUs = 0;
    spectrumLoopIntervalTotalUs = 0;
    spectrumLoopIntervalMaxUs = 0;
    spectrumLoopCount = 0;
    spectrumTouchPollTotalUs = 0;
    spectrumTouchPollMaxUs = 0;
    spectrumTouchPollCount = 0;
    spectrumWaterfallSourceSweepBaseline = 0;
    spectrumWaterfallLastSourceSweep = 0;
    spectrumWaterfallMeasurementsConsumed = 0;
    spectrumWaterfallMeasurementsSkipped = 0;
}

void armSpectrumWaterfallForCurrentReceiver();
constexpr WifiFrameCapturePlan kProductWifiFrameCapturePlan{};
constexpr std::uint32_t kWifiAuthenticationCaptureDurationMs = 10000U;
constexpr std::uint16_t kWifiAuthenticationCaptureMaximumFrames = 16U;
constexpr std::uint16_t kWifiAuthenticationCaptureSnapLength = 256U;
static_assert(
    kWifiAuthenticationCaptureMaximumFrames <=
        leshy1::apps::capture::WifiFrameCapture::kFrameCapacity,
    "authentication capture must fit the one bounded packet buffer");

bool beginWifiAuthenticationCaptureAfterSurvey();
bool bleSelectedDeviceConnectable();
bool beginBleGattAfterSurvey();
void serviceBleGattProduct();
void serviceWifiAuthenticationCapture();
SurveyPipelineStatus stopProductSurvey();
std::uint64_t nextCaptureUiRefreshUs = 0;
enum class CaptureView : std::uint8_t {
    SourceMenu,
    Wifi,
    Infrared,
};
CaptureView captureView = CaptureView::SourceMenu;
std::uint8_t captureSourceSelection = 0;
InfraredCapture infraredCapture;
constexpr InfraredCapturePlan kProductInfraredCapturePlan{};
BoardInfraredReceiver boardInfraredReceiver;
InfraredReceiverReport infraredReceiverReport;
enum class CapturePersistState : std::uint8_t {
    Result,
    Confirm,
    Saving,
    Saved,
    Failed,
};
