anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
ProductSurveyRuntimeState productSurveyRuntime;

enum class ProductSurveyWorkerControl : std::uint8_t {
    Idle,
    Starting,
    Running,
    Paused,
    PauseRequested,
    StopRequested,
    CommitRequested,
    Committing,
    CancelRequested,
};

enum class ProductSurveyWorkerEventKind : std::uint8_t {
    Prepared,
    ScanStarted,
    Scan,
    SourceUnavailable,
    Paused,
    Stopped,
    Committed,
    CommitFailed,
    Cancelled,
    Failed,
};

enum class AirspaceGuardBleWorkerControl : std::uint8_t {
    Idle,
    Requested,
    Running,
    CancelRequested,
};

struct AirspaceGuardBleWorkerEvent final {
    std::uint32_t generation = 0;
    const char* status = "idle";
    bool valid = false;
    bool cleanupComplete = true;
    bool capacityDropRequested = false;
    bool capacityDropInjected = false;
    BoardBlePassiveScanResult scan{};
    AirspaceGuardBleRetentionStats retention{};
    AirspaceGuardReport report{};
};

// Queue receive storage must not live on Arduino's bounded 8-KiB loop stack.
// AirspaceGuardReport is intentionally evidence-rich; dev.223 proved that a
// local event plus local merge/report temporaries inflated the service frame to
// 7,280 bytes and corrupted the following critical-section call. BLE Inspector
// is a different foreground application, so its exact-packet capture shares the
// larger 4.6-KiB event storage instead of permanently removing another 1.8 KiB
// from the internal heap NimBLE needs during initialization.
static_assert(std::is_trivially_destructible_v<AirspaceGuardBleWorkerEvent>);
static_assert(std::is_trivially_destructible_v<BleInspectorCapture>);
static_assert(std::is_trivially_destructible_v<BleGattInspector>);
static_assert(sizeof(BleInspectorCapture) <=
              sizeof(AirspaceGuardBleWorkerEvent));
static_assert(sizeof(BleGattInspector) <=
              sizeof(AirspaceGuardBleWorkerEvent));
union BleProductSharedWorkspace final {
    AirspaceGuardBleWorkerEvent airspaceGuard;
    BleInspectorCapture inspector;
    BleGattInspector gatt;

    BleProductSharedWorkspace() : airspaceGuard{} {}
    ~BleProductSharedWorkspace() {}
};
BleProductSharedWorkspace bleProductSharedWorkspace;
AirspaceGuardBleWorkerEvent& airspaceGuardBleEventWorkspace =
    bleProductSharedWorkspace.airspaceGuard;
BoardBleGattInspectorTransport bleGattTransport;
BleGattInspector* bleGattInspector = nullptr;

bool activateBleInspectorWorkspace() {
    portENTER_CRITICAL(&bleInspectorCaptureMux);
    if (bleInspectorCapture == nullptr && bleGattInspector == nullptr) {
        bleProductSharedWorkspace.airspaceGuard.
            ~AirspaceGuardBleWorkerEvent();
        bleInspectorCapture = new (&bleProductSharedWorkspace.inspector)
            BleInspectorCapture();
        ++bleInspectorUiRevision;
    }
    portEXIT_CRITICAL(&bleInspectorCaptureMux);
    return bleInspectorCapture != nullptr;
}

bool bleInspectorWorkspaceActive() {
    portENTER_CRITICAL(&bleInspectorCaptureMux);
    const bool active = bleInspectorCapture != nullptr ||
        bleGattInspector != nullptr;
    portEXIT_CRITICAL(&bleInspectorCaptureMux);
    return active;
}

void releaseBleInspectorWorkspace() {
    portENTER_CRITICAL(&bleInspectorCaptureMux);
    if (bleInspectorCapture != nullptr) {
        bleInspectorCapture->reset();
        bleInspectorCapture->~BleInspectorCapture();
        bleInspectorCapture = nullptr;
        new (&bleProductSharedWorkspace.airspaceGuard)
            AirspaceGuardBleWorkerEvent();
        ++bleInspectorUiRevision;
    }
    portEXIT_CRITICAL(&bleInspectorCaptureMux);
    bleInspectorRenderedRevision = UINT32_MAX;
    bleInspectorContentClears = 0U;
    bleInspectorAtomicRowPushes = 0U;
    nextBleInspectorUiRefreshUs = 0U;
}

bool activateBleGattWorkspace(const Observation& observation) {
    const BleInspectorTarget target =
        bleInspectorTargetFromObservation(observation);
    releaseBleInspectorWorkspace();
    portENTER_CRITICAL(&bleInspectorCaptureMux);
    if (bleInspectorCapture == nullptr && bleGattInspector == nullptr) {
        bleProductSharedWorkspace.airspaceGuard.
            ~AirspaceGuardBleWorkerEvent();
        bleGattInspector = new (&bleProductSharedWorkspace.gatt)
            BleGattInspector(resourceBroker, bleGattTransport);
    }
    portEXIT_CRITICAL(&bleInspectorCaptureMux);
    if (bleGattInspector == nullptr ||
        !bleGattTransport.bind(bleGattInspector)) {
        return false;
    }
    std::uint64_t nowUs = static_cast<std::uint64_t>(esp_timer_get_time());
    if (nowUs == 0U) nowUs = 1U;
    if (!bleGattTransport.selectTarget(target, nowUs)) {
        (void)bleGattTransport.unbind();
        portENTER_CRITICAL(&bleInspectorCaptureMux);
        bleGattInspector->~BleGattInspector();
        bleGattInspector = nullptr;
        new (&bleProductSharedWorkspace.airspaceGuard)
            AirspaceGuardBleWorkerEvent();
        portEXIT_CRITICAL(&bleInspectorCaptureMux);
        return false;
    }
    bleGattFactSelection = 0U;
    bleGattConfirmationToken = 0U;
    bleGattWaitingForSurveyStop = false;
    bleGattReturnAfterCleanup = false;
    bleGattContentClears = 0U;
    bleGattRowRepaints = 0U;
    bleGattRenderedState = BleGattInspectorState::Idle;
    bleGattRenderedServices = SIZE_MAX;
    bleGattRenderedCharacteristics = SIZE_MAX;
    bleGattRenderedSelection = SIZE_MAX;
    return true;
}

bool releaseBleGattWorkspace() {
    if (bleGattInspector == nullptr) return true;
    if (!bleGattTransport.cleanupComplete() || !bleGattTransport.unbind()) {
        return false;
    }
    portENTER_CRITICAL(&bleInspectorCaptureMux);
    bleGattInspector->~BleGattInspector();
    bleGattInspector = nullptr;
    new (&bleProductSharedWorkspace.airspaceGuard)
        AirspaceGuardBleWorkerEvent();
    portEXIT_CRITICAL(&bleInspectorCaptureMux);
    bleGattConfirmationToken = 0U;
    bleGattWaitingForSurveyStop = false;
    return true;
}

void resetAirspaceGuardBleEventWorkspace() {
    // The worker and loop task exchange ownership through the completion-token
    // queue. Keep the evidence-rich payload in one static workspace so neither
    // task stack nor the queue storage duplicates its ~4.6-KiB report.
    std::memset(&airspaceGuardBleEventWorkspace, 0,
                sizeof(airspaceGuardBleEventWorkspace));
    airspaceGuardBleEventWorkspace.status = "idle";
    airspaceGuardBleEventWorkspace.cleanupComplete = true;
    airspaceGuardBleEventWorkspace.report.status =
        AirspaceGuardStatus::Inconclusive;
}

struct ProductSurveyWorkerReport final {
    const char* status = "idle";
    bool backendOpen = false;
    bool identityCleanupComplete = true;
    bool filesystemAttempted = false;
    bool scannerCleanupComplete = true;
    bool cleanupComplete = true;
    bool sourceActive = false;
    bool sourceStartAttempted = false;
    bool sourceFailureInjected = false;
    bool runtimeSourceFailureInjected = false;
    std::uint8_t runtimeSourceFailureInjectedMask = 0;
    bool storeOpenAttempted = false;
    std::uint64_t storeBytesWritten = 0;
    std::uint8_t identityAttempts = 0;
    std::uint8_t identityTransientRetries = 0;
    std::uint8_t filesystemMountAttempts = 0;
    std::uint8_t filesystemMountTransientRetries = 0;
    int filesystemMountError = 0;
    int filesystemMountLastFailureError = 0;
    const char* filesystemMountStage = "idle";
    int filesystemBusInitializeError = 0;
    std::uint32_t filesystemHeapFreeBeforeBus = 0;
    std::uint32_t filesystemHeapLargestBeforeBus = 0;
    std::uint32_t filesystemHeapFreeBeforeVfs = 0;
    std::uint32_t filesystemHeapLargestBeforeVfs = 0;
    bool filesystemDriveAvailableBeforeVfs = false;
    leshy1::storage::SdTransportRunStatus identityStatus =
        leshy1::storage::SdTransportRunStatus::InvalidPlan;
    char expectedFingerprint[33] = {};
    char observedFingerprint[33] = {};
    std::uint64_t cardCapacityBytes = 0;
    std::uint64_t cachedFreeBytes = 0;
    leshy1::storage::ProductStoreAccessStatus storeStatus =
        leshy1::storage::ProductStoreAccessStatus::MissingMedia;
    leshy1::apps::survey::ProductSurveyAdmissionStatus admissionStatus =
        leshy1::apps::survey::ProductSurveyAdmissionStatus::ExplicitStartRequired;
    std::uint8_t selectedSourceMask = 0;
    std::uint8_t activeSourceMask = 0;
    std::uint8_t unavailableSourceMask = 0;
};

struct ProductSurveyWorkerEvent final {
    ProductSurveyWorkerEventKind kind = ProductSurveyWorkerEventKind::Failed;
    ProductSurveyWorkerReport report{};
    RadioKind source = RadioKind::Wifi;
    BoardWifiPassiveScanResult scan{};
    BoardBlePassiveScanResult bleScan{};
    std::uint32_t scanCycles = 0;
    std::uint32_t sourceScanCycles = 0;
    std::uint64_t eventUs = 0;
    std::uint64_t scanStartedUs = 0;
    std::uint64_t scanEndedUs = 0;
    std::uint16_t scanDropped = 0;
    SourceWindowState failureState = SourceWindowState::Fault;
    SourceWindowReason failureReason = SourceWindowReason::DriverFault;
    SurveyPipelineStatus commitStatus = SurveyPipelineStatus::Ready;
};

struct ProductSurveyPreparationSnapshot final {
    const char* stage = "idle";
    std::uint64_t stageStartedUs = 0;
};

constexpr UBaseType_t kProductSurveyWorkerEventCapacity = 8;
constexpr UBaseType_t kProductSurveyObservationCapacity =
    leshy1::services::survey::SurveySession::kObservationCapacity;
// NimBLE's first process-lifetime initialization consumes roughly 71.8 KiB
// of the no-PSRAM DIV's internal heap.  Product Survey historically kept a
// 64-record ingress queue alive at the same time even though physical BLE HIL
// measured a maximum queue high-water of 18 records.  Keep the full queue for
// Wi-Fi and mixed field visits, but compact the BLE-only foreground to 32
// records before NimBLE starts.  The consumer runs concurrently and explicit
// drop counters still fail closed if a denser environment exceeds this burst
// allowance.
constexpr UBaseType_t kBleProductSurveyObservationCapacity = 32;
// These are admission floors, not clean-boot expectations. Exact no-PSRAM
// HIL has already completed physical BLE initialization at 73,360 B free and
// a 28,660 B largest block (dev.261).  Keep a small fail-closed margin below
// that accepted boundary so a completed Survey/SD lifecycle can start another
// session without treating normal allocator placement as a radio failure.
constexpr std::uint32_t kBleProductMinimumFreeHeapBeforeBegin = 73000U;
constexpr std::uint32_t kBleProductMinimumLargestHeapBeforeBegin = 28000U;
static_assert(kBleProductSurveyObservationCapacity >= 32U);
constexpr std::uint32_t kProductSurveyScanIntervalMs = 1000;
constexpr std::uint16_t kFieldSurveyStationChannelDwellMs = 120U;
constexpr std::uint8_t kFieldSurveyStationChannelCount = 13U;
constexpr std::uint8_t kFieldSurveyStationSweepCount = 3U;
constexpr std::uint64_t kProductSurveyPreparationDeadlineUs = 8000000ULL;
constexpr std::uint64_t kProductSurveyWorkerDeadlineUs = 8000000ULL;
constexpr std::uint64_t kAirspaceGuardBleWorkerDeadlineUs = 25000000ULL;
constexpr std::uint64_t kWifiCaptureStoreDeadlineUs = 8000000ULL;
constexpr std::uint64_t kPulseCaptureStoreDeadlineUs = 8000000ULL;
constexpr std::uint64_t kTargetsStoreDeadlineUs = 8000000ULL;
// Target graph persistence nests the merge service, atomic codec and VFS
// adapter on one worker. The 8-KiB generic store stack reproduced loss of the
// worker context on the no-PSRAM DIV before an event could be returned. Keep a
// dedicated bounded stack instead of weakening the loop-task or hardware
// watchdogs.
constexpr std::uint32_t kTargetsStoreTaskStackBytes = 12288U;
constexpr std::uint32_t kProductSurveyPreparationDeadlineInjectionMs = 10000;
constexpr std::uint32_t kProductSurveyWorkerDeadlineInjectionMs = 10000;
constexpr std::uint32_t kWifiCaptureStoreDeadlineInjectionMs = 10000;
constexpr std::uint32_t kPulseCaptureStoreDeadlineInjectionMs = 10000;
static_assert(
    kProductSurveyWorkerDeadlineUs >
        BoardBlePassiveScanner::worstCaseScanDurationUs(
            leshy1::drivers::ble::defaultPassivePlan()),
    "worker deadline must exceed the bounded BLE retry path");
constexpr leshy1::drivers::ble::BleScanPlan airspaceGuardBleScanPlan() {
    auto plan = leshy1::drivers::ble::defaultPassivePlan();
    plan.deduplicateAddresses = false;
    plan.durationMs = kAirspaceGuardCaptureDurationMs;
    plan.maximumRecords =
        leshy1::drivers::ble::kMaximumStreamingRecords;
    return plan;
}
static_assert(
    kAirspaceGuardBleWorkerDeadlineUs >
        BoardBlePassiveScanner::worstCaseScanDurationUs(
            airspaceGuardBleScanPlan()),
    "Airspace Guard deadline must exceed the bounded BLE retry path");
QueueHandle_t productSurveyWorkerEvents = nullptr;
QueueHandle_t productSurveyObservations = nullptr;
QueueHandle_t airspaceGuardBleWorkerEvents = nullptr;
StaticSemaphore_t productSurveyScanStartGateStorage{};
SemaphoreHandle_t productSurveyScanStartGate = nullptr;
TaskHandle_t productSurveyWorkerTaskHandle = nullptr;
portMUX_TYPE productSurveyWorkerMux = portMUX_INITIALIZER_UNLOCKED;
ProductSurveyPreparationSnapshot productSurveyPreparation{};
BoardBleBeginDiagnostic productSurveyBleBeginDiagnostic{};

