anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void publishProductSurveyBleBeginDiagnostic(
    const BoardBleBeginDiagnostic& diagnostic) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    productSurveyBleBeginDiagnostic = diagnostic;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}

BoardBleBeginDiagnostic productSurveyBleBeginDiagnosticSnapshot() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const BoardBleBeginDiagnostic diagnostic =
        productSurveyBleBeginDiagnostic;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return diagnostic;
}

std::uint32_t productSurveyFilesystemMountAttemptsTotal = 0;
std::uint32_t productSurveyFilesystemMountSuccessesTotal = 0;
struct ProductSurveyMountTotals final {
    std::uint32_t attempts = 0;
    std::uint32_t successes = 0;
};
void recordProductSurveyMountOutcome(bool success) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    ++productSurveyFilesystemMountAttemptsTotal;
    if (success) ++productSurveyFilesystemMountSuccessesTotal;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}
ProductSurveyMountTotals productSurveyMountTotalsSnapshot() {
    ProductSurveyMountTotals totals;
    portENTER_CRITICAL(&productSurveyWorkerMux);
    totals.attempts = productSurveyFilesystemMountAttemptsTotal;
    totals.successes = productSurveyFilesystemMountSuccessesTotal;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return totals;
}
ProductSurveyWorkerControl productSurveyWorkerControl =
    ProductSurveyWorkerControl::Idle;
bool productSurveyWorkerFieldVisit = false;
AirspaceGuardBleWorkerControl airspaceGuardBleWorkerControl =
    AirspaceGuardBleWorkerControl::Idle;
std::uint32_t airspaceGuardBleRequestedGeneration = 0;
bool airspaceGuardBleCapacityDropInjectionOnce = false;
AirspaceGuardBleRetention airspaceGuardBleRetention;
std::uint32_t productSurveyWorkerOwnedResources = 0;
bool productSurveyWorkerReady = false;
UBaseType_t productSurveyObservationQueueCapacity =
    kProductSurveyObservationCapacity;
bool bleProductSurveyMemoryCompact = false;
bool airspaceGuardSurveyQueuesReleased = false;
bool airspaceGuardSurveyQueueRestorePending = false;
std::uint32_t airspaceGuardHeapFreeBeforeQueueRelease = 0;
std::uint32_t airspaceGuardHeapLargestBeforeQueueRelease = 0;
std::uint32_t airspaceGuardHeapFreeAfterQueueRelease = 0;
std::uint32_t airspaceGuardHeapLargestAfterQueueRelease = 0;
std::uint32_t airspaceGuardHeapFreeAfterQueueRestore = 0;
bool productSurveyWorkerScanActive = false;
bool productSurveySourceUnavailableOnce = false;
std::uint8_t productSurveyRuntimeUnavailableOnceMask = 0;
bool productSurveyIncrementalRefreshPending = false;
WorkerDeadlineSupervisor workerDeadlineSupervisor;
bool productSurveyPreparationDeadlineInjectionOnce = false;
bool productSurveyWorkerDeadlineInjectionOnce = false;
bool wifiCaptureStoreDeadlineInjectionOnce = false;
bool wifiCaptureStoreDeadlineCancelRequested = false;
bool subGhzCaptureStoreDeadlineInjectionOnce = false;
bool subGhzCaptureStoreDeadlineCancelRequested = false;
bool infraredCaptureStoreDeadlineInjectionOnce = false;
bool infraredCaptureStoreDeadlineCancelRequested = false;
bool targetsStoreDeadlineCancelRequested = false;

void renderInteractiveScreen(bool clearContent = true);
void broadcast(const char* line);
bool boundedSleepReady();
bool performBoundedLightSleep(std::uint64_t requestedUs);
void feedRuntimeSafetyWatchdog();

bool lastUiActionUsedIncrementalRender = false;
bool lastUiRenderWasIncremental = false;
std::uint64_t lastUiRenderUs = 0;

struct SdPhysicalEvidenceWorkspace final {
    // UI state is intentionally a single reusable static workspace.  The
    // network/device passports and mount diagnostics pushed the bounded schema
    // past 7 KiB; retaining 7.5 KiB here avoids both truncation and the
    // historical loop-task stack panic without allocating per command.
    char line[7680] = {};
    char summaryA[512] = {};
    char summaryB[512] = {};
    char summaryC[512] = {};
    char cidHex[33] = {};
    std::array<std::uint8_t, 512> sectorA{};
    std::array<std::uint8_t, 512> sectorB{};
    std::array<std::uint8_t, 512> sectorC{};
    std::array<std::uint64_t, kSdThroughputSamples> commitUs{};
};

SdPhysicalEvidenceWorkspace sdPhysicalEvidence;
// Diagnostic replies and explicit physical-storage commands run serially on the
// main loop. Reuse their largest scratch line instead of reserving a second 5 KiB
// buffer that would permanently reduce the no-PSRAM product heap.
auto& diagnosticJson = sdPhysicalEvidence.line;

constexpr leshy1::kernel::runtime::ResourceMask kAutomationStorageResources =
    leshy1::kernel::runtime::resourceMask(Resource::Storage) |
    leshy1::kernel::runtime::resourceMask(Resource::RadioSpi);

void clearAutomationPackageScratch() {
    volatile char* cursor = diagnosticJson;
    for (std::size_t index = 0U;
         index < leshy1::apps::automation::kAutomationMaximumPackageBytes;
         ++index) {
        cursor[index] = '\0';
    }
}

bool automationStorageReady() {
    return !productSurveyFilesystem.mounted() &&
        !productSurveyStore.ready() &&
        resourceBroker.acquire(AppRuntime::kForegroundOwner,
                               kAutomationStorageResources);
}

void releaseAutomationStorage() {
    resourceBroker.release(AppRuntime::kForegroundOwner,
                           kAutomationStorageResources);
}

BoardAutomationPackageStatus scanAutomationPackageCatalog() {
    automationPackageCatalog.clear();
    automationCatalogOmittedEntries = 0U;
    if (!automationStorageReady()) {
        return BoardAutomationPackageStatus::ScanFailed;
    }
    BoardSdFilesystem filesystem;
    BoardAutomationPackageStatus status =
        BoardAutomationPackageStatus::DirectoryUnavailable;
    if (filesystem.beginReadOnly() && filesystem.readOnlyGuaranteed()) {
        BoardAutomationPackageReader reader(sdSessionStoreIoWorkspace);
        status = reader.scan(filesystem.driveNumber(),
                             &automationPackageCatalog,
                             &automationCatalogOmittedEntries);
    }
    filesystem.end();
    if (!filesystem.cleanupComplete()) {
        status = BoardAutomationPackageStatus::ScanFailed;
    }
    releaseAutomationStorage();
    return status;
}

void inspectSelectedAutomationPackage() {
    const AutomationPackageCatalogEntry* selected =
        automationPackageCatalog.selected();
    if (selected == nullptr) {
        automationInspectorController.clear();
        return;
    }
    if (selected->size >
        leshy1::apps::automation::kAutomationMaximumPackageBytes) {
        automationInspectorController.rejectSource(
            selected->name.data(), selected->size,
            AutomationInspectorSourceStatus::TooLarge);
        return;
    }
    clearAutomationPackageScratch();
    BoardAutomationPackageStatus status =
        BoardAutomationPackageStatus::ReadFailed;
    std::size_t bytesRead = 0U;
    if (automationStorageReady()) {
        BoardSdFilesystem filesystem;
        if (filesystem.beginReadOnly() && filesystem.readOnlyGuaranteed()) {
            BoardAutomationPackageReader reader(sdSessionStoreIoWorkspace);
            status = reader.read(
                filesystem.driveNumber(), *selected,
                reinterpret_cast<std::uint8_t*>(diagnosticJson),
                leshy1::apps::automation::kAutomationMaximumPackageBytes,
                &bytesRead);
        }
        filesystem.end();
        if (!filesystem.cleanupComplete()) {
            status = BoardAutomationPackageStatus::ReadFailed;
            bytesRead = 0U;
        }
        releaseAutomationStorage();
    }
    if (status == BoardAutomationPackageStatus::Ready) {
        automationInspectorController.inspect(
            selected->name.data(), selected->size,
            reinterpret_cast<const std::uint8_t*>(diagnosticJson), bytesRead,
            kAutomationActionApiVersion, nullptr);
    } else {
        automationInspectorController.rejectSource(
            selected->name.data(), selected->size,
            status == BoardAutomationPackageStatus::TooLarge
                ? AutomationInspectorSourceStatus::TooLarge
                : AutomationInspectorSourceStatus::ReadFailed);
    }
    clearAutomationPackageScratch();
}

