anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void serviceAutomationPackageUi() {
    if (!appRuntime.running() ||
        std::strcmp(appRuntime.activeApp(), "lab") != 0) {
        automationCatalogRefreshPending = false;
        automationInspectionPending = false;
        return;
    }
    if (automationCatalogRefreshPending && uiController.page() == 8U) {
        automationCatalogRefreshPending = false;
        automationCatalogStatus = scanAutomationPackageCatalog();
        lastRuntimeEvent =
            leshy1::platform::arduino::boardAutomationPackageStatusName(
                automationCatalogStatus);
        renderInteractiveScreen(true);
        return;
    }
    if (automationInspectionPending &&
        uiController.page() == kAutomationInspectorPage) {
        automationInspectionPending = false;
        inspectSelectedAutomationPackage();
        lastRuntimeEvent =
            leshy1::apps::automation::automationInspectorSourceStatusName(
                automationInspectorController.model().sourceStatus);
        renderInteractiveScreen(true);
    }
}

struct StoredGenerationEvidence final {
    std::uint32_t expectedSegmentCrc = 0;
    std::uint32_t observedSegmentCrc = 0;
    std::uint32_t expectedManifestCrc = 0;
    std::uint32_t observedManifestCrc = 0;
    std::size_t expectedSegmentSize = 0;
    std::size_t observedSegmentSize = 0;
    std::size_t expectedManifestSize = 0;
    std::size_t observedManifestSize = 0;
    bool unchanged = false;
};

struct ResetBoundaryHookContext final {
    Stream* reply = nullptr;
    const char* runId = nullptr;
    unsigned boundaryNumber = 0;
};

leshy1::storage::CommitStage resetBoundaryStage(unsigned number);
const char* resetExpectedRecovery(unsigned boundary);
bool resetRecoveredGenerationAllowed(unsigned boundary,
                                     std::uint32_t generation);
bool prepareLittleFsResetFixture();
bool inspectStoredGeneration(
    leshy1::storage::SessionStoreIo& io,
    leshy1::storage::SessionStoreWorkspace& workspace,
    const SurveySession& expected, std::uint32_t generation,
    StoredGenerationEvidence* evidence);
bool armLittleFsResetContinuity(const char* fingerprint, const char* runId,
                                unsigned boundary);
bool littleFsResetContinuityValid(const char* fingerprint, const char* runId,
                                  unsigned boundary);
void restartAtLittleFsSessionStoreBoundary(
    void* rawContext, leshy1::storage::CommitStage boundary);

constexpr std::int32_t kScreenWidth = Layout::ScreenWidth;
constexpr std::int32_t kScreenHeight = Layout::ScreenHeight;
constexpr std::int32_t kCaptureRows = 4;

bool appendGoldenObservations(SurveySession& session) {
    static constexpr std::uint8_t kBssids[3][6] = {
        {0x02, 0x00, 0x00, 0x00, 0x00, 0x01},
        {0x02, 0x00, 0x00, 0x00, 0x00, 0x02},
        {0x02, 0x00, 0x00, 0x00, 0x00, 0x03},
    };
    static constexpr std::uint8_t kChannels[3] = {1, 6, 11};
    static constexpr std::int16_t kRssi[3] = {-71, -55, -83};
    static constexpr const char* kSsids[3] = {"alpha", "bravo", "charlie"};
    for (std::size_t index = 0; index < 3; ++index) {
        WifiScanRecord record;
        std::memcpy(record.bssid.data(), kBssids[index], record.bssid.size());
        record.channel = kChannels[index];
        record.rssiDbm = kRssi[index];
        record.ssid = kSsids[index];
        record.ssidLength = std::strlen(kSsids[index]);
        Observation observation;
        if (!leshy1::drivers::wifi::normalizePassiveRecord(
                record, 2000 + static_cast<std::uint64_t>(index), &observation) ||
            session.append(observation) != SessionStatus::Appended) {
            return false;
        }
    }
    return true;
}

bool publishGoldenObservations(SurveyPipeline& pipeline) {
    static constexpr std::uint8_t kBssids[3][6] = {
        {0x02, 0x00, 0x00, 0x00, 0x00, 0x01},
        {0x02, 0x00, 0x00, 0x00, 0x00, 0x02},
        {0x02, 0x00, 0x00, 0x00, 0x00, 0x03},
    };
    static constexpr std::uint8_t kChannels[3] = {1, 6, 11};
    static constexpr std::int16_t kRssi[3] = {-71, -55, -83};
    static constexpr const char* kSsids[3] = {"alpha", "bravo", "charlie"};
    for (std::size_t index = 0; index < 3; ++index) {
        WifiScanRecord record;
        std::memcpy(record.bssid.data(), kBssids[index], record.bssid.size());
        record.channel = kChannels[index];
        record.rssiDbm = kRssi[index];
        record.ssid = kSsids[index];
        record.ssidLength = std::strlen(kSsids[index]);
        Observation observation;
        if (!leshy1::drivers::wifi::normalizePassiveRecord(
                record, surveySession.startedUs() + 1000U +
                            static_cast<std::uint64_t>(index),
                &observation) ||
            pipeline.enqueue(observation) != SurveyPipelineStatus::Queued) {
            return false;
        }
    }
    return pipeline.drain(
               leshy1::services::survey::ObservationQueue::kCapacity) ==
           SurveyPipelineStatus::Drained;
}

bool prepareSurveyDemo() {
    return surveyPipeline.resetToSetup() == SurveyPipelineStatus::Ready;
}

bool prepareLibraryDemo() {
    librarySession.reset();
    if (librarySession.start("golden-wifi-lib", 1000) != SessionStatus::Started ||
        !appendGoldenObservations(librarySession) ||
        librarySession.stop(3000) != SessionStatus::Stopped) {
        return false;
    }
    ramSessionStore.reset();
    const leshy1::storage::SessionStoreCommitResult committed =
        leshy1::storage::commitNextSession(ramSessionStore, sessionStoreWorkspace(),
                                           librarySession);
    if (!committed.complete()) return false;
    libraryController.clear();
    const leshy1::apps::library::SessionCatalogResult cataloged =
        sessionCatalog.recoverLatest(ramSessionStore, sessionStoreWorkspace(),
                                     librarySession, libraryController, false,
                                     true);
    return cataloged.admitted() && cataloged.generation == 1 &&
           cataloged.observations == 3;
}

bool exactCidFingerprint(const char* value) {
    if (value == nullptr || std::strlen(value) != 32) return false;
    for (std::size_t index = 0; index < 32; ++index) {
        const char current = value[index];
        if (!((current >= '0' && current <= '9') ||
              (current >= 'A' && current <= 'F'))) {
            return false;
        }
    }
    return true;
}

void formatCidFingerprint(const leshy1::storage::SdIdentity& identity,
                          char* output, std::size_t capacity) {
    if (output == nullptr || capacity < 33) return;
    output[0] = '\0';
    for (std::size_t index = 0; index < identity.cid.size(); ++index) {
        std::snprintf(output + index * 2, capacity - index * 2, "%02X",
                      static_cast<unsigned>(identity.cid[index]));
    }
}

bool loadProductFingerprint(char* output, std::size_t capacity) {
    if (output == nullptr || capacity < 33) return false;
    output[0] = '\0';
    Preferences preferences;
    if (!preferences.begin(kProductEnrollmentNamespace, true)) return false;
    const std::size_t stored = preferences.getBytesLength(kProductEnrollmentKey);
    const std::size_t read = stored == 33
        ? preferences.getBytes(kProductEnrollmentKey, output, 33) : 0;
    preferences.end();
    if (read != 33 || output[32] != '\0' || !exactCidFingerprint(output)) {
        output[0] = '\0';
        return false;
    }
    return true;
}

bool saveProductFingerprint(const char* fingerprint) {
    if (!exactCidFingerprint(fingerprint)) return false;
    Preferences preferences;
    if (!preferences.begin(kProductEnrollmentNamespace, false)) return false;
    const std::size_t written = preferences.putBytes(
        kProductEnrollmentKey, fingerprint, 33);
    preferences.end();
    char verified[33] = {};
    return written == 33 && loadProductFingerprint(verified, sizeof(verified)) &&
           std::strcmp(verified, fingerprint) == 0;
}

