anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
bool clearProductFingerprint() {
    char existing[33] = {};
    if (!loadProductFingerprint(existing, sizeof(existing))) return true;
    Preferences preferences;
    if (!preferences.begin(kProductEnrollmentNamespace, false)) return false;
    const bool removed = preferences.remove(kProductEnrollmentKey);
    preferences.end();
    char verified[33] = {};
    return removed && !loadProductFingerprint(verified, sizeof(verified));
}

UiLanguage loadUiLanguage() {
    Preferences preferences;
    if (!preferences.begin(kUiPreferencesNamespace, true)) {
        return UiLanguage::English;
    }
    const std::uint8_t stored = preferences.getUChar(kUiLanguageKey, 0);
    preferences.end();
    return stored == static_cast<std::uint8_t>(UiLanguage::Russian)
               ? UiLanguage::Russian
               : UiLanguage::English;
}

bool saveUiLanguage(UiLanguage language) {
    Preferences preferences;
    if (!preferences.begin(kUiPreferencesNamespace, false)) return false;
    const std::size_t written = preferences.putUChar(
        kUiLanguageKey, static_cast<std::uint8_t>(language));
    preferences.end();
    return written == sizeof(std::uint8_t);
}

std::uint8_t loadUiBrightnessIndex() {
    Preferences preferences;
    if (!preferences.begin(kUiPreferencesNamespace, true)) return 0;
    const std::uint8_t stored = preferences.getUChar(kUiBrightnessKey, 0);
    preferences.end();
    return stored < InterfaceSettingsController::kBrightnessCount ? stored : 0;
}

InterfaceTheme loadUiTheme() {
    Preferences preferences;
    if (!preferences.begin(kUiPreferencesNamespace, true)) {
        return InterfaceTheme::Forest;
    }
    const std::uint8_t stored = preferences.getUChar(kUiThemeKey, 0);
    preferences.end();
    return stored == static_cast<std::uint8_t>(InterfaceTheme::HighContrast)
               ? InterfaceTheme::HighContrast
               : InterfaceTheme::Forest;
}

std::uint8_t loadStatusLedBrightnessIndex() {
    constexpr std::uint8_t kMissing = 0xffU;
    Preferences preferences;
    if (preferences.begin(kUiPreferencesNamespace, true)) {
        const std::uint8_t stored = preferences.getUChar(
            kStatusLedBrightnessKey, kMissing);
        preferences.end();
        if (stored < AntennaStatusController::kBrightnessCount) return stored;
    }

    // 0.x stored the raw WS2812 brightness byte in namespace "leshy". Keep
    // that user choice when upgrading instead of silently treating it as an
    // index in the new namespaced settings store.
    Preferences legacy;
    if (legacy.begin(kLegacyUiPreferencesNamespace, true)) {
        const std::uint8_t raw = legacy.getUChar(
            kLegacyStatusLedBrightnessKey, kMissing);
        legacy.end();
        if (raw != kMissing) {
            return AntennaStatusController::brightnessIndexForRaw(raw);
        }
    }
    return AntennaStatusController::kDefaultBrightnessIndex;
}

bool saveUiPreference(const char* key, std::uint8_t value) {
    Preferences preferences;
    if (!preferences.begin(kUiPreferencesNamespace, false)) return false;
    const std::size_t written = preferences.putUChar(key, value);
    preferences.end();
    return written == sizeof(std::uint8_t);
}

bool saveUiBrightnessIndex(std::uint8_t index) {
    if (index >= InterfaceSettingsController::kBrightnessCount) return false;
    return saveUiPreference(kUiBrightnessKey, index);
}

bool saveUiTheme(InterfaceTheme theme) {
    return saveUiPreference(kUiThemeKey, static_cast<std::uint8_t>(theme));
}

bool saveStatusLedBrightnessIndex(std::uint8_t index) {
    if (index >= AntennaStatusController::kBrightnessCount) return false;
    return saveUiPreference(kStatusLedBrightnessKey, index);
}

bool closeProductSurveyBackend() {
    productSurveyRuntime.storeBytesWritten = productSurveyStore.bytesWritten();
    productSurveyStore.end();
    const bool filesystemWasMounted = productSurveyFilesystem.mounted();
    if (filesystemWasMounted) productSurveyFilesystem.end();
    surveyStoreRouter.bind(ramSessionStore);
    productSurveyRuntime.backendOpen = false;
    const bool filesystemCleanup =
        !productSurveyRuntime.filesystemAttempted ||
        productSurveyFilesystem.cleanupComplete();
    productSurveyRuntime.cleanupComplete =
        productSurveyRuntime.identityCleanupComplete &&
        productSurveyRuntime.scannerCleanupComplete && filesystemCleanup &&
        !productSurveyFilesystem.mounted() &&
        surveyStoreRouter.boundTo(ramSessionStore);
    return productSurveyRuntime.cleanupComplete;
}

ProductSurveyWorkerControl productSurveyControl() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const ProductSurveyWorkerControl control = productSurveyWorkerControl;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return control;
}

bool productSurveyFieldVisit() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool fieldVisit = productSurveyWorkerFieldVisit;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return fieldVisit;
}

void setProductSurveyControl(ProductSurveyWorkerControl control) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    productSurveyWorkerControl = control;
    if (control == ProductSurveyWorkerControl::Idle) {
        productSurveyWorkerFieldVisit = false;
    }
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}

bool transitionProductSurveyControl(ProductSurveyWorkerControl expected,
                                    ProductSurveyWorkerControl next) {
    bool changed = false;
    portENTER_CRITICAL(&productSurveyWorkerMux);
    if (productSurveyWorkerControl == expected) {
        productSurveyWorkerControl = next;
        changed = true;
    }
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return changed;
}

AirspaceGuardBleWorkerControl airspaceGuardBleControl() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const AirspaceGuardBleWorkerControl control =
        airspaceGuardBleWorkerControl;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return control;
}

bool transitionAirspaceGuardBleControl(
    AirspaceGuardBleWorkerControl expected,
    AirspaceGuardBleWorkerControl next) {
    bool changed = false;
    portENTER_CRITICAL(&productSurveyWorkerMux);
    if (airspaceGuardBleWorkerControl == expected) {
        airspaceGuardBleWorkerControl = next;
        changed = true;
    }
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return changed;
}

std::uint32_t airspaceGuardBleRequestGeneration() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const std::uint32_t generation = airspaceGuardBleRequestedGeneration;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return generation;
}

