anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
bool requestAirspaceGuardBleWorker(std::uint32_t generation) {
    if (generation == 0U || bleInspectorWorkspaceActive() ||
        !productSurveyWorkerReady ||
        productSurveyWorkerTaskHandle == nullptr ||
        airspaceGuardBleWorkerEvents == nullptr ||
        productSurveyControl() != ProductSurveyWorkerControl::Idle) {
        return false;
    }
    bool requested = false;
    portENTER_CRITICAL(&productSurveyWorkerMux);
    if (airspaceGuardBleWorkerControl ==
        AirspaceGuardBleWorkerControl::Idle) {
        airspaceGuardBleRequestedGeneration = generation;
        airspaceGuardBleWorkerControl =
            AirspaceGuardBleWorkerControl::Requested;
        requested = true;
    }
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    if (!requested) return false;
    xQueueReset(airspaceGuardBleWorkerEvents);
    xTaskNotifyGive(productSurveyWorkerTaskHandle);
    return true;
}

bool requestAirspaceGuardBleWorkerCancel() {
    bool requested = false;
    portENTER_CRITICAL(&productSurveyWorkerMux);
    if (airspaceGuardBleWorkerControl ==
            AirspaceGuardBleWorkerControl::Requested ||
        airspaceGuardBleWorkerControl ==
            AirspaceGuardBleWorkerControl::Running) {
        airspaceGuardBleWorkerControl =
            AirspaceGuardBleWorkerControl::CancelRequested;
        requested = true;
    }
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    if (!requested) return false;
    BoardBlePassiveScanner::cancelActiveScan();
    if (productSurveyWorkerTaskHandle != nullptr) {
        xTaskNotifyGive(productSurveyWorkerTaskHandle);
    }
    return true;
}

bool productSurveyStopRequested() {
    const ProductSurveyWorkerControl control = productSurveyControl();
    return control == ProductSurveyWorkerControl::PauseRequested ||
           control == ProductSurveyWorkerControl::StopRequested ||
           control == ProductSurveyWorkerControl::CancelRequested;
}

bool productSurveyCancelRequested() {
    return productSurveyControl() ==
           ProductSurveyWorkerControl::CancelRequested;
}

void setAirspaceGuardBleCapacityDropInjection(bool armed) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    airspaceGuardBleCapacityDropInjectionOnce = armed;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}

bool airspaceGuardBleCapacityDropInjectionArmed() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool armed = airspaceGuardBleCapacityDropInjectionOnce;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return armed;
}

bool consumeAirspaceGuardBleCapacityDropInjection() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool injected = airspaceGuardBleCapacityDropInjectionOnce;
    airspaceGuardBleCapacityDropInjectionOnce = false;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return injected;
}

bool productSurveyScanActive() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool active = productSurveyWorkerScanActive;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return active;
}

bool productSurveySourceUnavailableInjectionArmed() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool armed = productSurveySourceUnavailableOnce;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return armed;
}

void setProductSurveySourceUnavailableInjection(bool armed) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    productSurveySourceUnavailableOnce = armed;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}

bool consumeProductSurveySourceUnavailableInjection() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool injected = productSurveySourceUnavailableOnce;
    productSurveySourceUnavailableOnce = false;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return injected;
}

void setProductSurveyWorkerDeadlineInjection(bool armed) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    productSurveyWorkerDeadlineInjectionOnce = armed;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}

bool productSurveyWorkerDeadlineInjectionArmed() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool armed = productSurveyWorkerDeadlineInjectionOnce;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return armed;
}

bool consumeProductSurveyWorkerDeadlineInjection() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool injected = productSurveyWorkerDeadlineInjectionOnce;
    productSurveyWorkerDeadlineInjectionOnce = false;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return injected;
}

void setProductSurveyPreparationDeadlineInjection(bool armed) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    productSurveyPreparationDeadlineInjectionOnce = armed;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}

bool productSurveyPreparationDeadlineInjectionArmed() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool armed = productSurveyPreparationDeadlineInjectionOnce;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return armed;
}

bool consumeProductSurveyPreparationDeadlineInjection() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool injected = productSurveyPreparationDeadlineInjectionOnce;
    productSurveyPreparationDeadlineInjectionOnce = false;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return injected;
}

bool armProductSurveyPreparationDeadline(std::uint64_t nowUs) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool armed = workerDeadlineSupervisor.arm(
        SupervisedWorker::ProductSurveyPreparation, nowUs,
        kProductSurveyPreparationDeadlineUs);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return armed;
}

bool heartbeatProductSurveyPreparation(std::uint64_t nowUs = 0) {
    if (nowUs == 0) {
        nowUs = static_cast<std::uint64_t>(esp_timer_get_time());
        if (nowUs == 0) nowUs = 1;
    }
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool accepted = workerDeadlineSupervisor.heartbeat(
        SupervisedWorker::ProductSurveyPreparation, nowUs);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return accepted;
}

bool disarmProductSurveyPreparationDeadline() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool disarmed = workerDeadlineSupervisor.disarm(
        SupervisedWorker::ProductSurveyPreparation);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return disarmed;
}

bool armProductSurveyWorkerDeadline(std::uint64_t nowUs) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool armed = workerDeadlineSupervisor.arm(
        SupervisedWorker::ProductSurvey, nowUs,
        kProductSurveyWorkerDeadlineUs);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return armed;
}

bool heartbeatProductSurveyWorker(std::uint64_t nowUs = 0) {
    if (nowUs == 0) {
        nowUs = static_cast<std::uint64_t>(esp_timer_get_time());
        if (nowUs == 0) nowUs = 1;
    }
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool accepted = workerDeadlineSupervisor.heartbeat(
        SupervisedWorker::ProductSurvey, nowUs);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return accepted;
}

bool disarmProductSurveyWorkerDeadline() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool disarmed = workerDeadlineSupervisor.disarm(
        SupervisedWorker::ProductSurvey);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return disarmed;
}

bool armAirspaceGuardBleWorkerDeadline(std::uint64_t nowUs) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool armed = workerDeadlineSupervisor.arm(
        SupervisedWorker::AirspaceGuardBle, nowUs,
        kAirspaceGuardBleWorkerDeadlineUs);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return armed;
}

bool heartbeatAirspaceGuardBleWorker(std::uint64_t nowUs = 0) {
    if (nowUs == 0U) {
        nowUs = static_cast<std::uint64_t>(esp_timer_get_time());
        if (nowUs == 0U) nowUs = 1U;
    }
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool accepted = workerDeadlineSupervisor.heartbeat(
        SupervisedWorker::AirspaceGuardBle, nowUs);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return accepted;
}

bool disarmAirspaceGuardBleWorkerDeadline() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const bool disarmed = workerDeadlineSupervisor.disarm(
        SupervisedWorker::AirspaceGuardBle);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return disarmed;
}

void setWifiCaptureStoreDeadlineInjection(bool armed) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    wifiCaptureStoreDeadlineInjectionOnce = armed;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}

