anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
WorkerDeadlineSnapshot workerDeadlineSnapshot() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const WorkerDeadlineSnapshot snapshot = workerDeadlineSupervisor.snapshot();
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return snapshot;
}

void publishProductSurveyPreparationStage(const char* stage) {
    std::uint64_t nowUs = static_cast<std::uint64_t>(esp_timer_get_time());
    if (nowUs == 0) nowUs = 1;
    portENTER_CRITICAL(&productSurveyWorkerMux);
    productSurveyPreparation.stage = stage == nullptr ? "unknown" : stage;
    productSurveyPreparation.stageStartedUs = nowUs;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}

ProductSurveyPreparationSnapshot productSurveyPreparationSnapshot() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const ProductSurveyPreparationSnapshot snapshot =
        productSurveyPreparation;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return snapshot;
}

std::uint8_t productSurveyRuntimeUnavailableInjectionMask() {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    const std::uint8_t mask = productSurveyRuntimeUnavailableOnceMask;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return mask;
}

void setProductSurveyRuntimeUnavailableInjection(std::uint8_t mask) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    productSurveyRuntimeUnavailableOnceMask = static_cast<std::uint8_t>(
        mask & leshy1::services::survey::kSupportedSourceMask);
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}

bool consumeProductSurveyRuntimeUnavailableInjection(RadioKind source) {
    const std::uint8_t mask = leshy1::services::survey::sourceMask(source);
    bool injected = false;
    portENTER_CRITICAL(&productSurveyWorkerMux);
    if ((productSurveyRuntimeUnavailableOnceMask & mask) != 0) {
        productSurveyRuntimeUnavailableOnceMask = static_cast<std::uint8_t>(
            productSurveyRuntimeUnavailableOnceMask &
            static_cast<std::uint8_t>(~mask));
        injected = true;
    }
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    return injected;
}

bool productSurveySourceUnavailableVisible() {
    return productSurveyRuntime.selected &&
        productSurveyRuntime.cleanupComplete &&
        productSurveyRuntime.admissionStatus ==
            leshy1::apps::survey::ProductSurveyAdmissionStatus::SourceUnavailable &&
        std::strcmp(productSurveyRuntime.status, "source_unavailable") == 0;
}

void setProductSurveyScanActive(bool active) {
    portENTER_CRITICAL(&productSurveyWorkerMux);
    productSurveyWorkerScanActive = active;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
}

void applyProductSurveyWorkerReport(
    const ProductSurveyWorkerReport& report) {
    productSurveyRuntime.backendOpen = report.backendOpen;
    productSurveyRuntime.identityCleanupComplete =
        report.identityCleanupComplete;
    productSurveyRuntime.filesystemAttempted = report.filesystemAttempted;
    productSurveyRuntime.scannerCleanupComplete =
        report.scannerCleanupComplete;
    productSurveyRuntime.cleanupComplete = report.cleanupComplete;
    productSurveyRuntime.sourceActive = report.sourceActive;
    productSurveyRuntime.sourceStartAttempted = report.sourceStartAttempted;
    productSurveyRuntime.sourceFailureInjected = report.sourceFailureInjected;
    productSurveyRuntime.runtimeSourceFailureInjected =
        report.runtimeSourceFailureInjected;
    productSurveyRuntime.runtimeSourceFailureInjectedMask =
        report.runtimeSourceFailureInjectedMask;
    productSurveyRuntime.storeOpenAttempted = report.storeOpenAttempted;
    productSurveyRuntime.storeBytesWritten = report.storeBytesWritten;
    productSurveyRuntime.identityAttempts = report.identityAttempts;
    productSurveyRuntime.identityTransientRetries =
        report.identityTransientRetries;
    productSurveyRuntime.filesystemMountAttempts =
        report.filesystemMountAttempts;
    productSurveyRuntime.filesystemMountTransientRetries =
        report.filesystemMountTransientRetries;
    productSurveyRuntime.filesystemMountError =
        report.filesystemMountError;
    productSurveyRuntime.filesystemMountLastFailureError =
        report.filesystemMountLastFailureError;
    productSurveyRuntime.filesystemMountStage =
        report.filesystemMountStage;
    productSurveyRuntime.filesystemBusInitializeError =
        report.filesystemBusInitializeError;
    productSurveyRuntime.filesystemHeapFreeBeforeBus =
        report.filesystemHeapFreeBeforeBus;
    productSurveyRuntime.filesystemHeapLargestBeforeBus =
        report.filesystemHeapLargestBeforeBus;
    productSurveyRuntime.filesystemHeapFreeBeforeVfs =
        report.filesystemHeapFreeBeforeVfs;
    productSurveyRuntime.filesystemHeapLargestBeforeVfs =
        report.filesystemHeapLargestBeforeVfs;
    productSurveyRuntime.filesystemDriveAvailableBeforeVfs =
        report.filesystemDriveAvailableBeforeVfs;
    productSurveyRuntime.identityStatus = report.identityStatus;
    std::memcpy(productSurveyRuntime.expectedFingerprint,
                report.expectedFingerprint,
                sizeof(productSurveyRuntime.expectedFingerprint));
    std::memcpy(productSurveyRuntime.observedFingerprint,
                report.observedFingerprint,
                sizeof(productSurveyRuntime.observedFingerprint));
    productSurveyRuntime.cardCapacityBytes = report.cardCapacityBytes;
    productSurveyRuntime.cachedFreeBytes = report.cachedFreeBytes;
    productSurveyRuntime.storeStatus = report.storeStatus;
    productSurveyRuntime.admissionStatus = report.admissionStatus;
    productSurveyRuntime.activeSourceMask = report.activeSourceMask;
    productSurveyRuntime.unavailableSourceMask = report.unavailableSourceMask;
}

void accumulateProductSurveyScan(BoardWifiPassiveScanResult* total,
                                 const BoardWifiPassiveScanResult& scan) {
    if (total == nullptr) return;
    total->status = scan.status;
    total->driverError = scan.driverError;
    total->durationUs += scan.durationUs;
    total->recordsReported = static_cast<std::uint16_t>(
        total->recordsReported + scan.recordsReported);
    total->recordsRead = static_cast<std::uint16_t>(
        total->recordsRead + scan.recordsRead);
    total->accepted = static_cast<std::uint16_t>(
        total->accepted + scan.accepted);
    total->rejected = static_cast<std::uint16_t>(
        total->rejected + scan.rejected);
    total->dropped = static_cast<std::uint16_t>(
        total->dropped + scan.dropped);
}

void accumulateProductSurveyBleScan(BoardBlePassiveScanResult* total,
                                    const BoardBlePassiveScanResult& scan) {
    if (total == nullptr) return;
    total->status = scan.status;
    total->durationUs += scan.durationUs;
    total->attempts = static_cast<std::uint16_t>(
        total->attempts + scan.attempts);
    total->transientRetries = static_cast<std::uint16_t>(
        total->transientRetries + scan.transientRetries);
    total->recordsObserved = static_cast<std::uint16_t>(
        total->recordsObserved + scan.recordsObserved);
    total->recordsReported = static_cast<std::uint16_t>(
        total->recordsReported + scan.recordsReported);
    total->recordsRead = static_cast<std::uint16_t>(
        total->recordsRead + scan.recordsRead);
    total->accepted = static_cast<std::uint16_t>(
        total->accepted + scan.accepted);
    total->rejected = static_cast<std::uint16_t>(
        total->rejected + scan.rejected);
    total->dropped = static_cast<std::uint16_t>(
        total->dropped + scan.dropped);
    total->queueHighWater = std::max(
        total->queueHighWater, scan.queueHighWater);
}

SourceFailureClass productSurveyFailureClass(
    RadioKind source, const BoardWifiPassiveScanResult& wifiScan,
    const BoardBlePassiveScanResult& bleScan) {
    if (source == RadioKind::Wifi) {
        return wifiScan.status ==
                       leshy1::platform::arduino::BoardWifiScanStatus::NotStarted
                   ? SourceFailureClass::Unavailable
                   : SourceFailureClass::Fault;
    }
    switch (bleScan.status) {
        case leshy1::platform::arduino::BoardBleScanStatus::NotStarted:
        case leshy1::platform::arduino::BoardBleScanStatus::StackInitFailed:
        case leshy1::platform::arduino::BoardBleScanStatus::ScannerUnavailable:
            return SourceFailureClass::Unavailable;
        case leshy1::platform::arduino::BoardBleScanStatus::Valid:
        case leshy1::platform::arduino::BoardBleScanStatus::InvalidPlan:
        case leshy1::platform::arduino::BoardBleScanStatus::ScanTimedOut:
            return SourceFailureClass::Fault;
    }
    return SourceFailureClass::Fault;
}

WifiRecordDisposition enqueueProductSurveyWorkerRecord(
    const WifiScanRecord& record, std::uint64_t monotonicUs, void*) {
    Observation observation;
    if (!leshy1::drivers::wifi::normalizePassiveRecord(
            record, monotonicUs, &observation)) {
        return WifiRecordDisposition::Rejected;
    }
    if (productSurveyObservations == nullptr ||
        xQueueSend(productSurveyObservations, &observation, 0) != pdTRUE) {
        return WifiRecordDisposition::Dropped;
    }
    return WifiRecordDisposition::Accepted;
}

