anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
BleRecordDisposition enqueueProductSurveyWorkerBleRecord(
    const BleAdvertisementRecord& record, std::uint64_t monotonicUs, void*) {
    portENTER_CRITICAL(&bleInspectorCaptureMux);
    const BleInspectorCaptureDisposition inspectorDisposition =
        bleInspectorCapture == nullptr
            ? BleInspectorCaptureDisposition::NotRunning
            : bleInspectorCapture->ingest(record, monotonicUs);
    if (inspectorDisposition == BleInspectorCaptureDisposition::Accepted &&
        bleInspectorCapture->size() == BleInspectorCapture::kRecordCapacity) {
        (void)bleInspectorCapture->freeze();
    }
    if (inspectorDisposition == BleInspectorCaptureDisposition::Accepted ||
        inspectorDisposition == BleInspectorCaptureDisposition::InvalidRecord ||
        inspectorDisposition == BleInspectorCaptureDisposition::CapacityReached) {
        ++bleInspectorUiRevision;
    }
    portEXIT_CRITICAL(&bleInspectorCaptureMux);
    Observation observation;
    if (!leshy1::drivers::ble::normalizePassiveRecord(
            record, monotonicUs, &observation)) {
        return BleRecordDisposition::Rejected;
    }
    if (productSurveyObservations == nullptr ||
        xQueueSend(productSurveyObservations, &observation, 0) != pdTRUE) {
        return BleRecordDisposition::Dropped;
    }
    return BleRecordDisposition::Accepted;
}

struct FieldSurveyStationCaptureResult final {
    bool begun = false;
    bool cleanupComplete = false;
    bool complete = false;
    std::uint16_t uniqueStations = 0U;
    std::uint16_t accepted = 0U;
    std::uint16_t rejected = 0U;
    std::uint32_t dropped = 0U;
    std::uint64_t durationUs = 0U;
    std::uint32_t channelHops = 0U;
};

void retainFieldSurveyStationObservation(
    WifiDeviceObservation observation, std::uint32_t* catalogDrops) {
    const std::size_t existing =
        wifiDeviceCatalog.indexOfAddress(observation.address);
    if (existing >= wifiDeviceCatalog.size() &&
        wifiDeviceCatalog.size() >= WifiDeviceCatalog::kCapacity &&
        catalogDrops != nullptr) {
        ++*catalogDrops;
    }
    if (!observation.locallyAdministered &&
        observation.wpsManufacturerLength == 0U) {
        const WifiDeviceRecord* known = wifiDeviceCatalog.at(existing);
        const bool needsVendor = known == nullptr ||
            (known->wpsManufacturerLength == 0U &&
             known->ouiVendorLength == 0U);
        if (needsVendor) {
            char vendor[WifiDeviceObservation::kWpsTextCapacity] = {};
            if (wifiOuiDatabase.lookup(observation.address.data(), vendor,
                                       sizeof(vendor))) {
                std::snprintf(observation.ouiVendor.data(),
                              observation.ouiVendor.size(), "%s", vendor);
                observation.ouiVendorLength = static_cast<std::uint8_t>(
                    std::strlen(observation.ouiVendor.data()));
            }
        }
    }
    wifiDeviceCatalog.upsert(observation);
}

FieldSurveyStationCaptureResult captureFieldSurveyStations() {
    FieldSurveyStationCaptureResult result{};
    wifiDeviceCatalog.reset();
    wifiFrameCapture.reset();
    std::uint64_t startedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (startedUs == 0U) startedUs = 1U;
    result.begun = wifiFrameCapture.beginDeviceMonitor(
        startedUs, kFieldSurveyStationChannelDwellMs);
    if (!result.begun) {
        result.cleanupComplete = wifiFrameCapture.stop(startedUs) &&
            wifiFrameCapture.cleanupComplete();
        return result;
    }

    const std::uint64_t durationUs =
        static_cast<std::uint64_t>(kFieldSurveyStationChannelDwellMs) *
        static_cast<std::uint64_t>(kFieldSurveyStationChannelCount) *
        static_cast<std::uint64_t>(kFieldSurveyStationSweepCount) *
        1000ULL;
    const std::uint64_t deadlineUs = startedUs + durationUs;
    std::uint64_t nowUs = startedUs;
    std::uint32_t catalogDrops = 0U;
    while (nowUs < deadlineUs && !productSurveyStopRequested()) {
        wifiFrameCapture.service(nowUs);
        WifiDeviceObservation observation{};
        while (wifiFrameCapture.pollDevice(&observation)) {
            retainFieldSurveyStationObservation(observation, &catalogDrops);
            observation = {};
        }
        heartbeatProductSurveyWorker(nowUs);
        vTaskDelay(pdMS_TO_TICKS(5));
        nowUs = static_cast<std::uint64_t>(esp_timer_get_time());
        if (nowUs == 0U) nowUs = 1U;
    }
    WifiDeviceObservation observation{};
    while (wifiFrameCapture.pollDevice(&observation)) {
        retainFieldSurveyStationObservation(observation, &catalogDrops);
        observation = {};
    }
    const auto monitor = wifiFrameCapture.deviceMonitorStats();
    result.cleanupComplete = wifiFrameCapture.stop(nowUs) &&
        wifiFrameCapture.cleanupComplete();
    result.uniqueStations = static_cast<std::uint16_t>(
        wifiDeviceCatalog.size());
    result.durationUs = nowUs >= startedUs ? nowUs - startedUs : 0U;
    result.channelHops = monitor.channelHops;
    result.dropped = monitor.clientsDropped + catalogDrops;

    // WifiDeviceCatalog is signal-sorted for the interactive screen. Emit its
    // bounded snapshot in monotonic order so SurveySession's ordering contract
    // remains exact without another allocation or a second catalog.
    std::uint32_t emittedMask = 0U;
    for (std::size_t emitted = 0U;
         emitted < wifiDeviceCatalog.size(); ++emitted) {
        std::size_t oldest = wifiDeviceCatalog.size();
        for (std::size_t index = 0U;
             index < wifiDeviceCatalog.size(); ++index) {
            if ((emittedMask & (1UL << index)) != 0U) continue;
            const WifiDeviceRecord* candidate = wifiDeviceCatalog.at(index);
            const WifiDeviceRecord* selected =
                oldest < wifiDeviceCatalog.size()
                    ? wifiDeviceCatalog.at(oldest) : nullptr;
            if (candidate != nullptr &&
                (selected == nullptr ||
                 candidate->monotonicUs < selected->monotonicUs)) {
                oldest = index;
            }
        }
        if (oldest >= wifiDeviceCatalog.size()) break;
        emittedMask |= 1UL << oldest;
        const WifiDeviceRecord* station = wifiDeviceCatalog.at(oldest);
        Observation normalized{};
        if (station == nullptr ||
            !leshy1::apps::survey::normalizeFieldSurveyStation(
                *station, &normalized)) {
            ++result.rejected;
        } else if (productSurveyObservations == nullptr ||
                   xQueueSend(productSurveyObservations, &normalized, 0) !=
                       pdTRUE) {
            ++result.dropped;
        } else {
            ++result.accepted;
        }
    }
    result.complete = result.cleanupComplete &&
        leshy1::apps::survey::fieldSurveyStationSweepCovered(
            result.channelHops, kFieldSurveyStationChannelCount,
            kFieldSurveyStationSweepCount) &&
        result.rejected == 0U && result.dropped == 0U &&
        !productSurveyStopRequested();
    return result;
}

void sendProductSurveyWorkerEvent(
    ProductSurveyWorkerEventKind kind,
    const ProductSurveyWorkerReport& report,
    RadioKind source = RadioKind::Wifi,
    const BoardWifiPassiveScanResult& scan = {},
    const BoardBlePassiveScanResult& bleScan = {},
    std::uint32_t scanCycles = 0, std::uint32_t sourceScanCycles = 0,
    std::uint64_t eventUs = 0,
    std::uint64_t scanStartedUs = 0, std::uint64_t scanEndedUs = 0,
    std::uint16_t scanDropped = 0,
    SourceWindowState failureState = SourceWindowState::Fault,
    SourceWindowReason failureReason = SourceWindowReason::DriverFault) {
    if (productSurveyWorkerEvents == nullptr) return;
    if (eventUs == 0) {
        eventUs = static_cast<std::uint64_t>(esp_timer_get_time());
        if (eventUs == 0) eventUs = 1;
    }
    const ProductSurveyWorkerEvent event{
        kind, report, source, scan, bleScan, scanCycles, sourceScanCycles,
        eventUs, scanStartedUs, scanEndedUs, scanDropped,
        failureState, failureReason};
    xQueueSend(productSurveyWorkerEvents, &event, portMAX_DELAY);
}

