anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void sendProductSurveyCommitWorkerEvent(SurveyPipelineStatus status) {
    if (productSurveyWorkerEvents == nullptr) return;
    ProductSurveyWorkerEvent event;
    event.kind = status == SurveyPipelineStatus::Committed
        ? ProductSurveyWorkerEventKind::Committed
        : ProductSurveyWorkerEventKind::CommitFailed;
    event.commitStatus = status;
    event.eventUs = static_cast<std::uint64_t>(esp_timer_get_time());
    if (event.eventUs == 0U) event.eventUs = 1U;
    xQueueSend(productSurveyWorkerEvents, &event, portMAX_DELAY);
}

void cleanupProductSurveyWorkerHardware(
    ProductSurveyWorkerReport* report) {
    if (report == nullptr) return;
    report->storeBytesWritten = productSurveyStore.bytesWritten();
    productSurveyStore.end();
    if (productSurveyFilesystem.mounted()) productSurveyFilesystem.end();
    surveyStoreRouter.bind(ramSessionStore);
    report->backendOpen = false;
    const bool filesystemCleanup =
        !report->filesystemAttempted || productSurveyFilesystem.cleanupComplete();
    report->cleanupComplete = report->identityCleanupComplete &&
        report->scannerCleanupComplete && filesystemCleanup &&
        !productSurveyFilesystem.mounted() &&
        surveyStoreRouter.boundTo(ramSessionStore);
}

ProductSurveyWorkerReport prepareProductSurveyWorker(
    BoardWifiPassiveScanner* wifiScanner,
    BoardBlePassiveScanner* bleScanner) {
    ProductSurveyWorkerReport report;
    report.status = "preparing";
    report.cleanupComplete = false;
    publishProductSurveyPreparationStage("entry");
    heartbeatProductSurveyPreparation();
    if (wifiScanner == nullptr || bleScanner == nullptr) {
        report.status = "worker_missing";
        return report;
    }

    portENTER_CRITICAL(&productSurveyWorkerMux);
    const std::uint32_t ownedResources = productSurveyWorkerOwnedResources;
    const std::uint8_t selectedSourceMask =
        productSurveyRuntime.selectedSourceMask;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    report.selectedSourceMask = selectedSourceMask;
    const auto required =
        leshy1::kernel::runtime::resourceMask(Resource::UiForeground) |
        leshy1::kernel::runtime::resourceMask(Resource::EspRf) |
        leshy1::kernel::runtime::resourceMask(Resource::Storage) |
        leshy1::kernel::runtime::resourceMask(Resource::RadioSpi);
    if ((ownedResources & required) != required) {
        report.status = "resources_missing";
        return report;
    }
    if (!loadProductFingerprint(report.expectedFingerprint,
                                sizeof(report.expectedFingerprint))) {
        report.status = "enrollment_missing";
        return report;
    }

    leshy1::storage::SdTransportRunResult identity;
    for (std::uint8_t attempt = 1;
         attempt <= leshy1::storage::kProductStartMaximumIdentityAttempts;
         ++attempt) {
        if (productSurveyCancelRequested()) {
            report.status = "cancelled";
            return report;
        }
        heartbeatProductSurveyPreparation();
        publishProductSurveyPreparationStage("identity");
        BoardSdSpiTransport identityTransport;
        const bool identityBegun = identityTransport.begin();
        identity = {};
        if (identityBegun) {
            leshy1::storage::SdTransportRunPolicy policy;
            policy.allowPhysical = true;
            policy.explicitlySelected = true;
            policy.identificationOnly = true;
            policy.ownedResources = ownedResources;
            identity = leshy1::storage::runSdIdentificationStateMachine(
                leshy1::storage::defaultSdIdentificationPlan(),
                identityTransport, policy);
            identityTransport.end();
        }
        heartbeatProductSurveyPreparation();
        report.identityAttempts = attempt;
        report.identityTransientRetries =
            static_cast<std::uint8_t>(attempt - 1U);
        report.identityStatus = identity.status;
        report.identityCleanupComplete = identityTransport.cleanupComplete();
        formatCidFingerprint(identity.identity,
                             report.observedFingerprint,
                             sizeof(report.observedFingerprint));
        if (report.identityCleanupComplete &&
            identity.status == leshy1::storage::SdTransportRunStatus::Valid) {
            break;
        }
        const leshy1::storage::ProductStartIdentityRetryEvidence retryEvidence{
            true,
            true,
            exactCidFingerprint(report.expectedFingerprint),
            (ownedResources & required) == required,
            identityTransport.physicalSpiStarted(),
            identity.status,
            std::strcmp(report.observedFingerprint,
                        "00000000000000000000000000000000") == 0,
            report.identityCleanupComplete,
            report.filesystemAttempted,
        };
        if (!leshy1::storage::shouldRetryProductStartIdentity(
                retryEvidence, attempt)) {
            break;
        }
        ulTaskNotifyTake(
            pdTRUE,
            pdMS_TO_TICKS(
                leshy1::storage::productStartIdentityRetryDelayMs(attempt)));
        heartbeatProductSurveyPreparation();
    }
    if (productSurveyCancelRequested()) {
        report.status = "cancelled";
        return report;
    }
    if (!report.identityCleanupComplete ||
        identity.status != leshy1::storage::SdTransportRunStatus::Valid) {
        report.status = "identity_failed";
        return report;
    }
    if (std::strcmp(report.expectedFingerprint,
                    report.observedFingerprint) != 0) {
        report.status = "fingerprint_mismatch";
        return report;
    }

    // Cold boot already mounted this exact enrolled card read-only, recovered
    // the catalog and retained its immutable geometry plus the FAT FSInfo free
    // hint. Explicit Start re-reads CID physically, then reuses that evidence
    // for admission. There is deliberately no pre-scan writable mount: Wi-Fi
    // and BLE run with the SD stack absent, and Stop performs the one exact-CID
    // writable mount needed for the atomic commit.
    publishProductSurveyPreparationStage("boot_storage_evidence");
    report.cardCapacityBytes = productBootRecovery.cardCapacityBytes;
    report.cachedFreeBytes = productBootRecovery.cachedFreeBytes;
    const bool capacityMatched =
        report.cardCapacityBytes != 0 &&
        report.cardCapacityBytes == identity.identity.capacityBytes &&
        productBootRecovery.cleanupComplete;
    const bool rootExists = knownProductSessionRootExists(
        report.observedFingerprint);

    leshy1::storage::MediaIdentity media;
    media.present = capacityMatched;
    media.kind = leshy1::storage::MediaKind::Sd;
    media.fingerprint = report.observedFingerprint;
    media.capacityBytes = report.cardCapacityBytes;
    media.freeBytes = report.cachedFreeBytes;
    leshy1::storage::ProductStoreRequest storeRequest;
    storeRequest.operation =
        leshy1::storage::ProductStoreOperation::CommitSession;
    storeRequest.explicitlySelected = true;
    storeRequest.expectedFingerprint = report.expectedFingerprint;
    storeRequest.rootPath = leshy1::storage::kProductSessionStoreRoot;
    storeRequest.rootExists = rootExists;
    storeRequest.driverWriteEnabled = true;
    storeRequest.requiredBytes = kProductSurveyCommitBytes;
    storeRequest.reserveBytes = kProductSurveyReserveBytes;
    storeRequest.ownedResources = ownedResources;
    storeRequest.power = powerSafetyPolicy.writeDisposition();
    const leshy1::storage::ProductStorePermit storePermit =
        leshy1::storage::authorizeProductStore(media, storeRequest);
    report.storeStatus = storePermit.status;
    if (!storePermit.allowed()) {
        report.status =
            leshy1::storage::productStoreAccessStatusName(storePermit.status);
        return report;
    }

    report.sourceFailureInjected =
        consumeProductSurveySourceUnavailableInjection();
    if (report.sourceFailureInjected) {
        report.sourceStartAttempted = false;
        report.activeSourceMask = 0;
        report.unavailableSourceMask = selectedSourceMask;
        leshy1::apps::survey::ProductSurveyRequest unavailableRequest;
        unavailableRequest.explicitStart = true;
        unavailableRequest.sourceAvailable = false;
        unavailableRequest.selectedSourceMask = selectedSourceMask;
        unavailableRequest.availableSourceMask = 0;
        unavailableRequest.scanPlan =
            leshy1::drivers::wifi::defaultPassivePlan();
        unavailableRequest.bleScanPlan =
            leshy1::drivers::ble::defaultPassivePlan();
        unavailableRequest.storePermit = storePermit;
        unavailableRequest.ownedResources = ownedResources;
        const auto unavailablePermit =
            leshy1::apps::survey::authorizeProductSurvey(unavailableRequest);
        report.admissionStatus = unavailablePermit.status;
        report.scannerCleanupComplete = true;
        report.status =
            leshy1::apps::survey::productSurveyAdmissionStatusName(
                unavailablePermit.status);
        return report;
    }

