anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    // Admission is policy-only. Keep the physical product store closed until
    // both radio stacks have stopped and the terminal commit revalidates CID.
    surveyStoreRouter.bind(ramSessionStore);
    report.backendOpen = false;
    if (productSurveyCancelRequested()) {
        report.status = "cancelled";
        return report;
    }

    report.sourceStartAttempted = selectedSourceMask != 0;
    const std::uint8_t wifiMask =
        leshy1::services::survey::sourceMask(RadioKind::Wifi);
    const std::uint8_t bleMask =
        leshy1::services::survey::sourceMask(RadioKind::Ble);
    // Admission records the selected built-in receivers, but deliberately does
    // not start either radio. Wi-Fi and BLE are measured serially below. The
    // bounded BLE observer is initialized only after this storage release and
    // is fully stopped/deinitialized before any terminal event can reopen FAT.
    report.activeSourceMask = static_cast<std::uint8_t>(
        selectedSourceMask & static_cast<std::uint8_t>(wifiMask | bleMask));
    report.unavailableSourceMask = static_cast<std::uint8_t>(
        selectedSourceMask & ~report.activeSourceMask);
    leshy1::apps::survey::ProductSurveyRequest surveyRequest;
    surveyRequest.explicitStart = true;
    surveyRequest.sourceAvailable = report.activeSourceMask != 0;
    surveyRequest.selectedSourceMask = selectedSourceMask;
    surveyRequest.availableSourceMask = report.activeSourceMask;
    surveyRequest.scanPlan = leshy1::drivers::wifi::defaultPassivePlan();
    surveyRequest.bleScanPlan = leshy1::drivers::ble::defaultPassivePlan();
    surveyRequest.storePermit = storePermit;
    surveyRequest.ownedResources = ownedResources;
    publishProductSurveyPreparationStage("admission");
    const leshy1::apps::survey::ProductSurveyPermit surveyPermit =
        leshy1::apps::survey::authorizeProductSurvey(surveyRequest);
    report.admissionStatus = surveyPermit.status;
    report.scannerCleanupComplete =
        wifiScanner->cleanupComplete() && bleScanner->cleanupComplete();
    if (!surveyPermit.allowed()) {
        report.status =
            leshy1::apps::survey::productSurveyAdmissionStatusName(
                surveyPermit.status);
        return report;
    }
    if (productSurveyCancelRequested()) {
        report.status = "cancelled";
        return report;
    }
    report.sourceActive = true;
    report.status = "prepared";
    publishProductSurveyPreparationStage("prepared");
    return report;
}

BleRecordDisposition retainAirspaceGuardBleRecord(
    const BleAdvertisementRecord& record, std::uint64_t monotonicUs,
    void*) {
    Observation observation;
    if (!leshy1::drivers::ble::normalizePassiveRecord(
            record, monotonicUs, &observation)) {
        return BleRecordDisposition::Rejected;
    }
    switch (airspaceGuardBleRetention.accept(observation)) {
        case BleLiveRetentionDisposition::Retained:
        case BleLiveRetentionDisposition::Ignored:
            return BleRecordDisposition::Accepted;
        case BleLiveRetentionDisposition::Malformed:
            return BleRecordDisposition::Rejected;
        case BleLiveRetentionDisposition::Full:
            return BleRecordDisposition::Dropped;
    }
    return BleRecordDisposition::Rejected;
}

void runAirspaceGuardBleWorker() {
    auto& event = airspaceGuardBleEventWorkspace;
    resetAirspaceGuardBleEventWorkspace();
    event.generation = airspaceGuardBleRequestGeneration();
    event.status = "cancelled";
    if (!transitionAirspaceGuardBleControl(
            AirspaceGuardBleWorkerControl::Requested,
            AirspaceGuardBleWorkerControl::Running)) {
        if (!transitionAirspaceGuardBleControl(
                AirspaceGuardBleWorkerControl::CancelRequested,
                AirspaceGuardBleWorkerControl::Idle)) {
            return;
        }
        if (airspaceGuardBleWorkerEvents != nullptr) {
            const std::uint32_t completedGeneration = event.generation;
            xQueueOverwrite(airspaceGuardBleWorkerEvents,
                            &completedGeneration);
        }
        return;
    }

    std::uint64_t startedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (startedUs == 0U) startedUs = 1U;
    const bool supervised = armAirspaceGuardBleWorkerDeadline(startedUs);
    BoardBlePassiveScanner scanner;
    airspaceGuardBleRetention.reset();
    event.capacityDropRequested =
        consumeAirspaceGuardBleCapacityDropInjection();
    const bool capacityConfigured =
        !event.capacityDropRequested ||
        airspaceGuardBleRetention.configureEffectiveCapacity(1U);
    bool begun = false;
    if (supervised && capacityConfigured) {
        heartbeatAirspaceGuardBleWorker();
        begun = scanner.begin();
        heartbeatAirspaceGuardBleWorker();
        if (begun && airspaceGuardBleControl() ==
                         AirspaceGuardBleWorkerControl::Running) {
            event.scan = scanner.scan(
                airspaceGuardBleScanPlan(), retainAirspaceGuardBleRecord,
                nullptr);
        }
    }
    const bool cleanup = scanner.end();
    event.cleanupComplete = cleanup && scanner.cleanupComplete();
    event.retention = airspaceGuardBleRetention.stats();
    event.capacityDropInjected = event.capacityDropRequested &&
        event.retention.capacityDrops != 0U;
    const bool cancelled = airspaceGuardBleControl() ==
        AirspaceGuardBleWorkerControl::CancelRequested;
    const bool exactAccounting =
        event.scan.recordsObserved == event.scan.recordsReported &&
        event.scan.recordsReported == event.scan.recordsRead &&
        event.scan.recordsRead ==
            event.scan.accepted + event.scan.dropped &&
        event.scan.recordsRead == event.retention.recordsObserved &&
        event.scan.rejected == 0U &&
        event.scan.dropped == event.retention.capacityDrops &&
        event.retention.malformedRecords == 0U;
    // Capacity loss is uncertainty, not permission to erase every retained
    // observation. Preserve the bounded partial report with an exact dropped
    // count so the UI can say "incomplete evidence" and still show what was
    // actually observed. Transport/rejection/accounting failures remain hard
    // failures and never manufacture a report.
    const bool inspectable = supervised && begun && !cancelled &&
        capacityConfigured &&
        (!event.capacityDropRequested || event.capacityDropInjected) &&
        event.scan.valid() && event.cleanupComplete &&
        event.scan.recordsObserved != 0U && exactAccounting &&
        event.retention.recordsRetained != 0U &&
        event.retention.recordsRetained ==
            airspaceGuardBleRetention.observationCount();
    if (inspectable) {
        AirspaceGuardPolicy policy{};
        policy.bleTrackerPresenceEnabled = true;
        const bool inspected = airspaceGuardDetector.writeBleReport(
            airspaceGuardBleRetention, policy,
            event.retention.capacityDrops,
            static_cast<std::size_t>(event.scan.recordsObserved),
            &event.report);
        event.valid = inspected &&
            (event.report.status == AirspaceGuardStatus::Clear ||
             event.report.status == AirspaceGuardStatus::Finding ||
             event.report.status == AirspaceGuardStatus::Inconclusive);
        event.status = event.valid
            ? (event.retention.complete() ? "complete"
                                          : "incomplete_evidence")
            : "inspection_failed";
    } else {
        if (cancelled) {
            event.status = "cancelled";
        } else if (!supervised) {
            event.status = "supervisor_unavailable";
        } else if (!capacityConfigured) {
            event.status = "capacity_drop_configuration_failed";
        } else if (!begun) {
            event.status = "scanner_unavailable";
        } else if (!event.scan.valid()) {
            event.status = "scan_failed";
        } else if (!event.cleanupComplete) {
            event.status = "cleanup_failed";
        } else if (event.scan.rejected != 0U ||
                   event.retention.malformedRecords != 0U) {
            event.status = "rejected_ingress";
        } else if (!exactAccounting) {
            event.status = "transport_or_queue_loss";
        } else if (event.capacityDropRequested &&
                   !event.capacityDropInjected) {
            event.status = "capacity_drop_not_exercised";
        } else {
            event.status = "accounting_failed";
        }
    }
    if (supervised) {
        heartbeatAirspaceGuardBleWorker();
        disarmAirspaceGuardBleWorkerDeadline();
    }
    portENTER_CRITICAL(&productSurveyWorkerMux);
    airspaceGuardBleWorkerControl = AirspaceGuardBleWorkerControl::Idle;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    if (airspaceGuardBleWorkerEvents != nullptr) {
        // Publishing the tiny generation token transfers the already-complete
        // static payload to the loop task. A new request cannot be admitted
        // until that task consumes this terminal event.
        const std::uint32_t completedGeneration = event.generation;
        xQueueOverwrite(airspaceGuardBleWorkerEvents,
                        &completedGeneration);
    }
}

void runProductSurveyWorker(void*) {
    for (;;) {
        ulTaskNotifyTake(pdTRUE, portMAX_DELAY);
        const AirspaceGuardBleWorkerControl guardControl =
            airspaceGuardBleControl();
        if (guardControl == AirspaceGuardBleWorkerControl::Requested ||
            guardControl ==
                AirspaceGuardBleWorkerControl::CancelRequested) {
            runAirspaceGuardBleWorker();
            continue;
        }
        if (productSurveyControl() ==
                ProductSurveyWorkerControl::CommitRequested) {
            if (!transitionProductSurveyControl(
                    ProductSurveyWorkerControl::CommitRequested,
                    ProductSurveyWorkerControl::Committing)) {
                continue;
            }
            std::uint64_t commitStartedUs =
                static_cast<std::uint64_t>(esp_timer_get_time());
            if (commitStartedUs == 0U) commitStartedUs = 1U;
            const bool supervised =
                armProductSurveyWorkerDeadline(commitStartedUs);
            __atomic_store_n(&productSurveyCommitSupervisionActive,
                             supervised, __ATOMIC_RELEASE);
            const SurveyPipelineStatus status = supervised
                ? stopProductSurvey()
                : SurveyPipelineStatus::WorkflowRejected;
            __atomic_store_n(&productSurveyCommitSupervisionActive, false,
                             __ATOMIC_RELEASE);
            if (supervised) disarmProductSurveyWorkerDeadline();
            sendProductSurveyCommitWorkerEvent(status);
            continue;
        }
        if (productSurveyControl() != ProductSurveyWorkerControl::Starting) {
            continue;
        }
        if (productSurveyObservations != nullptr) {
            xQueueReset(productSurveyObservations);
        }
        setProductSurveyScanActive(false);
        publishProductSurveyBleBeginDiagnostic({});
        BoardWifiPassiveScanner wifiScanner;
        BoardBlePassiveScanner bleScanner;
        publishProductSurveyPreparationStage("arming");
        std::uint64_t preparationStartedUs =
            static_cast<std::uint64_t>(esp_timer_get_time());
        if (preparationStartedUs == 0) preparationStartedUs = 1;
        if (!armProductSurveyPreparationDeadline(preparationStartedUs)) {
            ProductSurveyWorkerReport report;
            report.status = "preparation_supervisor_unavailable";
            const bool wifiCleanup = wifiScanner.end();
            const bool bleCleanup = bleScanner.end();
            report.scannerCleanupComplete = wifiCleanup && bleCleanup;
            cleanupProductSurveyWorkerHardware(&report);
            sendProductSurveyWorkerEvent(
                ProductSurveyWorkerEventKind::Failed, report);
            continue;
        }
        if (consumeProductSurveyPreparationDeadlineInjection()) {
            vTaskDelay(pdMS_TO_TICKS(
                kProductSurveyPreparationDeadlineInjectionMs));
        }
        ProductSurveyWorkerReport report =
            prepareProductSurveyWorker(&wifiScanner, &bleScanner);
        if (std::strcmp(report.status, "prepared") != 0) {
            const bool wifiCleanup = wifiScanner.end();
            const bool bleCleanup = bleScanner.end();
            report.scannerCleanupComplete = wifiCleanup && bleCleanup;
            report.sourceActive = false;
            cleanupProductSurveyWorkerHardware(&report);
            disarmProductSurveyPreparationDeadline();
            const bool cancelled = productSurveyCancelRequested() ||
                std::strcmp(report.status, "cancelled") == 0;
            sendProductSurveyWorkerEvent(
                cancelled ? ProductSurveyWorkerEventKind::Cancelled
                          : ProductSurveyWorkerEventKind::Failed,
                report);
            continue;
        }

