anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
        if (!transitionProductSurveyControl(
                ProductSurveyWorkerControl::Starting,
                ProductSurveyWorkerControl::Running)) {
            report.status = "cancelled";
            const bool wifiCleanup = wifiScanner.end();
            const bool bleCleanup = bleScanner.end();
            report.scannerCleanupComplete = wifiCleanup && bleCleanup;
            report.sourceActive = false;
            cleanupProductSurveyWorkerHardware(&report);
            disarmProductSurveyPreparationDeadline();
            sendProductSurveyWorkerEvent(
                ProductSurveyWorkerEventKind::Cancelled, report);
            continue;
        }
        std::uint64_t workerStartedUs =
            static_cast<std::uint64_t>(esp_timer_get_time());
        if (workerStartedUs == 0) workerStartedUs = 1;
        if (!disarmProductSurveyPreparationDeadline()) {
            report.status = "preparation_supervisor_release_failed";
            const bool wifiCleanup = wifiScanner.end();
            const bool bleCleanup = bleScanner.end();
            report.scannerCleanupComplete = wifiCleanup && bleCleanup;
            report.sourceActive = false;
            cleanupProductSurveyWorkerHardware(&report);
            sendProductSurveyWorkerEvent(
                ProductSurveyWorkerEventKind::Failed, report);
            continue;
        }
        if (!armProductSurveyWorkerDeadline(workerStartedUs)) {
            report.status = "worker_supervisor_unavailable";
            const bool wifiCleanup = wifiScanner.end();
            const bool bleCleanup = bleScanner.end();
            report.scannerCleanupComplete = wifiCleanup && bleCleanup;
            report.sourceActive = false;
            cleanupProductSurveyWorkerHardware(&report);
            sendProductSurveyWorkerEvent(
                ProductSurveyWorkerEventKind::Failed, report);
            continue;
        }
        sendProductSurveyWorkerEvent(
            ProductSurveyWorkerEventKind::Prepared, report);
        heartbeatProductSurveyWorker();
        if (consumeProductSurveyWorkerDeadlineInjection()) {
            vTaskDelay(pdMS_TO_TICKS(
                kProductSurveyWorkerDeadlineInjectionMs));
        }
        BoardWifiPassiveScanResult wifiAggregate;
        BoardBlePassiveScanResult bleAggregate;
        std::uint32_t scanCycles = 0;
        std::uint32_t wifiScanCycles = 0;
        std::uint32_t bleScanCycles = 0;
        bool scanFailed = false;
        // Wi-Fi, NimBLE and FAT all compete for scarce DMA-capable internal
        // heap on the no-PSRAM DIV. Each radio therefore owns a disjoint scan
        // window: Wi-Fi is initialized/scanned/deinitialized first, then the
        // complete NimBLE host/controller lifecycle is initialized, scanned
        // and deinitialized. No radio stack survives into the other source's
        // window or into the terminal FAT reopen.
        bool pendingScanWindow = false;
        RadioKind pendingScanSource = RadioKind::Wifi;
        std::uint64_t pendingScanStartedUs = 0;
        std::uint64_t pendingScanEndedUs = 0;
        std::uint16_t pendingScanDropped = 0;
        while (!productSurveyStopRequested()) {
            std::uint8_t attemptedSourceMask = 0;
            const std::array<RadioKind, 2> schedule{
                RadioKind::Wifi, RadioKind::Ble};
            for (const RadioKind source : schedule) {
                const std::uint8_t mask =
                    leshy1::services::survey::sourceMask(source);
                if ((report.activeSourceMask & mask) == 0) continue;
                if (productSurveyStopRequested()) break;
                attemptedSourceMask = static_cast<std::uint8_t>(
                    attemptedSourceMask | mask);
                heartbeatProductSurveyWorker();
                std::uint64_t scanStartedUs =
                    static_cast<std::uint64_t>(esp_timer_get_time());
                if (scanStartedUs == 0) scanStartedUs = 1;
                const std::uint32_t sourceCycles =
                    source == RadioKind::Wifi ? wifiScanCycles : bleScanCycles;
                // Event and observation queues cannot establish ordering with
                // each other. Clear any stale acknowledgement, publish the
                // window transition, and wait until the UI task has made this
                // source Active before its driver can emit observations.
                xSemaphoreTake(productSurveyScanStartGate, 0);
                sendProductSurveyWorkerEvent(
                    ProductSurveyWorkerEventKind::ScanStarted, report, source,
                    wifiAggregate, bleAggregate, scanCycles, sourceCycles,
                    scanStartedUs, scanStartedUs);
                xSemaphoreTake(productSurveyScanStartGate, portMAX_DELAY);
                if (productSurveyStopRequested()) break;
                heartbeatProductSurveyWorker();
                setProductSurveyScanActive(true);
                BoardWifiPassiveScanResult wifiScan;
                BoardBlePassiveScanResult bleScan;
                const bool runtimeUnavailableInjected =
                    consumeProductSurveyRuntimeUnavailableInjection(source);
                if (runtimeUnavailableInjected) {
                    report.runtimeSourceFailureInjected = true;
                    report.runtimeSourceFailureInjectedMask =
                        static_cast<std::uint8_t>(
                            report.runtimeSourceFailureInjectedMask | mask);
                } else if (source == RadioKind::Wifi) {
                    if (wifiScanner.begin()) {
                        heartbeatProductSurveyWorker();
                        wifiScan = wifiScanner.scan(
                            leshy1::drivers::wifi::defaultPassivePlan(),
                            enqueueProductSurveyWorkerRecord, nullptr);
                        const bool accessPointCleanup = wifiScanner.end();
                        if (productSurveyFieldVisit() && wifiScan.valid() &&
                            !productSurveyStopRequested()) {
                            if (!accessPointCleanup) {
                                wifiScan.status = leshy1::platform::arduino::
                                    BoardWifiScanStatus::RecordFailed;
                            } else {
                                const FieldSurveyStationCaptureResult stations =
                                    captureFieldSurveyStations();
                                wifiScan.recordsReported =
                                    static_cast<std::uint16_t>(
                                        wifiScan.recordsReported +
                                        stations.uniqueStations);
                                wifiScan.recordsRead =
                                    static_cast<std::uint16_t>(
                                        wifiScan.recordsRead +
                                        stations.uniqueStations);
                                wifiScan.accepted =
                                    static_cast<std::uint16_t>(
                                        wifiScan.accepted +
                                        stations.accepted);
                                wifiScan.rejected =
                                    static_cast<std::uint16_t>(
                                        wifiScan.rejected +
                                        stations.rejected);
                                wifiScan.dropped =
                                    static_cast<std::uint16_t>(
                                        wifiScan.dropped +
                                        std::min<std::uint32_t>(
                                            stations.dropped,
                                            UINT16_MAX -
                                                wifiScan.dropped));
                                wifiScan.durationUs += stations.durationUs;
                                if (!stations.begun || !stations.complete) {
                                    wifiScan.status = leshy1::platform::arduino::
                                        BoardWifiScanStatus::RecordFailed;
                                    if (wifiScan.driverError == 0) {
                                        wifiScan.driverError =
                                            wifiFrameCapture.lastError();
                                    }
                                }
                            }
                        }
                    } else {
                        // Preserve the exact driver init/start error even
                        // though NotStarted intentionally classifies this
                        // source as unavailable rather than a session fault.
                        wifiScan.driverError = wifiScanner.lastError();
                    }
                } else {
                    const bool bleReady = bleScanner.begin();
                    publishProductSurveyBleBeginDiagnostic(
                        bleScanner.beginDiagnostic());
                    if (bleReady) {
                        heartbeatProductSurveyWorker();
                        bleScan = bleScanner.scan(
                            leshy1::drivers::ble::defaultPassivePlan(),
                            enqueueProductSurveyWorkerBleRecord, nullptr);
                    }
                }
                setProductSurveyScanActive(false);
                heartbeatProductSurveyWorker();
                std::uint64_t sourceCleanupUs =
                    static_cast<std::uint64_t>(esp_timer_get_time());
                if (sourceCleanupUs == 0U) sourceCleanupUs = 1U;
                const bool wifiScannerCleanup = source == RadioKind::Wifi
                    ? wifiScanner.end() : true;
                const bool wifiCaptureCleanup = source == RadioKind::Wifi
                    ? wifiFrameCapture.stop(sourceCleanupUs) : true;
                const bool sourceCleanup = source == RadioKind::Wifi
                    ? (wifiScannerCleanup && wifiCaptureCleanup &&
                       wifiFrameCapture.cleanupComplete())
                    : bleScanner.end();
                if (source == RadioKind::Ble) {
                    publishProductSurveyBleBeginDiagnostic(
                        bleScanner.beginDiagnostic());
                }
                report.scannerCleanupComplete = sourceCleanup &&
                    wifiScanner.cleanupComplete() &&
                    bleScanner.cleanupComplete();
                heartbeatProductSurveyWorker();
                std::uint64_t scanEndedUs =
                    static_cast<std::uint64_t>(esp_timer_get_time());
                if (scanEndedUs < scanStartedUs) scanEndedUs = scanStartedUs;
                pendingScanWindow = true;
                pendingScanSource = source;
                pendingScanStartedUs = scanStartedUs;
                pendingScanEndedUs = scanEndedUs;
                pendingScanDropped = source == RadioKind::Wifi
                    ? wifiScan.dropped : bleScan.dropped;
                if (!report.scannerCleanupComplete) {
                    report.status = "scanner_cleanup_failed";
                    scanFailed = true;
                    break;
                }
                if (productSurveyStopRequested()) break;
                const bool valid = source == RadioKind::Wifi
                    ? wifiScan.valid() : bleScan.valid();
                if (!valid) {
                    if (source == RadioKind::Wifi) {
                        accumulateProductSurveyScan(&wifiAggregate, wifiScan);
                    } else {
                        accumulateProductSurveyBleScan(&bleAggregate, bleScan);
                    }
                    const auto degradation =
                        leshy1::services::survey::decideSourceDegradation(
                            report.activeSourceMask,
                            report.unavailableSourceMask, source,
                            productSurveyFailureClass(
                                source, wifiScan, bleScan));
                    if (!degradation.valid) {
                        report.status = "invalid_source_failure";
                        scanFailed = true;
                        break;
                    }
                    report.activeSourceMask = degradation.activeSourceMask;
                    report.unavailableSourceMask =
                        degradation.unavailableSourceMask;
                    report.status = degradation.status;
                    if (!degradation.continueSession &&
                        source == RadioKind::Ble) {
                        // Runtime loss of the sole selected source is the same
                        // user-visible admission result as a source rejected
                        // before startup. Preserve it through the terminal
                        // event so the BLE page remains an honest unavailable
                        // state instead of bouncing back to Home.
                        report.admissionStatus =
                            leshy1::apps::survey::
                                ProductSurveyAdmissionStatus::SourceUnavailable;
                    }
                    sendProductSurveyWorkerEvent(
                        ProductSurveyWorkerEventKind::SourceUnavailable,
                        report, source, wifiAggregate, bleAggregate,
                        scanCycles, sourceCycles, scanEndedUs,
                        scanStartedUs, scanEndedUs, pendingScanDropped,
                        degradation.windowState,
                        degradation.windowReason);
                    pendingScanWindow = false;
                    if (!degradation.continueSession) {
                        scanFailed = true;
                        break;
                    }
                    continue;
                }
                if (source == RadioKind::Wifi) {
                    ++wifiScanCycles;
                    accumulateProductSurveyScan(&wifiAggregate, wifiScan);
                } else {
                    ++bleScanCycles;
                    accumulateProductSurveyBleScan(&bleAggregate, bleScan);
                }
                const bool wifiActive =
                    (report.activeSourceMask &
                     leshy1::services::survey::sourceMask(RadioKind::Wifi)) != 0;
                const bool bleActive =
                    (report.activeSourceMask &
                     leshy1::services::survey::sourceMask(RadioKind::Ble)) != 0;
                scanCycles = wifiActive && bleActive
                    ? (wifiScanCycles < bleScanCycles
                           ? wifiScanCycles : bleScanCycles)
                    : (wifiActive ? wifiScanCycles : bleScanCycles);
                sendProductSurveyWorkerEvent(
                    ProductSurveyWorkerEventKind::Scan, report, source,
                    wifiAggregate, bleAggregate, scanCycles,
                    source == RadioKind::Wifi ? wifiScanCycles : bleScanCycles,
                    scanEndedUs, scanStartedUs, scanEndedUs,
                    pendingScanDropped);
                pendingScanWindow = false;
            }
            const bool stopRequested = productSurveyStopRequested();
            const leshy1::apps::survey::FieldSurveyCycleEvidence
                cycleEvidence{
                    productSurveyFieldVisit(), scanFailed, stopRequested,
                    report.selectedSourceMask, attemptedSourceMask,
                    report.unavailableSourceMask};
            if (leshy1::apps::survey::shouldAutoPauseFieldVisit(
                    cycleEvidence)) {
                transitionProductSurveyControl(
                    ProductSurveyWorkerControl::Running,
                    ProductSurveyWorkerControl::PauseRequested);
            }
            if (productSurveyStopRequested() || scanFailed) break;
            ulTaskNotifyTake(
                pdTRUE, pdMS_TO_TICKS(kProductSurveyScanIntervalMs));
            heartbeatProductSurveyWorker();
        }

        const ProductSurveyWorkerControl terminalControl =
            productSurveyControl();
        setProductSurveyScanActive(false);
        const bool wifiCleanup = wifiScanner.end();
        const bool bleCleanup = bleScanner.end();
        report.scannerCleanupComplete = wifiCleanup && bleCleanup;
        report.sourceActive = false;
        if (!report.scannerCleanupComplete) {
            report.status = "scanner_cleanup_failed";
            scanFailed = true;
        }
        std::uint64_t terminalUs =
            static_cast<std::uint64_t>(esp_timer_get_time());
        if (terminalUs == 0) terminalUs = 1;
        if (scanFailed ||
            terminalControl == ProductSurveyWorkerControl::CancelRequested) {
            cleanupProductSurveyWorkerHardware(&report);
        }
        disarmProductSurveyWorkerDeadline();
        if (scanFailed) {
            sendProductSurveyWorkerEvent(
                ProductSurveyWorkerEventKind::Failed,
                report, pendingScanSource, wifiAggregate, bleAggregate,
                scanCycles,
                pendingScanSource == RadioKind::Wifi
                    ? wifiScanCycles : bleScanCycles,
                terminalUs,
                pendingScanWindow ? pendingScanStartedUs : 0,
                pendingScanWindow ? pendingScanEndedUs : 0,
                pendingScanWindow ? pendingScanDropped : 0);
        } else if (terminalControl ==
                   ProductSurveyWorkerControl::PauseRequested) {
            report.status = "paused";
            sendProductSurveyWorkerEvent(
                ProductSurveyWorkerEventKind::Paused,
                report, pendingScanSource, wifiAggregate, bleAggregate,
                scanCycles,
                pendingScanSource == RadioKind::Wifi
                    ? wifiScanCycles : bleScanCycles,
                terminalUs,
                pendingScanWindow ? pendingScanStartedUs : 0,
                pendingScanWindow ? pendingScanEndedUs : 0,
                pendingScanWindow ? pendingScanDropped : 0);
        } else if (terminalControl ==
                   ProductSurveyWorkerControl::StopRequested) {
            report.status = "stopped";
            sendProductSurveyWorkerEvent(
                ProductSurveyWorkerEventKind::Stopped,
                report, pendingScanSource, wifiAggregate, bleAggregate,
                scanCycles,
                pendingScanSource == RadioKind::Wifi
                    ? wifiScanCycles : bleScanCycles,
                terminalUs,
                pendingScanWindow ? pendingScanStartedUs : 0,
                pendingScanWindow ? pendingScanEndedUs : 0,
                pendingScanWindow ? pendingScanDropped : 0);
        } else {
            report.status = "cancelled";
            sendProductSurveyWorkerEvent(
                ProductSurveyWorkerEventKind::Cancelled,
                report, pendingScanSource, wifiAggregate, bleAggregate,
                scanCycles,
                pendingScanSource == RadioKind::Wifi
                    ? wifiScanCycles : bleScanCycles,
                terminalUs,
                pendingScanWindow ? pendingScanStartedUs : 0,
                pendingScanWindow ? pendingScanEndedUs : 0,
                pendingScanWindow ? pendingScanDropped : 0);
        }
    }
}

bool initializeProductSurveyWorker() {
    productSurveyScanStartGate = xSemaphoreCreateBinaryStatic(
        &productSurveyScanStartGateStorage);
    productSurveyWorkerEvents = xQueueCreate(
        kProductSurveyWorkerEventCapacity,
        sizeof(ProductSurveyWorkerEvent));
    productSurveyObservations = xQueueCreate(
        kProductSurveyObservationCapacity, sizeof(Observation));
    airspaceGuardBleWorkerEvents = xQueueCreate(
        1U, sizeof(std::uint32_t));
    if (productSurveyScanStartGate == nullptr ||
        productSurveyWorkerEvents == nullptr ||
        productSurveyObservations == nullptr ||
        airspaceGuardBleWorkerEvents == nullptr) {
        if (productSurveyWorkerEvents != nullptr) {
            vQueueDelete(productSurveyWorkerEvents);
            productSurveyWorkerEvents = nullptr;
        }
        if (productSurveyObservations != nullptr) {
            vQueueDelete(productSurveyObservations);
            productSurveyObservations = nullptr;
        }
        if (airspaceGuardBleWorkerEvents != nullptr) {
            vQueueDelete(airspaceGuardBleWorkerEvents);
            airspaceGuardBleWorkerEvents = nullptr;
        }
        return false;
    }
    const bool started = xTaskCreatePinnedToCore(
        runProductSurveyWorker, "leshy-survey", 8192, nullptr, 1,
        &productSurveyWorkerTaskHandle, 0) == pdPASS;
    if (!started) {
        vQueueDelete(productSurveyWorkerEvents);
        vQueueDelete(productSurveyObservations);
        vQueueDelete(airspaceGuardBleWorkerEvents);
        productSurveyWorkerEvents = nullptr;
        productSurveyObservations = nullptr;
        airspaceGuardBleWorkerEvents = nullptr;
        productSurveyScanStartGate = nullptr;
    } else {
        productSurveyObservationQueueCapacity =
            kProductSurveyObservationCapacity;
        bleProductSurveyMemoryCompact = false;
    }
    return started;
}

