anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
bool resizeProductSurveyObservationQueue(UBaseType_t capacity) {
    if (capacity == 0U || productSurveyControl() !=
            ProductSurveyWorkerControl::Idle ||
        productSurveyWorkerTaskHandle == nullptr ||
        productSurveyObservations == nullptr ||
        uxQueueMessagesWaiting(productSurveyObservations) != 0U ||
        airspaceGuardSurveyQueuesReleased) {
        return false;
    }
    if (capacity == productSurveyObservationQueueCapacity) return true;

    const UBaseType_t previousCapacity =
        productSurveyObservationQueueCapacity;
    vQueueDelete(productSurveyObservations);
    productSurveyObservations = nullptr;
    // A queue deleted by loopTask is immediately reclaimable, but one tick
    // gives the allocator/idle housekeeping a deterministic boundary before
    // the replacement and the later NimBLE preflight measurement.
    vTaskDelay(1);
    productSurveyObservations = xQueueCreate(capacity, sizeof(Observation));
    if (productSurveyObservations != nullptr) {
        productSurveyObservationQueueCapacity = capacity;
        return true;
    }

    // Fail closed while retaining the ordinary Survey worker if the compact
    // replacement cannot be allocated.  The caller will not start a radio.
    productSurveyObservations = xQueueCreate(
        previousCapacity, sizeof(Observation));
    if (productSurveyObservations != nullptr) {
        productSurveyObservationQueueCapacity = previousCapacity;
    } else {
        productSurveyWorkerReady = false;
    }
    return false;
}

bool restoreBleProductSurveyMemory();

bool prepareBleProductSurveyMemory() {
    if (!resizeProductSurveyObservationQueue(
            kBleProductSurveyObservationCapacity)) {
        return false;
    }
    bleProductSurveyMemoryCompact = true;
    const std::uint32_t freeHeap = static_cast<std::uint32_t>(
        heap_caps_get_free_size(MALLOC_CAP_8BIT));
    const std::uint32_t largestHeap = static_cast<std::uint32_t>(
        heap_caps_get_largest_free_block(MALLOC_CAP_8BIT));
    if (freeHeap < kBleProductMinimumFreeHeapBeforeBegin ||
        largestHeap < kBleProductMinimumLargestHeapBeforeBegin) {
        (void)restoreBleProductSurveyMemory();
        return false;
    }
    return true;
}

bool restoreBleProductSurveyMemory() {
    if (!bleProductSurveyMemoryCompact) return true;
    const bool restored = resizeProductSurveyObservationQueue(
        kProductSurveyObservationCapacity);
    if (restored) bleProductSurveyMemoryCompact = false;
    return restored;
}

bool releaseProductSurveyQueuesForAirspaceGuard() {
    if (airspaceGuardSurveyQueuesReleased) return true;
    if (!productSurveyWorkerReady ||
        productSurveyControl() != ProductSurveyWorkerControl::Idle ||
        airspaceGuardBleControl() != AirspaceGuardBleWorkerControl::Idle ||
        productSurveyWorkerTaskHandle == nullptr ||
        productSurveyWorkerEvents == nullptr ||
        productSurveyObservations == nullptr ||
        airspaceGuardBleWorkerEvents == nullptr) {
        return false;
    }
    airspaceGuardHeapFreeBeforeQueueRelease =
        static_cast<std::uint32_t>(
            heap_caps_get_free_size(MALLOC_CAP_8BIT));
    airspaceGuardHeapLargestBeforeQueueRelease =
        static_cast<std::uint32_t>(
            heap_caps_get_largest_free_block(MALLOC_CAP_8BIT));
    // The persistent worker and tiny BLE completion-token queue remain alive.
    // Only the ordinary Survey payload queues are lifecycle-exclusive with
    // Airspace Guard, so releasing them cannot race a Survey operation and
    // gives repeated Wi-Fi driver initialization a contiguous internal-RAM
    // block without adding a second network path here.
    vQueueDelete(productSurveyWorkerEvents);
    vQueueDelete(productSurveyObservations);
    productSurveyWorkerEvents = nullptr;
    productSurveyObservations = nullptr;
    vTaskDelay(1);
    airspaceGuardHeapFreeAfterQueueRelease =
        static_cast<std::uint32_t>(
            heap_caps_get_free_size(MALLOC_CAP_8BIT));
    airspaceGuardHeapLargestAfterQueueRelease =
        static_cast<std::uint32_t>(
            heap_caps_get_largest_free_block(MALLOC_CAP_8BIT));
    airspaceGuardSurveyQueuesReleased = true;
    airspaceGuardSurveyQueueRestorePending = false;
    return true;
}

bool restoreProductSurveyQueuesAfterAirspaceGuard() {
    if (!airspaceGuardSurveyQueuesReleased) {
        airspaceGuardSurveyQueueRestorePending = false;
        return true;
    }
    QueueHandle_t events = xQueueCreate(
        kProductSurveyWorkerEventCapacity,
        sizeof(ProductSurveyWorkerEvent));
    QueueHandle_t observations = xQueueCreate(
        kProductSurveyObservationCapacity, sizeof(Observation));
    if (events == nullptr || observations == nullptr) {
        if (events != nullptr) vQueueDelete(events);
        if (observations != nullptr) vQueueDelete(observations);
        return false;
    }
    productSurveyWorkerEvents = events;
    productSurveyObservations = observations;
    productSurveyObservationQueueCapacity =
        kProductSurveyObservationCapacity;
    bleProductSurveyMemoryCompact = false;
    airspaceGuardSurveyQueuesReleased = false;
    airspaceGuardSurveyQueueRestorePending = false;
    airspaceGuardHeapFreeAfterQueueRestore =
        static_cast<std::uint32_t>(
            heap_caps_get_free_size(MALLOC_CAP_8BIT));
    return true;
}

bool suspendProductSurveyWorkerForWebCompanion() {
    if (webCompanionSurveyWorkerSuspended) return true;
    if (!productSurveyWorkerReady || airspaceGuardSurveyQueuesReleased ||
        productSurveyControl() != ProductSurveyWorkerControl::Idle ||
        airspaceGuardBleControl() != AirspaceGuardBleWorkerControl::Idle ||
        productSurveyWorkerTaskHandle == nullptr) {
        return false;
    }
    webCompanionHeapBeforeWorkerSuspend = static_cast<std::uint32_t>(
        heap_caps_get_free_size(MALLOC_CAP_8BIT));
    TaskHandle_t task = productSurveyWorkerTaskHandle;
    productSurveyWorkerTaskHandle = nullptr;
    productSurveyWorkerReady = false;
    vTaskDelete(task);
    if (productSurveyWorkerEvents != nullptr) {
        vQueueDelete(productSurveyWorkerEvents);
        productSurveyWorkerEvents = nullptr;
    }
    if (productSurveyObservations != nullptr) {
        vQueueDelete(productSurveyObservations);
        productSurveyObservations = nullptr;
    }
    if (airspaceGuardBleWorkerEvents != nullptr) {
        vQueueDelete(airspaceGuardBleWorkerEvents);
        airspaceGuardBleWorkerEvents = nullptr;
    }
    productSurveyScanStartGate = nullptr;
    // A task deleted by another task is reclaimed by the idle task. Yield once
    // before measuring or asking the Wi-Fi driver for contiguous internal RAM.
    vTaskDelay(1);
    webCompanionHeapAfterWorkerSuspend = static_cast<std::uint32_t>(
        heap_caps_get_free_size(MALLOC_CAP_8BIT));
    webCompanionSurveyWorkerSuspended = true;
    return true;
}

bool restoreProductSurveyWorkerAfterWebCompanion() {
    if (!webCompanionSurveyWorkerSuspended) return true;
    productSurveyWorkerReady = initializeProductSurveyWorker();
    if (productSurveyWorkerReady) {
        webCompanionSurveyWorkerSuspended = false;
    }
    return productSurveyWorkerReady;
}

bool admitTargetsWithStickyNetworkCore() {
    // esp_netif_deinit() is unsupported by the pinned ESP-IDF, so the first
    // explicitly authorized Local Web lifecycle leaves the TCP/IP core as a
    // process-lifetime allocation. Clean boot has enough memory for Targets
    // plus the idle Survey worker; post-Web does not. Keep those two heavy
    // components lifecycle-exclusive after network-core admission and restore
    // the worker in releaseTargetsProduct(). No network is started here.
    if (!arduinoCompanionWebService.networkCoreReady() ||
        webCompanionSurveyWorkerSuspended) {
        return true;
    }
    return suspendProductSurveyWorkerForWebCompanion();
}

bool failProductSurveyStart(const char* status) {
    if (surveyWorkflow.state() == SurveyWorkflowState::Running) {
        surveyPipeline.cancel();
    }
    closeProductSurveyBackend();
    productSurveyRuntime.status = productSurveyRuntime.cleanupComplete
                                      ? status
                                      : "cleanup_failed";
    lastRuntimeEvent = productSurveyRuntime.status;
    return false;
}

