anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
bool startProductSurvey() {
    const std::uint64_t actionStartedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (!productSurveyWorkerReady || airspaceGuardSurveyQueuesReleased ||
        productSurveyControl() != ProductSurveyWorkerControl::Idle ||
        productSurveyWorkerTaskHandle == nullptr) {
        productSurveyRuntime.status = "worker_unavailable";
        lastRuntimeEvent = productSurveyRuntime.status;
        return false;
    }
    if (productSurveyFilesystem.mounted() ||
        productSurveyRuntime.backendOpen ||
        productSurveyRuntime.sourceActive || productSurveyScanActive() ||
        !productSurveyRuntime.cleanupComplete) {
        productSurveyRuntime.status = "storage_not_quiescent";
        lastRuntimeEvent = productSurveyRuntime.status;
        return false;
    }
    productSurveyRuntime = {};
    productSurveyTimeline.reset();
    productSurveyRuntime.status = "preparing";
    productSurveyRuntime.selected = true;
    productSurveyRuntime.selectedSourceMask =
        surveySourceController.selectedMask();
    productSurveyRuntime.timelineStatus = "preparing";
    if (productSurveyRuntime.selectedSourceMask == 0) {
        productSurveyRuntime.status = "source_plan_empty";
        productSurveyRuntime.timelineStatus = "invalid_mask";
        productSurveyRuntime.cleanupComplete = true;
        lastRuntimeEvent = productSurveyRuntime.status;
        return false;
    }
    const bool bleSelected =
        (productSurveyRuntime.selectedSourceMask &
         leshy1::services::survey::sourceMask(RadioKind::Ble)) != 0;
    // NimBLE needs a contiguous internal-RAM reserve even when it starts only
    // after a complete Wi-Fi teardown. Reserve it before the worker owns the
    // session so mixed Field Visits have the same fail-closed admission as the
    // BLE-only product and can never reach NimBLE's allocation assertion.
    if (bleSelected && !prepareBleProductSurveyMemory()) {
        productSurveyRuntime.status = "ble_memory_unavailable";
        productSurveyRuntime.timelineStatus = "memory_unavailable";
        productSurveyRuntime.cleanupComplete = true;
        lastRuntimeEvent = productSurveyRuntime.status;
        return false;
    }
    productSurveyRuntime.cleanupComplete = false;
    productSurveyRuntime.workerReady = true;
    portENTER_CRITICAL(&productSurveyWorkerMux);
    productSurveyWorkerOwnedResources = appRuntime.activeResources();
    productSurveyWorkerScanActive = false;
    productSurveyWorkerFieldVisit =
        wifiProductView == WifiProductView::Visit;
    productSurveyWorkerControl = ProductSurveyWorkerControl::Starting;
    portEXIT_CRITICAL(&productSurveyWorkerMux);
    xTaskNotifyGive(productSurveyWorkerTaskHandle);
    productSurveyRuntime.startActionUs =
        static_cast<std::uint64_t>(esp_timer_get_time()) - actionStartedUs;
    lastRuntimeEvent = "product_survey_preparing";
    return true;
}

bool serviceProductSurveyCommitBoundary() {
    // The product adapter is also reused by read-only boot/recovery paths.
    // Outside the explicit terminal worker there is no commit deadline to
    // service, so its progress callback is deliberately transparent.
    if (!__atomic_load_n(&productSurveyCommitSupervisionActive,
                         __ATOMIC_ACQUIRE)) {
        return true;
    }
    if (productSurveyControl() != ProductSurveyWorkerControl::Committing ||
        safetySupervisor.latched()) {
        return false;
    }
    const bool accepted = heartbeatProductSurveyWorker();
    if (accepted) vTaskDelay(pdMS_TO_TICKS(1U));
    return accepted &&
        productSurveyControl() == ProductSurveyWorkerControl::Committing &&
        !safetySupervisor.latched();
}

bool reopenProductSurveyBackendForCommit() {
    const auto required =
        leshy1::kernel::runtime::resourceMask(Resource::UiForeground) |
        leshy1::kernel::runtime::resourceMask(Resource::EspRf) |
        leshy1::kernel::runtime::resourceMask(Resource::Storage) |
        leshy1::kernel::runtime::resourceMask(Resource::RadioSpi);
    const auto ownedResources = appRuntime.activeResources();
    char enrolledFingerprint[33] = {};
    if ((ownedResources & required) != required ||
        !exactCidFingerprint(productSurveyRuntime.expectedFingerprint) ||
        !loadProductFingerprint(enrolledFingerprint,
                                sizeof(enrolledFingerprint)) ||
        std::strcmp(enrolledFingerprint,
                    productSurveyRuntime.expectedFingerprint) != 0) {
        return false;
    }
    if (!serviceProductSurveyCommitBoundary()) return false;

    leshy1::storage::SdTransportRunResult identity;
    for (std::uint8_t attempt = 1;
         attempt <= leshy1::storage::kProductStartMaximumIdentityAttempts;
         ++attempt) {
        BoardSdSpiTransport identityTransport;
        const bool identityBegun = identityTransport.begin();
        identity = {};
        if (identityBegun) {
            leshy1::storage::SdTransportRunPolicy policy;
            policy.allowPhysical = true;
            policy.explicitlySelected = true;
            policy.identificationOnly = true;
            policy.ownedResources = ownedResources;
            identity = leshy1::storage::runSdIdentificationStateMachine(
                leshy1::storage::defaultSdIdentificationPlan(),
                identityTransport, policy);
            identityTransport.end();
        }
        if (!serviceProductSurveyCommitBoundary()) return false;
        productSurveyRuntime.identityAttempts = attempt;
        productSurveyRuntime.identityTransientRetries =
            static_cast<std::uint8_t>(attempt - 1U);
        productSurveyRuntime.identityStatus = identity.status;
        productSurveyRuntime.identityCleanupComplete =
            identityTransport.cleanupComplete();
        formatCidFingerprint(identity.identity,
                             productSurveyRuntime.observedFingerprint,
                             sizeof(productSurveyRuntime.observedFingerprint));
        if (productSurveyRuntime.identityCleanupComplete &&
            identity.status ==
                leshy1::storage::SdTransportRunStatus::Valid) {
            break;
        }
        const leshy1::storage::ProductStartIdentityRetryEvidence retryEvidence{
            true,
            true,
            true,
            (ownedResources & required) == required,
            identityTransport.physicalSpiStarted(),
            identity.status,
            std::strcmp(productSurveyRuntime.observedFingerprint,
                        "00000000000000000000000000000000") == 0,
            productSurveyRuntime.identityCleanupComplete,
            false,
        };
        if (!leshy1::storage::shouldRetryProductStartIdentity(
                retryEvidence, attempt)) {
            break;
        }
        vTaskDelay(pdMS_TO_TICKS(
            leshy1::storage::productStartIdentityRetryDelayMs(attempt)));
        if (!serviceProductSurveyCommitBoundary()) return false;
    }
    if (!productSurveyRuntime.identityCleanupComplete ||
        identity.status != leshy1::storage::SdTransportRunStatus::Valid ||
        std::strcmp(productSurveyRuntime.expectedFingerprint,
                    productSurveyRuntime.observedFingerprint) != 0) {
        return false;
    }

    productSurveyRuntime.filesystemAttempted = true;
    productSurveyRuntime.filesystemMountAttempts = 0;
    productSurveyRuntime.filesystemMountTransientRetries = 0;
    productSurveyRuntime.filesystemMountError = 0;
    productSurveyRuntime.filesystemMountLastFailureError = 0;
    productSurveyRuntime.filesystemMountStage = "idle";
    productSurveyRuntime.filesystemBusInitializeError = 0;
    productSurveyRuntime.filesystemHeapFreeBeforeBus = 0;
    productSurveyRuntime.filesystemHeapLargestBeforeBus = 0;
    productSurveyRuntime.filesystemHeapFreeBeforeVfs = 0;
    productSurveyRuntime.filesystemHeapLargestBeforeVfs = 0;
    productSurveyRuntime.filesystemDriveAvailableBeforeVfs = false;
    bool filesystemMounted = false;
    for (std::uint8_t attempt = 1;
         attempt <=
             leshy1::storage::kProductStartMaximumFilesystemAttempts;
         ++attempt) {
        productSurveyRuntime.filesystemMountAttempts = attempt;
        if (!serviceProductSurveyCommitBoundary()) return false;
        filesystemMounted = productSurveyFilesystem.begin();
        if (!serviceProductSurveyCommitBoundary()) return false;
        recordProductSurveyMountOutcome(filesystemMounted);
        productSurveyRuntime.filesystemMountError =
            productSurveyFilesystem.mountError();
        productSurveyRuntime.filesystemMountStage =
            productSurveyFilesystem.mountStageName();
        productSurveyRuntime.filesystemBusInitializeError =
            productSurveyFilesystem.busInitializeError();
        productSurveyRuntime.filesystemHeapFreeBeforeBus =
            productSurveyFilesystem.heapFreeBeforeBus();
        productSurveyRuntime.filesystemHeapLargestBeforeBus =
            productSurveyFilesystem.heapLargestBeforeBus();
        productSurveyRuntime.filesystemHeapFreeBeforeVfs =
            productSurveyFilesystem.heapFreeBeforeVfs();
        productSurveyRuntime.filesystemHeapLargestBeforeVfs =
            productSurveyFilesystem.heapLargestBeforeVfs();
        productSurveyRuntime.filesystemDriveAvailableBeforeVfs =
            productSurveyFilesystem.driveAvailableBeforeVfs();
        if (filesystemMounted) {
            break;
        }
        productSurveyRuntime.filesystemMountLastFailureError =
            productSurveyRuntime.filesystemMountError;
        // This is a new, quiescent terminal mount attempt. The earlier
        // validation open and radio windows are fully closed; policy fields
        // describe only side effects after this mount attempt began.
        const bool radioActive =
            productSurveyRuntime.sourceActive || productSurveyScanActive() ||
            !productSurveyRuntime.scannerCleanupComplete;
        leshy1::storage::ProductStartFilesystemRetryEvidence evidence;
        evidence.explicitStart = true;
        evidence.enrolled = true;
        evidence.expectedFingerprintValid =
            exactCidFingerprint(productSurveyRuntime.expectedFingerprint);
        evidence.requiredResourcesHeld =
            (ownedResources & required) == required;
        evidence.identityValid =
            identity.status == leshy1::storage::SdTransportRunStatus::Valid;
        evidence.identityCleanupComplete =
            productSurveyRuntime.identityCleanupComplete;
        evidence.observedFingerprintMatches =
            std::strcmp(productSurveyRuntime.expectedFingerprint,
                        productSurveyRuntime.observedFingerprint) == 0;
        evidence.mountAttempted = true;
        evidence.mountSucceeded = false;
        evidence.mountError = productSurveyRuntime.filesystemMountError;
        evidence.filesystemCleanupComplete =
            productSurveyFilesystem.cleanupComplete();
        evidence.filesystemStillMounted = productSurveyFilesystem.mounted();
        evidence.storeCurrentlyOpen =
            productSurveyRuntime.backendOpen ||
            productSurveyFilesystem.mounted();
        evidence.radioCurrentlyActive = radioActive;
        evidence.cancelRequested = false;
        if (!leshy1::storage::shouldRetryProductStartFilesystem(
                evidence, attempt)) {
            break;
        }
        productSurveyRuntime.filesystemMountTransientRetries = attempt;
        vTaskDelay(pdMS_TO_TICKS(
            leshy1::storage::productStartFilesystemRetryDelayMs(attempt)));
        if (!serviceProductSurveyCommitBoundary()) return false;
    }
    if (!filesystemMounted) return false;
    if (!serviceProductSurveyCommitBoundary()) return false;
    productSurveyRuntime.cardCapacityBytes =
        productSurveyFilesystem.cardCapacityBytes();
    productSurveyRuntime.cachedFreeBytes =
        productSurveyFilesystem.cachedFreeBytes();
    const bool capacityMatched =
        productSurveyRuntime.cardCapacityBytes != 0 &&
        productSurveyRuntime.cardCapacityBytes == identity.identity.capacityBytes;
    const bool rootExists = knownProductSessionRootExists(
        productSurveyRuntime.observedFingerprint);

    leshy1::storage::MediaIdentity media;
    media.present = capacityMatched;
    media.kind = leshy1::storage::MediaKind::Sd;
    media.fingerprint = productSurveyRuntime.observedFingerprint;
    media.capacityBytes = productSurveyRuntime.cardCapacityBytes;
    media.freeBytes = productSurveyRuntime.cachedFreeBytes;
    leshy1::storage::ProductStoreRequest storeRequest;
    storeRequest.operation =
        leshy1::storage::ProductStoreOperation::CommitSession;
    storeRequest.explicitlySelected = true;
    storeRequest.expectedFingerprint =
        productSurveyRuntime.expectedFingerprint;
    storeRequest.rootPath = leshy1::storage::kProductSessionStoreRoot;
    storeRequest.rootExists = rootExists;
    storeRequest.driverWriteEnabled = true;
    storeRequest.requiredBytes = kProductSurveyCommitBytes;
    storeRequest.reserveBytes = kProductSurveyReserveBytes;
    storeRequest.ownedResources = ownedResources;
    storeRequest.power = powerSafetyPolicy.writeDisposition();
    const leshy1::storage::ProductStorePermit storePermit =
        leshy1::storage::authorizeProductStore(media, storeRequest);
    productSurveyRuntime.storeStatus = storePermit.status;
    productSurveyRuntime.storeOpenAttempted = true;
    if (!serviceProductSurveyCommitBoundary()) return false;
    if (!storePermit.allowed() ||
        !productSurveyStore.selectDrive(productSurveyFilesystem.driveNumber()) ||
        !productSurveyStore.openExistingWritable(storePermit)) {
        return false;
    }
    if (!serviceProductSurveyCommitBoundary()) return false;
    surveyStoreRouter.bind(productSurveyStore);
    productSurveyRuntime.backendOpen = true;
    productSurveyRuntime.cleanupComplete = false;
    return true;
}

