anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
SurveyPipelineStatus stopProductSurvey() {
    if (!reopenProductSurveyBackendForCommit()) {
        (void)serviceProductSurveyCommitBoundary();
        const bool cleanup = closeProductSurveyBackend();
        (void)serviceProductSurveyCommitBoundary();
        productSurveyRuntime.status = cleanup
            ? "commit_backend_failed" : "cleanup_failed";
        lastRuntimeEvent = productSurveyRuntime.status;
        return SurveyPipelineStatus::WorkflowRejected;
    }
    if (!serviceProductSurveyCommitBoundary()) {
        closeProductSurveyBackend();
        return SurveyPipelineStatus::WorkflowRejected;
    }
    SurveyPipelineStatus status = surveyPipeline.stopAndCommit(
        static_cast<std::uint64_t>(esp_timer_get_time()));
    if (!serviceProductSurveyCommitBoundary()) {
        status = SurveyPipelineStatus::WorkflowRejected;
    }
    // Retain the exact terminal boundary before release/reset returns the UI
    // to Setup. HIL can therefore distinguish codec, recovery, backend and
    // workspace-lifetime failures instead of seeing only `commit_failed`.
    productSurveyRuntime.commitPipelineStatus = status;
    productSurveyRuntime.commitWorkflowStatus = surveyWorkflow.lastStatus();
    productSurveyRuntime.commitStoreStatus = surveyWorkflow.lastStoreStatus();
    productSurveyRuntime.commitWorkspaceBound = surveyWorkflow.workspaceBound();
    productSurveyRuntime.commitWorkspaceOwner = static_cast<std::uint8_t>(
        targetsStoreCodecWorkspaceOwner);
    productSurveyRuntime.commitSessionState = surveySession.state();
    productSurveyRuntime.commitSessionSize = static_cast<std::uint16_t>(
        surveySession.size());
    const bool cleanup = closeProductSurveyBackend();
    if (!serviceProductSurveyCommitBoundary()) {
        status = SurveyPipelineStatus::WorkflowRejected;
    }
    productSurveyRuntime.status =
        status == SurveyPipelineStatus::Committed
            ? (cleanup ? "committed" : "cleanup_failed")
            : (cleanup ? "commit_failed" : "cleanup_failed");
    lastRuntimeEvent = productSurveyRuntime.status;
    return cleanup ? status : SurveyPipelineStatus::WorkflowRejected;
}

void releaseProductSurveyAfterTerminal(const char* status, bool returnHome);

bool requestProductSurveyWorkerStop(bool cancel) {
    const std::uint64_t actionStartedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    const ProductSurveyWorkerControl control = productSurveyControl();
    if (control != ProductSurveyWorkerControl::Starting &&
        control != ProductSurveyWorkerControl::Running &&
        control != ProductSurveyWorkerControl::Committing) {
        return false;
    }
    const bool scanWasActive = productSurveyScanActive();
    setProductSurveyControl(
        cancel ? ProductSurveyWorkerControl::CancelRequested
               : ProductSurveyWorkerControl::StopRequested);
    if (cancel) {
        productSurveyRuntime.cancelRequestedDuringScan = scanWasActive;
    }
    productSurveyRuntime.status = cancel ? "cancelling" : "stopping";
    productSurveyRuntime.stopActionUs =
        static_cast<std::uint64_t>(esp_timer_get_time()) - actionStartedUs;
    lastRuntimeEvent = cancel ? "product_survey_cancelling"
                              : "product_survey_stopping";
    BoardWifiPassiveScanner::cancelActiveScan();
    BoardBlePassiveScanner::cancelActiveScan();
    if (productSurveyWorkerTaskHandle != nullptr) {
        xTaskNotifyGive(productSurveyWorkerTaskHandle);
    }
    return true;
}

bool requestProductSurveyWorkerPause() {
    const std::uint64_t actionStartedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (productSurveyControl() != ProductSurveyWorkerControl::Running) {
        return false;
    }
    setProductSurveyControl(ProductSurveyWorkerControl::PauseRequested);
    productSurveyRuntime.status = "pausing";
    productSurveyRuntime.stopActionUs =
        static_cast<std::uint64_t>(esp_timer_get_time()) - actionStartedUs;
    lastRuntimeEvent = "product_survey_pausing";
    BoardWifiPassiveScanner::cancelActiveScan();
    BoardBlePassiveScanner::cancelActiveScan();
    if (productSurveyWorkerTaskHandle != nullptr) {
        xTaskNotifyGive(productSurveyWorkerTaskHandle);
    }
    return true;
}

bool commitPausedProductSurvey() {
    if (productSurveyControl() != ProductSurveyWorkerControl::Paused) {
        return false;
    }
    if (!transitionProductSurveyControl(
            ProductSurveyWorkerControl::Paused,
            ProductSurveyWorkerControl::CommitRequested)) {
        return false;
    }
    productSurveyRuntime.status = "committing";
    lastRuntimeEvent = "product_survey_committing";
    if (productSurveyWorkerTaskHandle == nullptr) {
        setProductSurveyControl(ProductSurveyWorkerControl::Paused);
        productSurveyRuntime.status = "paused";
        return false;
    }
    xTaskNotifyGive(productSurveyWorkerTaskHandle);
    return true;
}

bool applyProductSurveyTimelineStatus(
    SourceTimelineStatus status, SourceTimelineStatus expected,
    const char* stage = "unspecified", std::uint64_t eventUs = 0) {
    productSurveyRuntime.timelineStatus =
        leshy1::services::survey::sourceTimelineStatusName(status);
    if (status != expected) {
        if (std::strcmp(productSurveyRuntime.timelineFailureStatus, "none") == 0) {
            productSurveyRuntime.timelineFailureStatus =
                productSurveyRuntime.timelineStatus;
            productSurveyRuntime.timelineFailureStage = stage;
            productSurveyRuntime.timelineFailureEventUs = eventUs;
            productSurveyRuntime.timelineFailureLatestUs =
                productSurveyTimeline.latestUs();
        }
        productSurveyRuntime.timelineHealthy = false;
    }
    return status == expected;
}

bool drainProductSurveyTimelineWindows() {
    leshy1::services::survey::SourceWindow window;
    while (true) {
        const SourceTimelineStatus dequeued = productSurveyTimeline.pop(&window);
        if (dequeued == SourceTimelineStatus::Empty) return true;
        if (dequeued != SourceTimelineStatus::WindowDequeued) {
            productSurveyRuntime.timelineArchiveStatus =
                leshy1::services::survey::sourceTimelineStatusName(dequeued);
            if (std::strcmp(productSurveyRuntime.timelineFailureStatus,
                            "none") == 0) {
                productSurveyRuntime.timelineFailureStatus =
                    productSurveyRuntime.timelineArchiveStatus;
                productSurveyRuntime.timelineFailureStage = "archive_pop";
                productSurveyRuntime.timelineFailureLatestUs =
                    productSurveyTimeline.latestUs();
            }
            productSurveyRuntime.timelineHealthy = false;
            return false;
        }
        const auto archived = surveySession.appendTimelineWindow(window);
        productSurveyRuntime.timelineArchiveStatus =
            leshy1::services::survey::sessionTimelineStatusName(archived);
        if (archived !=
            leshy1::services::survey::SessionTimelineStatus::Appended) {
            if (std::strcmp(productSurveyRuntime.timelineFailureStatus,
                            "none") == 0) {
                productSurveyRuntime.timelineFailureStatus =
                    productSurveyRuntime.timelineArchiveStatus;
                productSurveyRuntime.timelineFailureStage = "archive_append";
                productSurveyRuntime.timelineFailureEventUs = window.endedUs;
                productSurveyRuntime.timelineFailureLatestUs =
                    productSurveyTimeline.latestUs();
            }
            productSurveyRuntime.timelineHealthy = false;
            return false;
        }
        ++productSurveyRuntime.timelineArchivedWindows;
        window = {};
    }
}

