anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
bool recordProductSurveyTimelineDrops(RadioKind source, std::uint16_t count,
                                      std::uint64_t monotonicUs) {
    for (std::uint16_t index = 0; index < count; ++index) {
        const SourceTimelineStatus status =
            productSurveyTimeline.recordObservation(
                source, false, monotonicUs);
        if (!applyProductSurveyTimelineStatus(
                status, SourceTimelineStatus::ObservationRecorded,
                "driver_drop", monotonicUs)) {
            return false;
        }
    }
    return true;
}

bool drainProductSurveyWorkerObservations() {
    if (productSurveyObservations == nullptr ||
        surveyWorkflow.state() != SurveyWorkflowState::Running) {
        return false;
    }
    bool changed = false;
    Observation observation;
    while (xQueueReceive(productSurveyObservations, &observation, 0) == pdTRUE) {
        const Observation* selectedWifi = wifiNetworkAt(wifiNetworkSelection);
        const Observation wifiSelectionAnchor = selectedWifi == nullptr
            ? Observation{} : *selectedWifi;
        const bool wifiSelectionAnchored = selectedWifi != nullptr;
        const bool wifiCatalogChanged =
            (wifiProductView == WifiProductView::Networks ||
             wifiProductView == WifiProductView::NetworkDetail) &&
            wifiNetworkCatalog.upsert(
                observation, !wifiNetworkNavigationOrder.locked());
        if (wifiCatalogChanged && wifiSelectionAnchored &&
            !wifiNetworkNavigationOrder.locked()) {
            const std::size_t anchored =
                wifiNetworkCatalog.indexOfIdentity(wifiSelectionAnchor);
            wifiNetworkSelection = anchored < wifiNetworkCatalog.size()
                ? anchored : wifiNetworkCatalog.size() - 1U;
        }
        const Observation* selectedBle = bleDeviceAt(bleDeviceSelection);
        const Observation bleSelectionAnchor = selectedBle == nullptr
            ? Observation{} : *selectedBle;
        const bool bleSelectionAnchored = selectedBle != nullptr;
        const bool bleCatalogChanged =
            (bleProductView == BleProductView::Devices ||
             bleProductView == BleProductView::DeviceDetail) &&
            bleDeviceCatalog.upsert(
                observation, !bleDeviceNavigationOrder.locked());
        if (bleCatalogChanged && bleSelectionAnchored &&
            !bleDeviceNavigationOrder.locked()) {
            const std::size_t anchored =
                bleDeviceCatalog.indexOfIdentity(bleSelectionAnchor);
            bleDeviceSelection = anchored < bleDeviceCatalog.size()
                ? anchored : bleDeviceCatalog.size() - 1U;
        }
        const SurveyPipelineStatus queued = surveyPipeline.enqueue(observation);
        const bool accepted = queued == SurveyPipelineStatus::Queued;
        const SourceTimelineStatus timelineStatus =
            productSurveyTimeline.recordObservation(
                observation.radio, accepted, observation.monotonicUs);
        if (!applyProductSurveyTimelineStatus(
                timelineStatus, SourceTimelineStatus::ObservationRecorded,
                "observation", observation.monotonicUs)) {
            productSurveyRuntime.status = "timeline_record_failed";
            lastRuntimeEvent = productSurveyRuntime.status;
        }
        changed = queued == SurveyPipelineStatus::Queued ||
                  wifiCatalogChanged || bleCatalogChanged || changed;
        observation = {};
    }
    if (changed) {
        changed = surveyPipeline.drain(
            leshy1::services::survey::ObservationQueue::kCapacity) ==
            SurveyPipelineStatus::Drained;
    }
    return changed;
}

bool closeProductSurveyScanWindow(
    const ProductSurveyWorkerEvent& event,
    SourceWindowState nextState = SourceWindowState::Scheduled,
    SourceWindowReason nextReason = SourceWindowReason::DutyCycle) {
    if (event.scanStartedUs == 0 || event.scanEndedUs < event.scanStartedUs) {
        return true;
    }
    drainProductSurveyWorkerObservations();
    if (!productSurveyRuntime.timelineHealthy) return false;
    if (!recordProductSurveyTimelineDrops(event.source, event.scanDropped,
                                          event.scanEndedUs)) {
        return false;
    }
    const SourceTimelineStatus status = productSurveyTimeline.transition(
        event.source, nextState, nextReason, event.scanEndedUs);
    return applyProductSurveyTimelineStatus(
               status, SourceTimelineStatus::Transitioned,
               nextState == SourceWindowState::Fault
                   ? "scan_fault_close"
                   : nextState == SourceWindowState::Unavailable
                         ? "scan_unavailable_close" : "scan_close",
               event.scanEndedUs) &&
           drainProductSurveyTimelineWindows();
}

int hexNibble(char value) {
    if (value >= '0' && value <= '9') return value - '0';
    if (value >= 'a' && value <= 'f') return value - 'a' + 10;
    if (value >= 'A' && value <= 'F') return value - 'A' + 10;
    return -1;
}

CaptureMetadata productCaptureMetadata(std::uint8_t selectedSourceMask) {
    CaptureMetadata metadata;
    metadata.present = true;
    metadata.passive = true;
    metadata.selectedSourceMask = selectedSourceMask;
    const auto wifiPlan = leshy1::drivers::wifi::defaultPassivePlan();
    if ((selectedSourceMask & leshy1::services::survey::sourceMask(
            RadioKind::Wifi)) != 0) {
        metadata.wifiShowHidden = wifiPlan.showHidden;
        metadata.wifiMaxMsPerChannel = wifiPlan.maxMsPerChannel;
        metadata.wifiChannel = wifiPlan.channel;
    }
    const auto blePlan = leshy1::drivers::ble::defaultPassivePlan();
    if ((selectedSourceMask & leshy1::services::survey::sourceMask(
            RadioKind::Ble)) != 0) {
        metadata.bleDurationMs = blePlan.durationMs;
        metadata.bleIntervalMs = blePlan.intervalMs;
        metadata.bleWindowMs = blePlan.windowMs;
        metadata.bleMaximumRecords = blePlan.maximumRecords;
    }
    if (std::strlen(runningAppElfSha256) ==
        metadata.appIdentity.size() * 2U) {
        bool valid = true;
        for (std::size_t index = 0; index < metadata.appIdentity.size(); ++index) {
            const int high = hexNibble(runningAppElfSha256[index * 2U]);
            const int low = hexNibble(runningAppElfSha256[index * 2U + 1U]);
            if (high < 0 || low < 0) {
                valid = false;
                break;
            }
            metadata.appIdentity[index] = static_cast<std::uint8_t>(
                (static_cast<unsigned>(high) << 4U) |
                static_cast<unsigned>(low));
        }
        if (valid) {
            metadata.appIdentityLength = metadata.appIdentity.size();
        }
    }
    return metadata;
}

