anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void runInfraredCaptureStoreWorker(void*) {
    runPulseCaptureStoreWorker(true, infraredCaptureStoreEvents);
}

bool requestSubGhzRawCapturePersist() {
    if (!deviceLockOperationAllowed(
            leshy1::services::security::
                DeviceLockOperation::ProtectedEvidence)) {
        subGhzCapturePersistState = CapturePersistState::Failed;
        subGhzCapturePersistStatus = "device_locked";
        noteDeviceLockAdmissionBlocked();
        return true;
    }
    if (subGhzCapturePersistState != CapturePersistState::Result ||
        subGhzRawCapture.stats().state !=
            SubGhzRawCaptureState::Complete ||
        subGhzRawCapture.pulseCount() == 0) {
        return false;
    }
    if (powerSafetyPolicy.writeDisposition() ==
        PowerWriteDisposition::ProhibitedLowVoltage) {
        subGhzCapturePersistState = CapturePersistState::Failed;
        subGhzCapturePersistStatus = "power_unsafe";
        lastRuntimeEvent = "subghz_raw_store_power_unsafe";
        return true;
    }
    if (subGhzCaptureStoreEvents == nullptr ||
        subGhzCaptureStoreTaskHandle != nullptr) {
        subGhzCapturePersistState = CapturePersistState::Failed;
        subGhzCapturePersistStatus = "worker_unavailable";
        lastRuntimeEvent = "subghz_raw_store_worker_unavailable";
        return true;
    }
    const auto storageResources =
        leshy1::kernel::runtime::resourceMask(Resource::Storage);
    if (!resourceBroker.acquire(AppRuntime::kForegroundOwner,
                                storageResources)) {
        subGhzCapturePersistState = CapturePersistState::Failed;
        subGhzCapturePersistStatus = "resources_busy";
        lastRuntimeEvent = "subghz_raw_store_resources_busy";
        return true;
    }
    subGhzCapturePersistState = CapturePersistState::Saving;
    subGhzCapturePersistStatus = "saving";
    const bool started = xTaskCreatePinnedToCore(
        runSubGhzCaptureStoreWorker, "leshy-sub-store", 8192, nullptr, 1,
        &subGhzCaptureStoreTaskHandle, 0) == pdPASS;
    if (!started) {
        resourceBroker.release(AppRuntime::kForegroundOwner,
                               storageResources);
        subGhzCaptureStoreTaskHandle = nullptr;
        subGhzCapturePersistState = CapturePersistState::Failed;
        subGhzCapturePersistStatus = "worker_unavailable";
        lastRuntimeEvent = "subghz_raw_store_worker_unavailable";
    } else {
        lastRuntimeEvent = "subghz_raw_saving";
    }
    return true;
}

void serviceSubGhzRawCapturePersist() {
    if (subGhzCaptureStoreEvents == nullptr) return;
    CaptureStoreEvent event;
    if (xQueueReceive(subGhzCaptureStoreEvents, &event, 0) != pdTRUE) return;
    subGhzCaptureStoreTaskHandle = nullptr;
    resourceBroker.release(
        AppRuntime::kForegroundOwner,
        leshy1::kernel::runtime::resourceMask(Resource::Storage));
    const bool admitted = event.valid && event.cleanupComplete &&
        libraryController.replaceWithOwnedCopy(
            sessionStoreWorkspace().validationSession, librarySession,
            event.generation, SessionIntegrity::Valid, true, false);
    subGhzCapturePersistState = admitted ? CapturePersistState::Saved
                                        : CapturePersistState::Failed;
    subGhzCapturePersistStatus = admitted ? "saved" : event.status;
    subGhzCapturePersistGeneration = admitted ? event.generation : 0;
    subGhzCapturePersistHeapFreeBeforeMount = event.heapFreeBeforeMount;
    subGhzCapturePersistHeapLargestBeforeMount = event.heapLargestBeforeMount;
    subGhzCapturePersistFilesystemMountError = event.filesystemMountError;
    lastRuntimeEvent = admitted ? "subghz_raw_saved"
                                : "subghz_raw_store_failed";
    if (rfSpectrumView == RfSpectrumView::SubGhzCaptureLive) {
        renderInteractiveScreen();
    }
}

bool requestInfraredRawCapturePersist() {
    if (!deviceLockOperationAllowed(
            leshy1::services::security::
                DeviceLockOperation::ProtectedEvidence)) {
        infraredCapturePersistState = CapturePersistState::Failed;
        infraredCapturePersistStatus = "device_locked";
        noteDeviceLockAdmissionBlocked();
        return true;
    }
    if (infraredCapturePersistState != CapturePersistState::Result ||
        infraredCapture.stats().state != InfraredCaptureState::Complete ||
        infraredCapture.pulseCount() == 0) {
        return false;
    }
    if (powerSafetyPolicy.writeDisposition() ==
        PowerWriteDisposition::ProhibitedLowVoltage) {
        infraredCapturePersistState = CapturePersistState::Failed;
        infraredCapturePersistStatus = "power_unsafe";
        lastRuntimeEvent = "infrared_raw_store_power_unsafe";
        return true;
    }
    if (infraredCaptureStoreEvents == nullptr ||
        infraredCaptureStoreTaskHandle != nullptr) {
        infraredCapturePersistState = CapturePersistState::Failed;
        infraredCapturePersistStatus = "worker_unavailable";
        lastRuntimeEvent = "infrared_raw_store_worker_unavailable";
        return true;
    }
    const auto storageResources =
        leshy1::kernel::runtime::resourceMask(Resource::Storage);
    if (!resourceBroker.acquire(AppRuntime::kForegroundOwner,
                                storageResources)) {
        infraredCapturePersistState = CapturePersistState::Failed;
        infraredCapturePersistStatus = "resources_busy";
        lastRuntimeEvent = "infrared_raw_store_resources_busy";
        return true;
    }
    infraredCapturePersistState = CapturePersistState::Saving;
    infraredCapturePersistStatus = "saving";
    const bool started = xTaskCreatePinnedToCore(
        runInfraredCaptureStoreWorker, "leshy-ir-store", 8192, nullptr, 1,
        &infraredCaptureStoreTaskHandle, 0) == pdPASS;
    if (!started) {
        resourceBroker.release(AppRuntime::kForegroundOwner,
                               storageResources);
        infraredCaptureStoreTaskHandle = nullptr;
        infraredCapturePersistState = CapturePersistState::Failed;
        infraredCapturePersistStatus = "worker_unavailable";
        lastRuntimeEvent = "infrared_raw_store_worker_unavailable";
    } else {
        lastRuntimeEvent = "infrared_raw_saving";
    }
    return true;
}

