anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void serviceInfraredRawCapturePersist() {
    if (infraredCaptureStoreEvents == nullptr) return;
    CaptureStoreEvent event;
    if (xQueueReceive(infraredCaptureStoreEvents, &event, 0) != pdTRUE) return;
    infraredCaptureStoreTaskHandle = nullptr;
    resourceBroker.release(
        AppRuntime::kForegroundOwner,
        leshy1::kernel::runtime::resourceMask(Resource::Storage));
    const bool admitted = event.valid && event.cleanupComplete &&
        libraryController.replaceWithOwnedCopy(
            sessionStoreWorkspace().validationSession, librarySession,
            event.generation, SessionIntegrity::Valid, true, false);
    infraredCapturePersistState = admitted ? CapturePersistState::Saved
                                          : CapturePersistState::Failed;
    infraredCapturePersistStatus = admitted ? "saved" : event.status;
    infraredCapturePersistGeneration = admitted ? event.generation : 0;
    infraredCapturePersistHeapFreeBeforeMount = event.heapFreeBeforeMount;
    infraredCapturePersistHeapLargestBeforeMount = event.heapLargestBeforeMount;
    infraredCapturePersistFilesystemMountError = event.filesystemMountError;
    lastRuntimeEvent = admitted ? "infrared_raw_saved"
                                : "infrared_raw_store_failed";
    if (uiController.page() == 4 && captureView == CaptureView::Infrared) {
        renderInteractiveScreen();
    }
}

void releaseProductSurveyAfterTerminal(const char* status, bool returnHome) {
    if (surveyWorkflow.state() == SurveyWorkflowState::Running ||
        surveyWorkflow.state() == SurveyWorkflowState::Setup) {
        surveyPipeline.cancel();
    }
    closeProductSurveyBackend();
    productSurveyRuntime.status = productSurveyRuntime.cleanupComplete
                                      ? status
                                      : "cleanup_failed";
    lastRuntimeEvent = productSurveyRuntime.status;
    const bool returnToWifiMenu = returnHome && !uiController.isRoot() &&
        uiController.page() == 2 &&
        (wifiProductView == WifiProductView::Networks ||
         wifiProductView == WifiProductView::Visit) &&
        std::strcmp(appRuntime.activeApp(), "wifi") == 0;
    const bool returnFromBle = returnHome && !uiController.isRoot() &&
        uiController.page() == 2 &&
        bleProductView != BleProductView::None &&
        std::strcmp(appRuntime.activeApp(), "ble") == 0;
    if (returnToWifiMenu) {
        surveyPipeline.resetToSetup();
        wifiProductView = WifiProductView::Menu;
        wifiProductSelection = 0;
        lastRuntimeEvent = "wifi_menu";
    } else if (returnHome && !uiController.isRoot() &&
               uiController.page() == 2) {
        if (returnFromBle) {
            bleProductView = BleProductView::None;
            releaseBleInspectorWorkspace();
        }
        uiController.apply(UiAction::Back,
                           static_cast<std::uint8_t>(appCatalog.size()), false);
    }
    if (!returnToWifiMenu && appRuntime.running() &&
        !wifiAuthenticationSafetyCleanupActive) {
        appRuntime.stop();
    }
    setProductSurveyControl(ProductSurveyWorkerControl::Idle);
    // Mixed Field Visits compact the observation queue too. Restore the
    // ordinary Survey capacity only after every radio/store owner is terminal,
    // independently of which product page will remain visible.
    if (!appRuntime.running() && bleProductSurveyMemoryCompact &&
        !restoreBleProductSurveyMemory()) {
        productSurveyRuntime.status = "ble_memory_restore_failed";
        lastRuntimeEvent = productSurveyRuntime.status;
    }
    renderInteractiveScreen();
}

void serviceProductSurveyWorker() {
    if (productSurveyWorkerEvents == nullptr) return;
    expireWifiAuthenticationSurveyTerminalHold();
    bool render = false;
    ProductSurveyWorkerEvent event;
    while (xQueuePeek(productSurveyWorkerEvents, &event, 0) == pdTRUE) {
        const bool terminalEvent =
            event.kind == ProductSurveyWorkerEventKind::Paused ||
            event.kind == ProductSurveyWorkerEventKind::Stopped ||
            event.kind == ProductSurveyWorkerEventKind::Committed ||
            event.kind == ProductSurveyWorkerEventKind::CommitFailed ||
            event.kind == ProductSurveyWorkerEventKind::Cancelled ||
            event.kind == ProductSurveyWorkerEventKind::Failed;
        const bool deferCancelledTerminal =
            wifiAuthenticationSurveyTerminalHoldArmed &&
            event.kind == ProductSurveyWorkerEventKind::Cancelled &&
            wifiAuthenticationProductState ==
                WifiAuthenticationProductState::WaitingForSurveyStop &&
            !wifiAuthenticationReturnAfterSurveyStop;
        if (deferCancelledTerminal) break;
        if (terminalEvent && wifiAuthenticationSurveyTerminalHoldArmed) {
            clearWifiAuthenticationSurveyTerminalHold();
        }
        if (xQueueReceive(productSurveyWorkerEvents, &event, 0) != pdTRUE) {
            break;
        }
        const bool commitEvent =
            event.kind == ProductSurveyWorkerEventKind::Committed ||
            event.kind == ProductSurveyWorkerEventKind::CommitFailed;
        if (!commitEvent) {
            applyProductSurveyWorkerReport(event.report);
            productSurveyRuntime.bleBegin =
                productSurveyBleBeginDiagnosticSnapshot();
            if (event.kind != ProductSurveyWorkerEventKind::ScanStarted) {
                productSurveyRuntime.scan = event.scan;
                productSurveyRuntime.bleScan = event.bleScan;
                productSurveyRuntime.scanCycles = event.scanCycles;
                if (event.source == RadioKind::Wifi) {
                    productSurveyRuntime.wifiScanCycles = event.sourceScanCycles;
                } else {
                    productSurveyRuntime.bleScanCycles = event.sourceScanCycles;
                }
            }
        }
        if (event.kind == ProductSurveyWorkerEventKind::Committed) {
            if (event.commitStatus == SurveyPipelineStatus::Committed) {
                if (wifiProductView == WifiProductView::Visit) {
                    completeFieldSurveyVisit(surveySession);
                }
                setProductSurveyControl(ProductSurveyWorkerControl::Idle);
                render = true;
            } else {
                releaseProductSurveyAfterTerminal("commit_failed", true);
                render = false;
            }
        } else if (event.kind == ProductSurveyWorkerEventKind::CommitFailed) {
            releaseProductSurveyAfterTerminal("commit_failed", true);
            render = false;
        } else if (event.kind == ProductSurveyWorkerEventKind::Prepared) {
            std::uint64_t startedUs = event.eventUs;
            if (startedUs == 0) startedUs = 1;
            const char* sessionId = wifiProductView == WifiProductView::Visit
                ? FieldSurveyTracker::kSessionId
                : "product-passive-live";
            const SurveyPipelineStatus pipelineStarted = surveyPipeline.start(
                sessionId, startedUs);
            const CaptureMetadataStatus captureConfigured =
                pipelineStarted == SurveyPipelineStatus::Started
                    ? surveySession.configureCaptureMetadata(
                          productCaptureMetadata(
                              productSurveyRuntime.selectedSourceMask))
                    : CaptureMetadataStatus::InvalidState;
            const SourceTimelineStatus timelineStarted =
                pipelineStarted == SurveyPipelineStatus::Started &&
                        captureConfigured == CaptureMetadataStatus::Configured
                    ? productSurveyTimeline.start(
                          productSurveyRuntime.selectedSourceMask, startedUs)
                    : SourceTimelineStatus::InvalidState;
            const auto archiveStarted =
                pipelineStarted == SurveyPipelineStatus::Started &&
                        timelineStarted == SourceTimelineStatus::Started
                    ? surveySession.startTimeline(
                          productSurveyRuntime.selectedSourceMask, startedUs)
                    : leshy1::services::survey::SessionTimelineStatus::NotRunning;
            productSurveyRuntime.timelineArchiveStatus =
                leshy1::services::survey::sessionTimelineStatusName(
                    archiveStarted);
            bool degradationRecorded = true;
            if (pipelineStarted == SurveyPipelineStatus::Started &&
                timelineStarted == SourceTimelineStatus::Started &&
                archiveStarted ==
                    leshy1::services::survey::SessionTimelineStatus::Started) {
                for (const RadioKind source :
                     std::array<RadioKind, 2>{RadioKind::Wifi, RadioKind::Ble}) {
                    if ((event.report.unavailableSourceMask &
                         leshy1::services::survey::sourceMask(source)) == 0) {
                        continue;
                    }
                    const SourceTimelineStatus unavailable =
                        productSurveyTimeline.transition(
                            source, SourceWindowState::Unavailable,
                            SourceWindowReason::DriverUnavailable, startedUs);
                    if (!applyProductSurveyTimelineStatus(
                            unavailable, SourceTimelineStatus::Transitioned,
                            "initial_unavailable", startedUs) ||
                        !drainProductSurveyTimelineWindows()) {
                        degradationRecorded = false;
                        break;
                    }
                }
            }
            if (pipelineStarted != SurveyPipelineStatus::Started ||
                captureConfigured != CaptureMetadataStatus::Configured ||
                !applyProductSurveyTimelineStatus(
                    timelineStarted, SourceTimelineStatus::Started,
                    "timeline_start", startedUs) ||
                archiveStarted !=
                    leshy1::services::survey::SessionTimelineStatus::Started ||
                !degradationRecorded) {
                productSurveyTimeline.reset();
                requestProductSurveyWorkerStop(true);
                productSurveyRuntime.status = "workflow_start_failed";
            } else {
                productSurveyRuntime.status = "running";
                productSurveyRuntime.sourceActive = true;
                lastRuntimeEvent = "product_survey_running";
            }
            render = true;
        } else if (event.kind ==
                   ProductSurveyWorkerEventKind::ScanStarted) {
            const SourceTimelineStatus status =
                productSurveyTimeline.transition(
                    event.source, SourceWindowState::Active,
                    SourceWindowReason::None, event.scanStartedUs);
            const bool scanStartReady = applyProductSurveyTimelineStatus(
                    status, SourceTimelineStatus::Transitioned,
                    "scan_start", event.scanStartedUs) &&
                drainProductSurveyTimelineWindows();
            if (!scanStartReady) {
                productSurveyRuntime.status = "timeline_start_failed";
                lastRuntimeEvent = productSurveyRuntime.status;
                requestProductSurveyWorkerStop(true);
            }
            xSemaphoreGive(productSurveyScanStartGate);
        } else if (event.kind == ProductSurveyWorkerEventKind::Scan) {
            if (closeProductSurveyScanWindow(event)) {
                productSurveyRuntime.status =
                    event.report.unavailableSourceMask == 0
                        ? "running" : "running_degraded";
                productSurveyRuntime.sourceActive = true;
                lastRuntimeEvent =
                    event.report.unavailableSourceMask == 0
                        ? "product_survey_scan"
                        : "product_survey_scan_degraded";
            } else {
                productSurveyRuntime.status = "timeline_close_failed";
                lastRuntimeEvent = productSurveyRuntime.status;
                requestProductSurveyWorkerStop(true);
            }
            render = true;
        } else if (event.kind ==
                   ProductSurveyWorkerEventKind::SourceUnavailable) {
            const bool terminalSourceUnavailable =
                event.report.activeSourceMask == 0 &&
                event.report.admissionStatus ==
                    leshy1::apps::survey::ProductSurveyAdmissionStatus::
                        SourceUnavailable;
            if (closeProductSurveyScanWindow(
                    event, event.failureState, event.failureReason)) {
                productSurveyRuntime.status = "running_degraded";
                productSurveyRuntime.sourceActive =
                    event.report.activeSourceMask != 0;
                lastRuntimeEvent = "product_survey_source_degraded";
            } else {
                productSurveyRuntime.status = "timeline_degrade_failed";
                lastRuntimeEvent = productSurveyRuntime.status;
                requestProductSurveyWorkerStop(true);
            }
            // A sole-source failure is followed by its terminal Failed event.
            // Keep the current page but skip this transient running_degraded
            // frame; terminal release renders the honest unavailable state
            // exactly once. Multi-source degradation remains incremental.
            render = !terminalSourceUnavailable;
        } else if (event.kind == ProductSurveyWorkerEventKind::Paused) {
            const bool windowClosed = closeProductSurveyScanWindow(event);
            productSurveyRuntime.sourceActive = false;
            const SourceTimelineStatus timelineStopped = windowClosed
                ? productSurveyTimeline.stop(event.eventUs)
                : SourceTimelineStatus::InvalidState;
            const bool sourceStopped = windowClosed &&
                applyProductSurveyTimelineStatus(
                    timelineStopped, SourceTimelineStatus::Stopped,
                    "timeline_pause", event.eventUs) &&
                drainProductSurveyTimelineWindows();
            const auto* wifi = productSurveyTimeline.source(RadioKind::Wifi);
            const auto* ble = productSurveyTimeline.source(RadioKind::Ble);
            const auto archiveFinalized =
                sourceStopped && wifi != nullptr && ble != nullptr
                    ? surveySession.finalizeTimeline(
                          event.eventUs, *wifi, *ble,
                          productSurveyTimeline.overflowEvents())
                    : leshy1::services::survey::SessionTimelineStatus::InvalidSummary;
            productSurveyRuntime.timelineArchiveStatus =
                leshy1::services::survey::sessionTimelineStatusName(
                    archiveFinalized);
            if (sourceStopped &&
                archiveFinalized ==
                    leshy1::services::survey::SessionTimelineStatus::Finalized) {
                productSurveyRuntime.status = "paused";
                lastRuntimeEvent = "product_survey_paused";
                setProductSurveyControl(ProductSurveyWorkerControl::Paused);
                render = true;
            } else {
                releaseProductSurveyAfterTerminal("pause_failed", true);
                render = false;
            }
        } else if (event.kind == ProductSurveyWorkerEventKind::Stopped) {
            const bool windowClosed = closeProductSurveyScanWindow(event);
            productSurveyRuntime.sourceActive = false;
            const SourceTimelineStatus timelineStopped = windowClosed
                ? productSurveyTimeline.stop(event.eventUs)
                : SourceTimelineStatus::InvalidState;
            const bool sourceStopped = windowClosed &&
                applyProductSurveyTimelineStatus(
                    timelineStopped, SourceTimelineStatus::Stopped,
                    "timeline_stop", event.eventUs) &&
                drainProductSurveyTimelineWindows();
            const auto* wifi = productSurveyTimeline.source(RadioKind::Wifi);
            const auto* ble = productSurveyTimeline.source(RadioKind::Ble);
            const auto archiveFinalized =
                sourceStopped && wifi != nullptr && ble != nullptr
                    ? surveySession.finalizeTimeline(
                          event.eventUs, *wifi, *ble,
                          productSurveyTimeline.overflowEvents())
                    : leshy1::services::survey::SessionTimelineStatus::InvalidSummary;
            productSurveyRuntime.timelineArchiveStatus =
                leshy1::services::survey::sessionTimelineStatusName(
                    archiveFinalized);
            const bool timelineComplete = sourceStopped &&
                archiveFinalized ==
                    leshy1::services::survey::SessionTimelineStatus::Finalized;
            if (!timelineComplete) {
                releaseProductSurveyAfterTerminal("commit_failed", true);
                render = false;
            } else {
                setProductSurveyControl(ProductSurveyWorkerControl::Paused);
                if (!commitPausedProductSurvey()) {
                    releaseProductSurveyAfterTerminal("commit_failed", true);
                    render = false;
                } else {
                    render = true;
                }
            }
        } else if (event.kind == ProductSurveyWorkerEventKind::Cancelled) {
            const bool windowClosed = closeProductSurveyScanWindow(event);
            const SourceTimelineStatus cancelled =
                productSurveyTimeline.state() == SourceTimelineState::Running
                    ? productSurveyTimeline.cancel(event.eventUs)
                    : SourceTimelineStatus::Cancelled;
            const bool timelineCancelled = windowClosed &&
                (cancelled == SourceTimelineStatus::Cancelled);
            applyProductSurveyTimelineStatus(
                cancelled, SourceTimelineStatus::Cancelled,
                "timeline_cancel", event.eventUs);
            const bool authenticationPending =
                wifiProductView == WifiProductView::AuthenticationCapture &&
                wifiAuthenticationProductState ==
                    WifiAuthenticationProductState::WaitingForSurveyStop;
            const bool bleGattPending =
                bleProductView == BleProductView::InspectorGatt &&
                bleGattWaitingForSurveyStop;
            if (bleGattPending) {
                if (surveyWorkflow.state() ==
                        SurveyWorkflowState::Running ||
                    surveyWorkflow.state() == SurveyWorkflowState::Setup) {
                    surveyPipeline.cancel();
                }
                const bool sourceInactive =
                    !productSurveyRuntime.sourceActive;
                const bool backendCleanup = closeProductSurveyBackend();
                const WorkerDeadlineSnapshot worker =
                    workerDeadlineSnapshot();
                const bool surveyQuiescent = timelineCancelled &&
                    backendCleanup &&
                    productSurveyRuntime.scannerCleanupComplete &&
                    productSurveyRuntime.cleanupComplete &&
                    sourceInactive && !worker.armed;
                if (surveyQuiescent) {
                    productSurveyRuntime.sourceActive = false;
                    setProductSurveyControl(
                        ProductSurveyWorkerControl::Idle);
                    surveyPipeline.resetToSetup();
                    productSurveyTimeline.reset();
                }
                if (!surveyQuiescent || !beginBleGattAfterSurvey()) {
                    bleGattWaitingForSurveyStop = false;
                    productSurveyRuntime.status = surveyQuiescent
                        ? "ble_gatt_start_failed"
                        : "ble_gatt_survey_cleanup_failed";
                    lastRuntimeEvent = productSurveyRuntime.status;
                }
                render = true;
            } else if (!authenticationPending) {
                // Preserve the ordinary product-survey cancellation path.
                releaseProductSurveyAfterTerminal(
                    timelineCancelled ? "cancelled"
                                      : "timeline_cancel_failed",
                    true);
                render = false;
            } else {
                if (surveyWorkflow.state() ==
                        SurveyWorkflowState::Running ||
                    surveyWorkflow.state() == SurveyWorkflowState::Setup) {
                    surveyPipeline.cancel();
                }
                const bool sourceInactive =
                    !productSurveyRuntime.sourceActive;
                const bool backendCleanup = closeProductSurveyBackend();
                const WorkerDeadlineSnapshot worker =
                    workerDeadlineSnapshot();
                const bool surveyQuiescent = timelineCancelled &&
                    backendCleanup &&
                    productSurveyRuntime.scannerCleanupComplete &&
                    productSurveyRuntime.cleanupComplete &&
                    sourceInactive && !worker.armed;
                // Do not advertise an idle survey or discard its terminal
                // timeline until every owned backend and worker is proven
                // quiescent. A failed teardown must remain visible and must
                // continue to block a new capture instead of turning Back into
                // an escape hatch from an active receiver.
                if (surveyQuiescent) {
                    productSurveyRuntime.sourceActive = false;
                    setProductSurveyControl(ProductSurveyWorkerControl::Idle);
                    surveyPipeline.resetToSetup();
                    productSurveyTimeline.reset();
                }
                if (wifiAuthenticationReturnAfterSurveyStop) {
                    wifiAuthenticationReturnAfterSurveyStop = false;
                    if (surveyQuiescent) {
                        std::memset(&wifiAuthenticationReport, 0,
                                    sizeof(wifiAuthenticationReport));
                        wifiAuthenticationTarget = {};
                        wifiAuthenticationProductState =
                            WifiAuthenticationProductState::Idle;
                        wifiProductView = WifiProductView::Menu;
                        wifiProductSelection = 0;
                        productSurveyRuntime.status =
                            "cancelled_for_authentication_back";
                    } else {
                        wifiAuthenticationProductState =
                            WifiAuthenticationProductState::Failed;
                        wifiAuthenticationFailure =
                            WifiAuthenticationCaptureUiFailure::
                                ResultBeforeCleanup;
                        productSurveyRuntime.status =
                            "authentication_survey_cleanup_failed";
                    }
                    lastRuntimeEvent = productSurveyRuntime.status;
                } else if (!surveyQuiescent ||
                           !beginWifiAuthenticationCaptureAfterSurvey()) {
                    wifiAuthenticationProductState =
                        WifiAuthenticationProductState::Failed;
                    wifiAuthenticationFailure = surveyQuiescent
                        ? WifiAuthenticationCaptureUiFailure::StartFailed
                        : WifiAuthenticationCaptureUiFailure::
                              ResultBeforeCleanup;
                    productSurveyRuntime.status = surveyQuiescent
                        ? "authentication_capture_start_failed"
                        : "authentication_survey_cleanup_failed";
                    lastRuntimeEvent = productSurveyRuntime.status;
                }
                render = true;
