anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
            }
        } else {
            const bool windowClosed = closeProductSurveyScanWindow(
                event, SourceWindowState::Fault,
                SourceWindowReason::DriverFault);
            if (!windowClosed) event.report.status = "timeline_fault_failed";
            if (productSurveyTimeline.state() == SourceTimelineState::Running) {
                const SourceTimelineStatus cancelled =
                    productSurveyTimeline.cancel(event.eventUs);
                applyProductSurveyTimelineStatus(
                    cancelled, SourceTimelineStatus::Cancelled,
                    "timeline_failure_cancel", event.eventUs);
            }
            const bool keepVisible = event.report.admissionStatus ==
                leshy1::apps::survey::ProductSurveyAdmissionStatus::SourceUnavailable;
            releaseProductSurveyAfterTerminal(event.report.status, !keepVisible);
            // releaseProductSurveyAfterTerminal() renders exactly once after
            // applying the terminal status and route decision. Do not queue a
            // second incremental repaint here: it adds flicker and can obscure
            // the unavailable-state transition with stale content.
            render = false;
        }
    }
    if (drainProductSurveyWorkerObservations()) render = true;
    // Detail views keep receiving passive samples. renderSelectionDelta()
    // confines routine changes to their radar cards and repaints static facts
    // only when a later advertisement actually enriches them.
    if (render) {
        productSurveyIncrementalRefreshPending = true;
        renderInteractiveScreen(false);
        productSurveyIncrementalRefreshPending = false;
    }
}

void recoverProductCatalogForFingerprint(const char* expectedFingerprint,
                                         bool enrollmentPresent) {
    productBootRecovery = {};
    productBootRecovery.status = "invalid_enrollment";
    productBootRecovery.cleanupComplete = true;
    productBootRecovery.enrolled = enrollmentPresent;
    if (!exactCidFingerprint(expectedFingerprint)) return;
    std::snprintf(productBootRecovery.expectedFingerprint,
                  sizeof(productBootRecovery.expectedFingerprint), "%s",
                  expectedFingerprint);

    const bool resourcesAcquired = resourceBroker.acquire(
        kBootCatalogOwner, leshy1::storage::kSdIdentificationResources);
    productBootRecovery.ownedDuring = resourceBroker.ownedBy(kBootCatalogOwner);
    if (!resourcesAcquired) {
        productBootRecovery.status = "resources_unavailable";
        productBootRecovery.cleanupComplete = true;
        return;
    }

    BoardSdSpiTransport identityTransport;
    const bool identityBegun = identityTransport.begin();
    leshy1::storage::SdTransportRunResult identity;
    if (identityBegun) {
        leshy1::storage::SdTransportRunPolicy policy;
        policy.allowPhysical = true;
        policy.explicitlySelected = true;
        policy.identificationOnly = true;
        policy.ownedResources = productBootRecovery.ownedDuring;
        identity = leshy1::storage::runSdIdentificationStateMachine(
            leshy1::storage::defaultSdIdentificationPlan(), identityTransport,
            policy);
        identityTransport.end();
    }
    const bool identityCleanup = identityTransport.cleanupComplete();
    formatCidFingerprint(identity.identity,
                         productBootRecovery.observedFingerprint,
                         sizeof(productBootRecovery.observedFingerprint));
    productBootRecovery.fingerprintMatched =
        identity.status == leshy1::storage::SdTransportRunStatus::Valid &&
        std::strcmp(productBootRecovery.observedFingerprint,
                    productBootRecovery.expectedFingerprint) == 0;

    BoardSdFilesystem filesystem;
    const bool mounted = productBootRecovery.fingerprintMatched &&
                         filesystem.beginReadOnly();
    productBootRecovery.mountedReadOnly = mounted;
    productBootRecovery.readOnlyGuaranteed =
        mounted && filesystem.readOnlyGuaranteed();
    const std::uint64_t cardCapacity =
        mounted ? filesystem.cardCapacityBytes() : 0;
    productBootRecovery.cardCapacityBytes = cardCapacity;
    productBootRecovery.cachedFreeBytes =
        mounted ? filesystem.cachedFreeBytes() : 0;
    const bool capacityMatched = mounted &&
        cardCapacity != 0 && cardCapacity == identity.identity.capacityBytes;
    productBootRecovery.rootExists = mounted && filesystem.exists(
        leshy1::storage::kProductSessionStoreRoot);

    leshy1::storage::MediaIdentity media;
    media.present = capacityMatched;
    media.kind = leshy1::storage::MediaKind::Sd;
    media.fingerprint = productBootRecovery.observedFingerprint;
    media.capacityBytes = cardCapacity;
    // Recovery never writes, so it does not need an O(media-size) free-space
    // scan. Zero is valid geometry and keeps cold boot bounded.
    media.freeBytes = 0;
    leshy1::storage::ProductStoreRequest request;
    request.operation = leshy1::storage::ProductStoreOperation::RecoverCatalog;
    request.expectedFingerprint = productBootRecovery.expectedFingerprint;
    request.rootPath = leshy1::storage::kProductSessionStoreRoot;
    request.rootExists = productBootRecovery.rootExists;
    request.driverReadOnlyGuaranteed =
        productBootRecovery.readOnlyGuaranteed;
    request.ownedResources = productBootRecovery.ownedDuring;
    const leshy1::storage::ProductStorePermit permit =
        leshy1::storage::authorizeProductStore(media, request);
    productBootRecovery.permitStatus = permit.status;

    if (permit.allowed()) {
        ArduinoFsSessionStoreIo io(filesystem.driveNumber(),
                                   sdSessionStoreIoWorkspace, nullptr,
                                   &protectedDataCipher, &deviceLock);
        productBootRecovery.opened = io.openExistingReadOnly(permit);
        if (productBootRecovery.opened) {
            productBootRecovery.catalog = sessionCatalog.recoverLatest(
                io, sessionStoreWorkspace(), librarySession, libraryController,
                true, false);
            productBootRecovery.catalogAdmitted =
                productBootRecovery.catalog.admitted();
        }
        io.end();
    }
    productBootRecovery.blockedWriteAttempts =
        filesystem.blockedWriteAttempts();
    if (productBootRecovery.fingerprintMatched) filesystem.end();
    const bool filesystemCleanup =
        !productBootRecovery.fingerprintMatched || filesystem.cleanupComplete();
    resourceBroker.releaseAll(kBootCatalogOwner);
    productBootRecovery.ownedAfter = resourceBroker.ownedBy(kBootCatalogOwner);
    productBootRecovery.cleanupComplete = identityCleanup && filesystemCleanup &&
        productBootRecovery.ownedAfter == 0 &&
        productBootRecovery.blockedWriteAttempts == 0;

