anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    if (!identityBegun || identity.status !=
                              leshy1::storage::SdTransportRunStatus::Valid) {
        productBootRecovery.status = "identity_failed";
    } else if (!productBootRecovery.fingerprintMatched) {
        productBootRecovery.status = "fingerprint_mismatch";
    } else if (!mounted || !productBootRecovery.readOnlyGuaranteed) {
        productBootRecovery.status = "readonly_mount_failed";
    } else if (!permit.allowed()) {
        productBootRecovery.status =
            leshy1::storage::productStoreAccessStatusName(permit.status);
    } else if (!productBootRecovery.opened) {
        productBootRecovery.status = "open_failed";
    } else if (productBootRecovery.catalogAdmitted) {
        productBootRecovery.status = "admitted";
        libraryDemoReady = true;
    } else {
        productBootRecovery.status =
            leshy1::apps::library::sessionCatalogStatusName(
                productBootRecovery.catalog.status);
    }
    if (!productBootRecovery.cleanupComplete) {
        productBootRecovery.status = "cleanup_failed";
    }
}

bool handleWebCompanionRequest(
    char* request, std::size_t requestLength, char* response,
    std::size_t responseCapacity, std::size_t* responseLength,
    void* context);

bool webCompanionTargetsSuspended() {
    return webCompanionCatalog != nullptr &&
        webCompanionDecisions != nullptr && webCompanionMerges != nullptr &&
        webCompanionComparison != nullptr;
}

bool suspendTargetsForWebCompanion() {
    if (webCompanionTargetsSuspended()) return true;
    if (targetsProductRuntime == nullptr ||
        std::strcmp(targetsProductStatus, "ready") != 0) {
        return false;
    }
    const auto* selected = targetsProductRuntime->controller.selectedTarget();
    webCompanionSelectedTargetId = selected == nullptr
        ? TargetId{} : selected->id;
    webCompanionHeapBeforeSuspend = static_cast<std::uint32_t>(
        heap_caps_get_free_size(MALLOC_CAP_8BIT));
    if (!targetsProductRuntime->detachForWeb(
            &webCompanionCatalog, &webCompanionDecisions,
            &webCompanionMerges, &webCompanionComparison)) {
        return false;
    }
    delete targetsProductRuntime;
    targetsProductRuntime = nullptr;
    targetsProductStatus = "web_suspended";
    webCompanionHeapAfterSuspend = static_cast<std::uint32_t>(
        heap_caps_get_free_size(MALLOC_CAP_8BIT));
    return true;
}

bool restoreTargetsAfterWebCompanion();

void discardSuspendedWebCompanionTargets() {
    delete webCompanionComparison;
    delete webCompanionMerges;
    delete webCompanionDecisions;
    delete webCompanionCatalog;
    webCompanionComparison = nullptr;
    webCompanionMerges = nullptr;
    webCompanionDecisions = nullptr;
    webCompanionCatalog = nullptr;
}

void stopWebCompanion(
    leshy1::services::companion::CompanionLocalStopReason reason,
    bool leaveOverlay = false, bool restoreTargets = true) {
    arduinoCompanionWebService.stop();
    if (webCompanionConnectivity.authorized()) {
        webCompanionConnectivity.revoke(reason);
    }
    webCompanionCredentials.clear();
    clearWebCompanionHilEntropy();
    webCompanionConnection = {};
    if (webCompanionMutation.state !=
        leshy1::services::companion::CompanionMutationState::Saving) {
        webCompanionMutation = {};
    }
    resourceBroker.release(
        AppRuntime::kForegroundOwner,
        leshy1::kernel::runtime::resourceMask(Resource::EspRf));
    // Keep the mutually exclusive survey worker unloaded while the heavy
    // Targets foreground remains open. releaseTargetsProduct() restores it
    // after that foreground graph has been freed, avoiding fragmented-heap
    // failure without hiding or dropping any survey state.
    if (restoreTargets) restoreTargetsAfterWebCompanion();
    if (!leaveOverlay) webCompanionOverlay = false;
}

bool startWebCompanion() {
    namespace companion = leshy1::services::companion;
    if (!webCompanionOverlay || uiController.page() != 7 ||
        targetsProductRuntime == nullptr ||
        std::strcmp(targetsProductStatus, "ready") != 0 ||
        safetySupervisor.latched() || arduinoCompanionWebService.active() ||
        webCompanionConnectivity.authorized()) {
        return false;
    }
    const auto espRf =
        leshy1::kernel::runtime::resourceMask(Resource::EspRf);
    if (!resourceBroker.acquire(AppRuntime::kForegroundOwner, espRf)) {
        lastRuntimeEvent = "companion_web_resource_busy";
        return false;
    }
    if (!suspendTargetsForWebCompanion()) {
        resourceBroker.release(AppRuntime::kForegroundOwner, espRf);
        lastRuntimeEvent = "companion_web_suspend_failed";
        return false;
    }
    if (!suspendProductSurveyWorkerForWebCompanion()) {
        stopWebCompanion(companion::CompanionLocalStopReason::StartFailed,
                         true);
        lastRuntimeEvent = "companion_web_survey_worker_suspend_failed";
        return false;
    }
    // TCP/IP is deliberately initialized only after the second explicit
    // confirmation. Keeping it alive from boot consumes enough internal heap
    // to prevent the bounded Targets workspace from opening on non-PSRAM DIVs.
    if (!arduinoCompanionWebService.prepareNetworkCore()) {
        stopWebCompanion(companion::CompanionLocalStopReason::StartFailed,
                         true);
        lastRuntimeEvent = "companion_web_network_core_failed";
        return false;
    }
    std::array<std::uint8_t, 6> mac{};
    std::array<std::uint8_t, 16> entropy{};
    esp_read_mac(mac.data(), ESP_MAC_WIFI_SOFTAP);
    if (webCompanionHilEntropyPresent) {
        entropy = webCompanionHilEntropy;
    } else {
        esp_fill_random(entropy.data(), entropy.size());
    }
    clearWebCompanionHilEntropy();
    const bool credentialsReady = companion::makeCompanionLocalCredentials(
        mac, entropy, &webCompanionCredentials);
    clearWebCompanionEntropy(entropy);
    if (!credentialsReady) {
        stopWebCompanion(companion::CompanionLocalStopReason::StartFailed,
                         true);
        lastRuntimeEvent = "companion_web_credentials_failed";
        return false;
    }
    ++webCompanionGeneration;
    if (webCompanionGeneration == 0) ++webCompanionGeneration;
    std::uint64_t nowUs = static_cast<std::uint64_t>(esp_timer_get_time());
    if (nowUs == 0) nowUs = 1;
    if (!arduinoCompanionWebService.begin(webCompanionCredentials) ||
        !webCompanionConnectivity.authorize(nowUs,
                                             webCompanionGeneration)) {
        stopWebCompanion(companion::CompanionLocalStopReason::StartFailed,
                         true);
        lastRuntimeEvent = "companion_web_start_failed";
        return false;
    }
    webCompanionConnection = {};
    webCompanionMutation = {};
    lastRuntimeEvent = "companion_web_started";
    return true;
}

bool serviceWebCompanion() {
    namespace companion = leshy1::services::companion;
    const bool active = arduinoCompanionWebService.active() ||
        webCompanionConnectivity.authorized();
    if (!active) return false;
    if (safetySupervisor.latched()) {
        stopWebCompanion(companion::CompanionLocalStopReason::SafetyStop);
        return true;
    }
    // A confirmed Web mutation temporarily detaches the live Target graph
    // while its atomic worker saves. Keep only that exact authorized Web
    // session alive so the caller can observe the terminal mutation status.
    const bool savingAuthorizedWebMutation =
        targetsMutationState == TargetsMutationState::Saving &&
        targetsMutationCompanion && targetsMutationCompanionWeb &&
        webCompanionMutation.state ==
            companion::CompanionMutationState::Saving;
    if (!webCompanionOverlay || uiController.page() != 7 ||
        (!savingAuthorizedWebMutation &&
         !webCompanionTargetsSuspended() &&
         (targetsProductRuntime == nullptr ||
          std::strcmp(targetsProductStatus, "ready") != 0))) {
        stopWebCompanion(
            companion::CompanionLocalStopReason::LeftForeground);
        return true;
    }
    std::uint64_t nowUs = static_cast<std::uint64_t>(esp_timer_get_time());
    if (nowUs == 0) nowUs = 1;
    if (webCompanionConnectivity.service(nowUs)) {
        const auto reason = webCompanionConnectivity.stopReason();
        stopWebCompanion(reason, true);
        lastRuntimeEvent = companion::companionLocalStopReasonName(reason);
        return true;
    }
    const bool handled = arduinoCompanionWebService.poll(
        nowUs, webCompanionConnectivity.authorized(),
        handleWebCompanionRequest, nullptr);
    if (handled) {
        webCompanionConnectivity.recordActivity(
            nowUs, webCompanionGeneration);
    }
    return false;
}

