anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void releaseTargetsProduct() {
    // A companion grant is bound to this exact foreground snapshot. Leaving
    // Targets invalidates it; a later Targets instance requires a new connect.
    stopWebCompanion(
        leshy1::services::companion::CompanionLocalStopReason::
            LeftForeground, false, false);
    discardSuspendedWebCompanionTargets();
    usbCompanionConnection = {};
    usbCompanionMutation = {};
    delete targetsProductRuntime;
    targetsProductRuntime = nullptr;
    if (!restoreProductSurveyWorkerAfterWebCompanion()) {
        lastRuntimeEvent = "companion_web_survey_worker_restore_failed";
    }
    targetsHeapFreeAfter = static_cast<std::uint32_t>(
        heap_caps_get_free_size(MALLOC_CAP_8BIT));
    targetsProductStatus = "not_loaded";
}

bool finishTargetsProductAllocation(TargetCatalog* catalog,
                                    CorrelationDecisionLog* decisions,
                                    TargetMergeHistory* merges,
                                    bool deleteStateOnFailure) {
    auto* correlations = new (std::nothrow)
        leshy1::services::targets::SessionCorrelationProposalSet();
    auto* comparison = new (std::nothrow)
        leshy1::domain::targets::TargetComparisonResult();
    auto* workspace = catalog == nullptr || decisions == nullptr ||
            merges == nullptr ||
            correlations == nullptr || comparison == nullptr
        ? nullptr
        : new (std::nothrow) TargetsWorkspace(
              *catalog, *decisions, *correlations, *comparison);
    auto* controller = workspace == nullptr ? nullptr
        : new (std::nothrow) TargetsController(*workspace);
    targetsProductRuntime = controller == nullptr ? nullptr
        : new (std::nothrow) TargetsProductRuntime(
              catalog, decisions, merges, correlations, comparison, workspace,
              controller);
    if (targetsProductRuntime != nullptr) return true;
    delete controller;
    delete workspace;
    delete comparison;
    delete correlations;
    if (deleteStateOnFailure) {
        delete merges;
        delete decisions;
        delete catalog;
    }
    targetsProductStatus = "workspace_unavailable";
    lastRuntimeEvent = targetsProductStatus;
    return false;
}

bool allocateTargetsProduct() {
    targetsHeapFreeBefore = static_cast<std::uint32_t>(
        heap_caps_get_free_size(MALLOC_CAP_8BIT));
    auto* catalog = new (std::nothrow) TargetCatalog();
    auto* decisions = new (std::nothrow) CorrelationDecisionLog();
    auto* merges = new (std::nothrow) TargetMergeHistory();
    if (catalog == nullptr || decisions == nullptr || merges == nullptr) {
        delete merges;
        delete decisions;
        delete catalog;
        targetsProductStatus = "workspace_unavailable";
        lastRuntimeEvent = targetsProductStatus;
        return false;
    }
    return finishTargetsProductAllocation(catalog, decisions, merges, true);
}

bool adoptTargetsProductState(TargetCatalog*& catalog,
                              CorrelationDecisionLog*& decisions,
                              TargetMergeHistory*& merges) {
    if (catalog == nullptr || decisions == nullptr || merges == nullptr) {
        return false;
    }
    targetsHeapFreeBefore = static_cast<std::uint32_t>(
        heap_caps_get_free_size(MALLOC_CAP_8BIT));
    if (!finishTargetsProductAllocation(catalog, decisions, merges, false)) {
        return false;
    }
    // The runtime destructor now owns all three recovered fixed-capacity
    // state blocks.
    // Clearing the worker hand-off pointers prevents a second delete and,
    // more importantly, avoids allocating duplicate 11,272-byte state blocks
    // while the just-exited worker task stack still awaits idle-task cleanup.
    catalog = nullptr;
    decisions = nullptr;
    merges = nullptr;
    return true;
}

bool detachTargetsProductState(TargetCatalog*& catalog,
                               CorrelationDecisionLog*& decisions,
                               TargetMergeHistory*& merges) {
    if (targetsProductRuntime == nullptr ||
        !targetsProductRuntime->detachState(&catalog, &decisions, &merges)) {
        return false;
    }
    delete targetsProductRuntime;
    targetsProductRuntime = nullptr;
    targetsHeapFreeAfter = static_cast<std::uint32_t>(
        heap_caps_get_free_size(MALLOC_CAP_8BIT));
    targetsProductStatus = "not_loaded";
    return true;
}

TargetsLoadStatus loadBoundTargetsProduct(
    TargetsController& controller, const TargetCatalog* persisted = nullptr,
    const CorrelationDecisionLog* decisions = nullptr) {
    auto* scratch = acquireTargetsAdmissionScratch();
    if (scratch == nullptr) return TargetsLoadStatus::AdmissionRejected;
    const TargetsLoadStatus loaded = controller.loadWithAdmissionScratch(
        targetsComparisonLoaded ? targetsBaselineBinding
                                : TargetProductBinding{},
        targetsCurrentBinding, targetsComparisonLoaded, *scratch,
        persisted, decisions);
    releaseTargetsAdmissionScratch(scratch);
    return loaded;
}

class TargetsLoadWatchdogScope final {
public:
    TargetsLoadWatchdogScope() {
        targetsLoadElapsedUs = 0;
        targetsLoadMaximumPhaseUs = 0;
        targetsLoadWatchdogFeeds = 0;
        startedUs_ = static_cast<std::uint64_t>(esp_timer_get_time());
        lastCheckpointUs_ = startedUs_;
        checkpoint();
    }

    ~TargetsLoadWatchdogScope() {
        checkpoint();
        const std::uint64_t finishedUs =
            static_cast<std::uint64_t>(esp_timer_get_time());
        targetsLoadElapsedUs = finishedUs >= startedUs_
            ? finishedUs - startedUs_ : 0;
    }

    void checkpoint() {
        const std::uint64_t nowUs =
            static_cast<std::uint64_t>(esp_timer_get_time());
        const std::uint64_t phaseUs = nowUs >= lastCheckpointUs_
            ? nowUs - lastCheckpointUs_ : 0;
        if (phaseUs > targetsLoadMaximumPhaseUs) {
            targetsLoadMaximumPhaseUs = phaseUs;
        }
        lastCheckpointUs_ = nowUs;
        ++targetsLoadWatchdogFeeds;
        feedRuntimeSafetyWatchdog();
    }

