anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
private:
    std::uint64_t startedUs_ = 0;
    std::uint64_t lastCheckpointUs_ = 0;
};

bool targetsMergeFixtureFingerprintValid(const char* value) {
    if (value == nullptr || strnlen(value, 65) != 64) return false;
    for (std::size_t index = 0; index < 64; ++index) {
        const char current = value[index];
        if (!((current >= '0' && current <= '9') ||
              (current >= 'a' && current <= 'f') ||
              (current >= 'A' && current <= 'F'))) {
            return false;
        }
    }
    return true;
}

bool targetsMergeFixtureRunIdValid(const char* value) {
    if (value == nullptr) return false;
    const std::size_t length = strnlen(value, 33);
    if (length == 0 || length >= 33) return false;
    for (std::size_t index = 0; index < length; ++index) {
        const char current = value[index];
        if (!((current >= 'a' && current <= 'z') ||
              (current >= 'A' && current <= 'Z') ||
              (current >= '0' && current <= '9') || current == '_' ||
              current == '-')) {
            return false;
        }
    }
    return true;
}

bool computeTargetsMergeFixtureToken(const char* fingerprint,
                                     const char* runId,
                                     std::uint8_t output[32]) {
    static constexpr char kSchema[] =
        "leshy.targets-merge-split-fixture.rtc.v1";
    if (!targetsMergeFixtureFingerprintValid(fingerprint) ||
        !targetsMergeFixtureRunIdValid(runId) || output == nullptr) {
        return false;
    }
    const std::uint8_t separator = 0;
    mbedtls_sha256_context context;
    mbedtls_sha256_init(&context);
    const bool valid = mbedtls_sha256_starts(&context, 0) == 0 &&
        mbedtls_sha256_update(
            &context, reinterpret_cast<const std::uint8_t*>(kSchema),
            sizeof(kSchema) - 1U) == 0 &&
        mbedtls_sha256_update(&context, &separator, 1) == 0 &&
        mbedtls_sha256_update(
            &context, reinterpret_cast<const std::uint8_t*>(fingerprint),
            64) == 0 &&
        mbedtls_sha256_update(&context, &separator, 1) == 0 &&
        mbedtls_sha256_update(
            &context, reinterpret_cast<const std::uint8_t*>(runId),
            std::strlen(runId)) == 0 &&
        mbedtls_sha256_finish(&context, output) == 0;
    mbedtls_sha256_free(&context);
    return valid;
}

void clearTargetsMergeFixtureContinuity() {
    targetsMergeFixtureRtcState.magic = 0;
    std::memset(targetsMergeFixtureRtcState.expectedFingerprint, 0,
                sizeof(targetsMergeFixtureRtcState.expectedFingerprint));
    std::memset(targetsMergeFixtureRtcState.runId, 0,
                sizeof(targetsMergeFixtureRtcState.runId));
    std::memset(targetsMergeFixtureRtcState.token, 0,
                sizeof(targetsMergeFixtureRtcState.token));
    targetsMergeFixtureRtcState.mutationStage =
        static_cast<std::uint32_t>(TargetsMergeFixtureMutationStage::Idle);
    targetsMergeFixtureRtcState.mutationStageInverse =
        ~targetsMergeFixtureRtcState.mutationStage;
    targetsMergeFixtureRtcState.mutationWorkerStackMinimumFree = UINT32_MAX;
}

const char* targetsMergeFixtureMutationStageName(
    TargetsMergeFixtureMutationStage stage) {
    switch (stage) {
        case TargetsMergeFixtureMutationStage::Idle: return "idle";
        case TargetsMergeFixtureMutationStage::Queued: return "queued";
        case TargetsMergeFixtureMutationStage::WorkerStarted:
            return "worker_started";
        case TargetsMergeFixtureMutationStage::TargetInspected:
            return "target_inspected";
        case TargetsMergeFixtureMutationStage::FilesystemMounted:
            return "filesystem_mounted";
        case TargetsMergeFixtureMutationStage::WorkspaceAcquired:
            return "workspace_acquired";
        case TargetsMergeFixtureMutationStage::MergeApplied:
            return "merge_applied";
        case TargetsMergeFixtureMutationStage::CommitStarted:
            return "commit_started";
        case TargetsMergeFixtureMutationStage::CommitComplete:
            return "commit_complete";
        case TargetsMergeFixtureMutationStage::RecoveryStarted:
            return "recovery_started";
        case TargetsMergeFixtureMutationStage::RecoveryComplete:
            return "recovery_complete";
        case TargetsMergeFixtureMutationStage::CleanupStarted:
            return "cleanup_started";
        case TargetsMergeFixtureMutationStage::EventQueued:
            return "event_queued";
    }
    return "invalid";
}

bool targetsMergeFixtureMutationStageValid() {
    const std::uint32_t stage = targetsMergeFixtureRtcState.mutationStage;
    return targetsMergeFixtureRtcState.mutationStageInverse == ~stage &&
        stage <= static_cast<std::uint32_t>(
            TargetsMergeFixtureMutationStage::EventQueued);
}

void recordTargetsMergeFixtureMutationStage(
    TargetsMergeFixtureMutationStage stage, bool workerContext = true) {
    const std::uint32_t value = static_cast<std::uint32_t>(stage);
    targetsMergeFixtureRtcState.mutationStageInverse = ~value;
    if (workerContext) {
        const std::uint32_t free = static_cast<std::uint32_t>(
            uxTaskGetStackHighWaterMark(nullptr));
        if (free < targetsMergeFixtureRtcState.mutationWorkerStackMinimumFree) {
            targetsMergeFixtureRtcState.mutationWorkerStackMinimumFree = free;
        }
    }
    __atomic_thread_fence(__ATOMIC_RELEASE);
    targetsMergeFixtureRtcState.mutationStage = value;
}

bool armTargetsMergeFixtureContinuity(const char* fingerprint,
                                      const char* runId) {
    clearTargetsMergeFixtureContinuity();
    if (!targetsMergeFixtureFingerprintValid(fingerprint) ||
        !targetsMergeFixtureRunIdValid(runId)) {
        return false;
    }
    std::memcpy(targetsMergeFixtureRtcState.expectedFingerprint, fingerprint,
                64);
    targetsMergeFixtureRtcState.expectedFingerprint[64] = '\0';
    std::strcpy(targetsMergeFixtureRtcState.runId, runId);
    if (!computeTargetsMergeFixtureToken(
            targetsMergeFixtureRtcState.expectedFingerprint,
            targetsMergeFixtureRtcState.runId,
            targetsMergeFixtureRtcState.token)) {
        clearTargetsMergeFixtureContinuity();
        return false;
    }
    __atomic_thread_fence(__ATOMIC_RELEASE);
    targetsMergeFixtureRtcState.magic = kTargetsMergeFixtureRtcMagic;
    return true;
}

bool targetsMergeFixtureContinuityValid() {
    if (targetsMergeFixtureRtcState.magic !=
            kTargetsMergeFixtureRtcMagic ||
        !targetsMergeFixtureFingerprintValid(
            targetsMergeFixtureRtcState.expectedFingerprint) ||
        !targetsMergeFixtureRunIdValid(targetsMergeFixtureRtcState.runId)) {
        return false;
    }
    std::uint8_t expected[32] = {};
    const bool computed = computeTargetsMergeFixtureToken(
        targetsMergeFixtureRtcState.expectedFingerprint,
        targetsMergeFixtureRtcState.runId, expected);
    const bool valid = computed &&
        std::memcmp(expected, targetsMergeFixtureRtcState.token,
                    sizeof(expected)) == 0;
    std::memset(expected, 0, sizeof(expected));
    return valid;
}

bool prepareTargetsMergeSyntheticSessions() {
    static constexpr std::uint8_t kBssids[2][6] = {
        {0x02, 0x4c, 0x53, 0x48, 0x59, 0x01},
        {0x02, 0x4c, 0x53, 0x48, 0x59, 0x02},
    };
    static constexpr const char* kSsids[2] = {
        "fixture-alpha", "fixture-bravo"};
    SurveySession* sessions[2] = {&librarySession, &surveySession};
    static constexpr const char* kSessionIds[2] = {
        "targets-merge-a", "targets-merge-b"};
    for (std::size_t index = 0; index < 2; ++index) {
        SurveySession& session = *sessions[index];
        const std::uint64_t startedUs = 1000U + index * 2000U;
        session.reset();
        if (session.start(kSessionIds[index], startedUs) !=
            SessionStatus::Started) {
            return false;
        }
        WifiScanRecord record;
        std::memcpy(record.bssid.data(), kBssids[index], record.bssid.size());
        record.channel = index == 0 ? 1 : 11;
        record.rssiDbm = index == 0 ? -47 : -53;
        record.ssid = kSsids[index];
        record.ssidLength = std::strlen(kSsids[index]);
        Observation observation;
        if (!leshy1::drivers::wifi::normalizePassiveRecord(
                record, startedUs + 100U, &observation) ||
            session.append(observation) != SessionStatus::Appended ||
            session.stop(startedUs + 1000U) != SessionStatus::Stopped) {
            return false;
        }
    }
    return true;
}

__attribute__((noinline)) bool loadTargetsMergeFixture(
    TargetsLoadWatchdogScope& loadWatchdog) {
    targetsMergeFixtureRuntime = true;
    targetsMergeFixtureSdAccessed = false;
    targetsMergeFixtureProductStateTouched = false;
    if (!targetsMergeFixtureContinuityValid()) {
        targetsProductStatus = "fixture_continuity_invalid";
        lastRuntimeEvent = targetsProductStatus;
        return true;
    }
    loadWatchdog.checkpoint();
    if (!prepareTargetsMergeSyntheticSessions()) {
        targetsProductStatus = "fixture_sessions_failed";
        lastRuntimeEvent = targetsProductStatus;
        return true;
    }
    loadWatchdog.checkpoint();

    DisposableOtaLittleFs filesystem;
    const bool inspected = filesystem.inspect();
    const bool targetSafe = inspected && filesystem.safeInactiveTarget();
    const bool mounted = targetSafe && filesystem.mountReadOnly();
    loadWatchdog.checkpoint();
    char scratchPath[leshy1::storage::kScratchPathMax] = {};
    const int scratchWritten = std::snprintf(
        scratchPath, sizeof(scratchPath), "%s%s",
        leshy1::storage::kScratchRoot, targetsMergeFixtureRtcState.runId);
    const bool scratchPathValid = scratchWritten > 0 &&
        static_cast<std::size_t>(scratchWritten) < sizeof(scratchPath);
    const std::uint64_t capacityBytes = mounted ? filesystem.totalBytes() : 0;
    const bool scratchExists = mounted && scratchPathValid &&
        filesystem.exists(scratchPath);

    leshy1::storage::MediaIdentity media;
    media.present = mounted && capacityBytes != 0;
    media.kind = leshy1::storage::MediaKind::LittleFs;
    media.fingerprint = targetsMergeFixtureRtcState.expectedFingerprint;
    media.capacityBytes = capacityBytes;
    // Read authorization does not need a free-space geometry query.
    media.freeBytes = 0;
    leshy1::storage::ExistingScratchReadRequest request;
    request.explicitlySelected = true;
    request.expectedFingerprint =
        targetsMergeFixtureRtcState.expectedFingerprint;
    request.runId = targetsMergeFixtureRtcState.runId;
    request.scratchExists = scratchExists;
    const auto permit = leshy1::storage::authorizeExistingScratchRead(
        media, request);

