anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    auto* targetStateWorkspace = static_cast<
        leshy1::storage::TargetDecisionStateStoreWorkspace*>(nullptr);
    bool opened = false;
    bool statePresent = false;
    bool persistedStateBlobAvailable = false;
    bool targetStateAccepted = true;
    if (!inspected) {
        targetsProductStatus = "fixture_target_not_found";
    } else if (!targetSafe) {
        targetsProductStatus = "fixture_target_not_inactive_ota1";
    } else if (!mounted) {
        targetsProductStatus = "fixture_readonly_mount_failed";
    } else if (!permit.allowed()) {
        targetsProductStatus = leshy1::storage::readPermitStatusName(
            permit.status);
    } else {
        ArduinoLittleFsSessionStoreIo io(filesystem);
        opened = io.openExistingReadOnly(permit);
        char headA[96] = {};
        char headB[96] = {};
        const int headAWritten = std::snprintf(
            headA, sizeof(headA), "%s/target-state-head-a.bin", scratchPath);
        const int headBWritten = std::snprintf(
            headB, sizeof(headB), "%s/target-state-head-b.bin", scratchPath);
        statePresent = opened && headAWritten > 0 && headBWritten > 0 &&
            static_cast<std::size_t>(headAWritten) < sizeof(headA) &&
            static_cast<std::size_t>(headBWritten) < sizeof(headB) &&
            (filesystem.exists(headA) || filesystem.exists(headB));
        if (!opened) {
            targetsProductStatus = "fixture_open_failed";
            targetStateAccepted = false;
        } else if (statePresent) {
            targetStateWorkspace = new (std::nothrow)
                leshy1::storage::TargetDecisionStateStoreWorkspace();
            if (targetStateWorkspace == nullptr) {
                targetsProductStatus =
                    "fixture_target_state_workspace_unavailable";
                targetStateAccepted = false;
            } else {
                const auto recovered =
                    leshy1::storage::recoverTargetProductStateWire(
                        io, *targetStateWorkspace);
                loadWatchdog.checkpoint();
                if (recovered.valid()) {
                    persistedStateBlobAvailable = true;
                    targetsStateGeneration = recovered.generation;
                    targetsStateHead = recovered.choice;
                } else {
                    targetsProductStatus =
                        leshy1::storage::targetStateStoreStatusName(
                            recovered.status);
                    targetStateAccepted = false;
                }
            }
        }
        loadWatchdog.checkpoint();
        io.end();
    }
    filesystem.end();
    loadWatchdog.checkpoint();
    targetsCleanupComplete = filesystem.cleanupComplete();
    if (!targetsCleanupComplete) {
        targetsProductStatus = "fixture_cleanup_failed";
        targetStateAccepted = false;
    }

    if (targetStateAccepted && opened && targetsCleanupComplete) {
        const TargetCatalog* persistedForLoad = nullptr;
        const CorrelationDecisionLog* decisionsForLoad = nullptr;
        if (persistedStateBlobAvailable) {
            targetsHeapFreeBefore = static_cast<std::uint32_t>(
                heap_caps_get_free_size(MALLOC_CAP_8BIT));
            auto* catalog = new (std::nothrow) TargetCatalog();
            auto* decisions = new (std::nothrow) CorrelationDecisionLog();
            auto* merges = new (std::nothrow) TargetMergeHistory();
            if (catalog == nullptr || decisions == nullptr ||
                merges == nullptr) {
                delete merges;
                delete decisions;
                delete catalog;
                delete targetStateWorkspace;
                targetsProductStatus = "fixture_workspace_unavailable";
                lastRuntimeEvent = targetsProductStatus;
                return false;
            }
            const auto reopened = leshy1::storage::reopenTargetState(
                targetStateWorkspace->manifest.data(),
                targetStateWorkspace->manifestSize,
                targetStateWorkspace->state.data(),
                targetStateWorkspace->stateSize,
                catalog, decisions, merges);
            delete targetStateWorkspace;
            targetStateWorkspace = nullptr;
            loadWatchdog.checkpoint();
            if (reopened != leshy1::storage::TargetCodecStatus::Valid) {
                delete merges;
                delete decisions;
                delete catalog;
                targetsProductStatus = "fixture_target_state_reopen_failed";
                lastRuntimeEvent = targetsProductStatus;
                return false;
            }
            if (!finishTargetsProductAllocation(
                    catalog, decisions, merges, true)) {
                return false;
            }
            persistedForLoad = &targetsProductRuntime->workspace.catalog;
            decisionsForLoad = &targetsProductRuntime->workspace.decisions;
        } else {
            delete targetStateWorkspace;
            targetStateWorkspace = nullptr;
            if (!allocateTargetsProduct()) return false;
        }
        loadWatchdog.checkpoint();
        targetsComparisonLoaded = true;
        targetsBaselineBinding = {&librarySession, 1};
        targetsCurrentBinding = {&surveySession, 2};
        const auto loaded = loadBoundTargetsProduct(
            targetsProductRuntime->controller, persistedForLoad,
            decisionsForLoad);
        loadWatchdog.checkpoint();
        targetsProductStatus =
            leshy1::apps::targets::targetsLoadStatusName(loaded);
    }
    delete targetStateWorkspace;
    lastRuntimeEvent = targetsProductStatus;
    return true;
}

bool loadTargetsProduct(const AppMenuItem& item) {
    TargetsLoadWatchdogScope loadWatchdog;
    releaseTargetsProduct();
    targetsBaselineBinding = {};
    targetsCurrentBinding = {};
    targetsComparisonLoaded = false;
    targetsStateGeneration = 0;
    targetsStateHead = leshy1::storage::RecoveryChoice::None;
    targetsMutationState = TargetsMutationState::Idle;
    targetsMutationStatus = "idle";
    targetsMutationReport = {};
    targetsMutationExpectedRevision = 0;
    targetsMutationCompanion = false;
    targetsMutationCompanionWeb = false;
    targetsMutationCorrelation = false;
    targetsMutationMerge = false;
    targetsMutationMergeKind = TargetMergeActionKind::Merge;
    targetsMutationMergeOperationId = {};
    targetsMutationMergeSourceId = {};
    targetsBlockedWriteAttempts = 0;
    targetsFilesystemMountError = 0;
    targetsIdentityAttempts = 0;
    targetsIdentityTransientRetries = 0;
    targetsIdentityCleanupComplete = true;
    targetsFilesystemMountAttempts = 0;
    targetsFilesystemMountTransientRetries = 0;
    targetsCleanupComplete = true;
    targetsMergeFixtureRuntime = false;
    targetsMergeFixtureSdAccessed = false;
    targetsMergeFixtureProductStateTouched = false;
    if (!admitTargetsWithStickyNetworkCore()) {
        targetsProductStatus = "post_web_memory_admission_failed";
        lastRuntimeEvent = targetsProductStatus;
        return true;
    }
    if (item.simulated) {
        if (!allocateTargetsProduct()) return false;
        TargetsController& controller = targetsProductRuntime->controller;
        const LibraryEntry* entry = libraryController.selected();
        if (entry == nullptr || entry->session == nullptr ||
            entry->generation == 0) {
            targetsProductStatus = "session_unavailable";
            lastRuntimeEvent = targetsProductStatus;
            return true;
        }
        const TargetsLoadStatus loaded = controller.load(
            {entry->session, entry->generation});
        targetsCurrentBinding = {entry->session, entry->generation};
        targetsProductStatus =
            leshy1::apps::targets::targetsLoadStatusName(loaded);
        lastRuntimeEvent = targetsProductStatus;
        return true;
    }

