anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    constexpr auto required =
        leshy1::kernel::runtime::resourceMask(Resource::Storage) |
        leshy1::kernel::runtime::resourceMask(Resource::RadioSpi);
    const auto owned = appRuntime.activeResources();
    char expectedFingerprint[33] = {};
    if ((owned & required) != required) {
        targetsProductStatus = "resources_missing";
        lastRuntimeEvent = targetsProductStatus;
        return true;
    }
    if (targetsMergeFixtureRtcState.magic ==
        kTargetsMergeFixtureRtcMagic) {
        if (!targetsMergeFixtureContinuityValid()) {
            targetsMergeFixtureRuntime = true;
            targetsProductStatus = "fixture_continuity_invalid";
            lastRuntimeEvent = targetsProductStatus;
            return true;
        }
        return loadTargetsMergeFixture(loadWatchdog);
    }
    if (!loadProductFingerprint(expectedFingerprint,
                                sizeof(expectedFingerprint))) {
        targetsProductStatus = "enrollment_missing";
        lastRuntimeEvent = targetsProductStatus;
        return true;
    }

    leshy1::storage::SdTransportRunResult identity{};
    char observedFingerprint[33] = {};
    bool identityBegun = false;
    for (std::uint8_t attempt = 1;
         attempt <= leshy1::storage::kProductStartMaximumIdentityAttempts;
         ++attempt) {
        BoardSdSpiTransport identityTransport;
        identityBegun = identityTransport.begin();
        identity = {};
        if (identityBegun) {
            leshy1::storage::SdTransportRunPolicy policy;
            policy.allowPhysical = true;
            policy.explicitlySelected = true;
            policy.identificationOnly = true;
            policy.ownedResources = owned;
            identity = leshy1::storage::runSdIdentificationStateMachine(
                leshy1::storage::defaultSdIdentificationPlan(),
                identityTransport, policy);
            identityTransport.end();
        }
        targetsIdentityAttempts = attempt;
        targetsIdentityTransientRetries =
            static_cast<std::uint8_t>(attempt - 1U);
        targetsIdentityCleanupComplete =
            identityTransport.cleanupComplete();
        formatCidFingerprint(identity.identity, observedFingerprint,
                             sizeof(observedFingerprint));
        loadWatchdog.checkpoint();
        if (targetsIdentityCleanupComplete &&
            identity.status ==
                leshy1::storage::SdTransportRunStatus::Valid) {
            break;
        }
        const leshy1::storage::ProductStartIdentityRetryEvidence evidence{
            true,
            true,
            exactCidFingerprint(expectedFingerprint),
            (owned & required) == required,
            identityTransport.physicalSpiStarted(),
            identity.status,
            std::strcmp(observedFingerprint,
                        "00000000000000000000000000000000") == 0,
            targetsIdentityCleanupComplete,
            false,
        };
        if (!leshy1::storage::shouldRetryProductStartIdentity(
                evidence, attempt)) {
            break;
        }
        vTaskDelay(pdMS_TO_TICKS(
            leshy1::storage::productStartIdentityRetryDelayMs(attempt)));
        loadWatchdog.checkpoint();
    }
    if (!identityBegun || !targetsIdentityCleanupComplete ||
        identity.status != leshy1::storage::SdTransportRunStatus::Valid) {
        targetsProductStatus = "identity_failed";
        lastRuntimeEvent = targetsProductStatus;
        return true;
    }
    if (std::strcmp(expectedFingerprint, observedFingerprint) != 0) {
        targetsProductStatus = "fingerprint_mismatch";
        lastRuntimeEvent = targetsProductStatus;
        return true;
    }

    // Mount before switching the shared static codec union from Session to
    // Target state. A completed Local Web visit leaves the process-lifetime
    // TCP/IP core resident, so a second 24 KiB heap allocation can fail while
    // FatFs is mounted even after the idle Survey worker has been suspended.
    // Session recovery completes first; the same static bytes can then hold
    // the target-state wire without consuming or fragmenting dynamic heap.
    // Both atomic heads, manifests and payload checksums are then validated
    // while mounted; semantic decoding happens after unmount directly into the
    // one long-lived runtime catalog and decision log. After unmount the
    // product state is first decoded into the three long-lived state blocks.
    // The 24 KiB wire workspace is then released before the remaining runtime
    // blocks (comparison, proposals, workspace and controller) are allocated.
    // Building the complete runtime while the wire workspace is still alive
    // exceeds the post-Survey contiguous heap even though both phases fit
    // independently.
    auto* targetStateWorkspace = static_cast<
        leshy1::storage::TargetDecisionStateStoreWorkspace*>(nullptr);
    BoardSdFilesystem filesystem;
    bool mounted = false;
    constexpr std::uint8_t kTargetsMaximumMountAttempts = 3;
    for (std::uint8_t attempt = 1;
         attempt <= kTargetsMaximumMountAttempts; ++attempt) {
        targetsFilesystemMountAttempts = attempt;
        mounted = filesystem.beginReadOnly();
        loadWatchdog.checkpoint();
        targetsFilesystemMountError = filesystem.mountError();
        if (mounted && filesystem.readOnlyGuaranteed()) break;
        if (!filesystem.cleanupComplete()) break;
        if (attempt < kTargetsMaximumMountAttempts) {
            targetsFilesystemMountTransientRetries = attempt;
            // A just-finished Survey has released FatFs and its worker, but
            // allocator coalescing may trail the UI transition by one tick.
            // Retry only the fail-closed read-only mount, with every failed
            // attempt already fully cleaned and all RF TX paths held inactive.
            vTaskDelay(pdMS_TO_TICKS(50U * attempt));
        }
    }
    if (!mounted || !filesystem.readOnlyGuaranteed()) {
        if (filesystem.mounted()) filesystem.end();
        targetsCleanupComplete = filesystem.cleanupComplete();
        releaseTargetsStoreCodecWorkspace(targetStateWorkspace);
        targetStateWorkspace = nullptr;
        targetsProductStatus = "readonly_mount_failed";
        lastRuntimeEvent = targetsProductStatus;
        return true;
    }
    const std::uint64_t cardCapacity = filesystem.cardCapacityBytes();
    const bool rootExists = knownProductSessionRootExists(
        observedFingerprint);
    leshy1::storage::MediaIdentity media;
    media.present = cardCapacity != 0 &&
        cardCapacity == identity.identity.capacityBytes;
    media.kind = leshy1::storage::MediaKind::Sd;
    media.fingerprint = observedFingerprint;
    media.capacityBytes = cardCapacity;
    media.freeBytes = 0;
    leshy1::storage::ProductStoreRequest request;
    request.operation =
        leshy1::storage::ProductStoreOperation::RecoverCatalog;
    request.expectedFingerprint = expectedFingerprint;
    request.rootPath = leshy1::storage::kProductSessionStoreRoot;
    request.rootExists = rootExists;
    request.driverReadOnlyGuaranteed = filesystem.readOnlyGuaranteed();
    request.ownedResources = owned;
    const auto permit = leshy1::storage::authorizeProductStore(media, request);

