anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    bool pairRecovered = false;
    std::uint32_t baselineGeneration = 0;
    std::uint32_t currentGeneration = 0;
    bool latestRecovered = false;
    std::uint32_t latestGeneration = 0;
    bool persistedStateBlobAvailable = false;
    bool targetStateAccepted = true;
    if (!permit.allowed()) {
        targetsProductStatus =
            leshy1::storage::productStoreAccessStatusName(permit.status);
    } else {
        ArduinoFsSessionStoreIo io(filesystem.driveNumber(),
                                   sdSessionStoreIoWorkspace, nullptr,
                                   &protectedDataCipher, &deviceLock);
        if (!io.openExistingReadOnly(permit)) {
            targetsProductStatus = "open_failed";
        } else {
            targetsProductStatus =
                leshy1::apps::targets::targetsLoadStatusName(
                    TargetsLoadStatus::SessionUnavailable);
            const auto pair = leshy1::storage::recoverSessionPair(
                io, sessionStoreWorkspace(), &librarySession,
                &surveySession);
            loadWatchdog.checkpoint();
            if (pair.valid()) {
                pairRecovered = true;
                baselineGeneration = pair.baselineGeneration;
                currentGeneration = pair.currentGeneration;
            } else {
                surveySession.reset();
                const auto latest = leshy1::storage::recoverSession(
                    io, sessionStoreWorkspace(), &surveySession);
                loadWatchdog.checkpoint();
                if (latest.valid()) {
                    latestRecovered = true;
                    latestGeneration = latest.generation;
                }
            }
            const bool sessionReady = pairRecovered || latestRecovered;
            const bool targetStatePresent = filesystem.exists(
                    "/leshy/sessions/v1/enc-target-state-head-a.bin") ||
                filesystem.exists(
                    "/leshy/sessions/v1/enc-target-state-head-b.bin");
            if (sessionReady && targetStatePresent) {
                targetStateWorkspace = acquireTargetsStoreCodecWorkspace();
                if (targetStateWorkspace == nullptr) {
                    targetStateAccepted = false;
                    targetsProductStatus = "target_state_workspace_unavailable";
                } else {
                    const auto recovered =
                        leshy1::storage::recoverTargetProductStateWire(
                            io, *targetStateWorkspace);
                    loadWatchdog.checkpoint();
                    if (recovered.valid()) {
                        persistedStateBlobAvailable = true;
                        targetsStateGeneration = recovered.generation;
                        targetsStateHead = recovered.choice;
                    } else {
                        targetStateAccepted = false;
                        targetsProductStatus =
                            leshy1::storage::targetStateStoreStatusName(
                                recovered.status);
                    }
                }
            }
        }
        io.end();
        loadWatchdog.checkpoint();
    }
    // Recovery left the selected checksum-validated wire generation in the
    // codec workspace; no duplicate decoded catalog or decision log overlapped
    // FatFs. Decode it once after unmount into the foreground runtime.
    targetsBlockedWriteAttempts = filesystem.blockedWriteAttempts();
    filesystem.end();
    loadWatchdog.checkpoint();
    targetsCleanupComplete = filesystem.cleanupComplete();
    if (!targetsCleanupComplete || targetsBlockedWriteAttempts != 0) {
        targetsProductStatus = "cleanup_failed";
    }
    // Release FAT/SPI heap before allocating the foreground Targets workspace.
    if (targetsCleanupComplete && targetsBlockedWriteAttempts == 0 &&
        targetStateAccepted &&
        (pairRecovered || latestRecovered)) {
        const TargetCatalog* persistedForLoad = nullptr;
        const CorrelationDecisionLog* decisionsForLoad = nullptr;
        if (persistedStateBlobAvailable) {
            targetsHeapFreeBefore = static_cast<std::uint32_t>(
                heap_caps_get_free_size(MALLOC_CAP_8BIT));
            auto* catalog = new (std::nothrow) TargetCatalog();
            auto* decisions = new (std::nothrow) CorrelationDecisionLog();
            auto* merges = new (std::nothrow) TargetMergeHistory();
            if (catalog == nullptr || decisions == nullptr || merges == nullptr) {
                delete merges;
                delete decisions;
                delete catalog;
                releaseTargetsStoreCodecWorkspace(targetStateWorkspace);
                targetStateWorkspace = nullptr;
                targetsProductStatus = "workspace_unavailable";
                lastRuntimeEvent = targetsProductStatus;
                return false;
            }
            const auto reopened = leshy1::storage::reopenTargetState(
                targetStateWorkspace->manifest.data(),
                targetStateWorkspace->manifestSize,
                targetStateWorkspace->state.data(),
                targetStateWorkspace->stateSize,
                catalog, decisions, merges);
            loadWatchdog.checkpoint();
            releaseTargetsStoreCodecWorkspace(targetStateWorkspace);
            targetStateWorkspace = nullptr;
            if (reopened != leshy1::storage::TargetCodecStatus::Valid) {
                delete merges;
                delete decisions;
                delete catalog;
                targetsHeapFreeAfter = static_cast<std::uint32_t>(
                    heap_caps_get_free_size(MALLOC_CAP_8BIT));
                targetsProductStatus = "target_state_reopen_failed";
                lastRuntimeEvent = targetsProductStatus;
                return false;
            }
            if (!finishTargetsProductAllocation(
                    catalog, decisions, merges, true)) {
                return false;
            }
            persistedForLoad = &targetsProductRuntime->workspace.catalog;
            decisionsForLoad = &targetsProductRuntime->workspace.decisions;
        } else {
            releaseTargetsStoreCodecWorkspace(targetStateWorkspace);
            targetStateWorkspace = nullptr;
            if (!allocateTargetsProduct()) return false;
        }
        loadWatchdog.checkpoint();
        TargetsController& controller = targetsProductRuntime->controller;
        targetsComparisonLoaded = pairRecovered;
        targetsBaselineBinding = pairRecovered
            ? TargetProductBinding{&librarySession, baselineGeneration}
            : TargetProductBinding{};
        targetsCurrentBinding = pairRecovered
            ? TargetProductBinding{&surveySession, currentGeneration}
            : TargetProductBinding{&surveySession, latestGeneration};
        const TargetsLoadStatus loaded = loadBoundTargetsProduct(
            controller,
            persistedForLoad, decisionsForLoad);
        loadWatchdog.checkpoint();
        targetsProductStatus =
            leshy1::apps::targets::targetsLoadStatusName(loaded);
    }
    releaseTargetsStoreCodecWorkspace(targetStateWorkspace);
    lastRuntimeEvent = targetsProductStatus;
    return true;
}

bool rebuildTargetsProductFromCatalog(TargetCatalog*& persisted,
                                      CorrelationDecisionLog*& decisions,
                                      TargetMergeHistory*& merges,
                                      const TargetId& selectedId,
                                      bool openActions,
                                      bool usePersistedState = true) {
    const bool adopting = usePersistedState && persisted != nullptr &&
        decisions != nullptr && merges != nullptr;
    if (adopting ? !adoptTargetsProductState(persisted, decisions, merges)
                 : !allocateTargetsProduct()) {
        return false;
    }
    TargetsController& controller = targetsProductRuntime->controller;
    // Adoption clears the hand-off pointers, so use the runtime-owned aliases
    // for the controller's explicitly supported in-place reopen path.
    const TargetCatalog* persistedForLoad = adopting
        ? &targetsProductRuntime->workspace.catalog : nullptr;
    const CorrelationDecisionLog* decisionsForLoad = adopting
        ? &targetsProductRuntime->workspace.decisions : nullptr;
    const TargetsLoadStatus loaded = loadBoundTargetsProduct(
        controller,
        persistedForLoad != nullptr && persistedForLoad->size() != 0
            ? persistedForLoad : nullptr,
        decisionsForLoad);
    if (loaded != TargetsLoadStatus::Ready) {
        targetsProductStatus =
            leshy1::apps::targets::targetsLoadStatusName(loaded);
        return false;
    }
    if (leshy1::domain::targets::targetIdValid(selectedId) &&
        controller.selectTarget(selectedId)) {
        controller.openSelected();
        if (openActions) controller.openSelected();
    }
    targetsProductStatus = "ready";
    return true;
}

bool restoreTargetsAfterWebCompanion() {
    if (!webCompanionTargetsSuspended()) return true;
    // Reopening the controller deterministically recomputes comparison from
    // the retained sessions, so the snapshot used by Web can be released first.
    delete webCompanionComparison;
    webCompanionComparison = nullptr;
    const bool rebuilt = rebuildTargetsProductFromCatalog(
        webCompanionCatalog, webCompanionDecisions, webCompanionMerges,
        webCompanionSelectedTargetId, true, true);
    if (!rebuilt) {
        targetsProductStatus = "web_restore_failed";
        lastRuntimeEvent = targetsProductStatus;
    }
    return rebuilt;
}

const TargetMergeRecord* activeTargetMerge(
    const TargetMergeHistory& history, const TargetId& targetId) {
    for (std::size_t offset = 0; offset < history.size(); ++offset) {
        const auto* record = history.get(history.size() - 1U - offset);
        if (record != nullptr && !record->split &&
            leshy1::domain::targets::targetIdEqual(
                record->destinationBefore.id, targetId)) {
            return record;
        }
    }
    return nullptr;
}

TargetMergeId newTargetMergeOperationId() {
    TargetMergeId id{};
    esp_fill_random(id.bytes.data(), id.bytes.size());
    // The all-zero identifier is invalid. This deterministic fallback remains
    // unique for the current graph generation even if the entropy source were
    // to return its one forbidden value.
    if (!leshy1::domain::targets::targetMergeIdValid(id)) {
        id.bytes[0] = 0x4c;
        id.bytes[1] = 0x53;
        id.bytes[2] = static_cast<std::uint8_t>(targetsStateGeneration >> 24U);
        id.bytes[3] = static_cast<std::uint8_t>(targetsStateGeneration >> 16U);
        id.bytes[4] = static_cast<std::uint8_t>(targetsStateGeneration >> 8U);
        id.bytes[5] = static_cast<std::uint8_t>(targetsStateGeneration);
        id.bytes.back() = 1;
    }
    return id;
}

void runTargetsMergeFixtureMutationWorker(void*) {
    TargetsMutationEvent event;
    event.status = "fixture_store_failed";
    event.merge = true;
    event.mergeKind = targetsMutationMergeKind;
    event.mergeOperationId = targetsMutationMergeOperationId;
    event.mergeSourceId = targetsMutationMergeSourceId;
    event.targetId = targetsMutationTargetId;
    const std::uint64_t startedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    TargetCatalog* catalog = targetsMutationCatalog;
    CorrelationDecisionLog* decisions = targetsMutationDecisions;
    TargetMergeHistory* merges = targetsMutationMerges;
    DisposableOtaLittleFs filesystem;
    bool filesystemAttempted = false;
    bool deadlineArmed = false;
    ArduinoLittleFsSessionStoreIo* io = nullptr;
    auto* workspace = static_cast<
        leshy1::storage::TargetDecisionStateStoreWorkspace*>(nullptr);
    resetTargetsStoreDeadlineCancel();
    recordTargetsMergeFixtureMutationStage(
        TargetsMergeFixtureMutationStage::WorkerStarted);
    deadlineArmed = armTargetsStoreDeadline(startedUs == 0 ? 1 : startedUs);
    const auto supervisedCheckpoint = targetsStoreSupervisedCheckpoint;
    do {
        if (!deadlineArmed) {
            event.status = "deadline_unavailable";
            break;
        }
        if (catalog == nullptr || decisions == nullptr || merges == nullptr ||
            targetsMutationEvents == nullptr || !targetsMutationMerge) {
            event.status = "worker_invalid";
            break;
        }
        if (!targetsMergeFixtureRuntime ||
            !targetsMergeFixtureContinuityValid()) {
            event.status = "fixture_continuity_invalid";
            break;
        }
        const auto required =
            leshy1::kernel::runtime::resourceMask(Resource::Storage) |
            leshy1::kernel::runtime::resourceMask(Resource::RadioSpi);
        if ((appRuntime.activeResources() & required) != required) {
            event.status = "resources_missing";
            break;
        }
        if (!supervisedCheckpoint()) {
            event.status = "safety_worker_deadline";
            break;
        }

        event.heapFreeBeforeMount = static_cast<std::uint32_t>(
            heap_caps_get_free_size(MALLOC_CAP_8BIT));
        event.heapLargestBeforeMount = static_cast<std::uint32_t>(
            heap_caps_get_largest_free_block(MALLOC_CAP_8BIT));
        filesystemAttempted = true;
        if (!filesystem.inspect() || !filesystem.safeInactiveTarget()) {
            event.status = "fixture_target_not_inactive_ota1";
            break;
        }
        recordTargetsMergeFixtureMutationStage(
            TargetsMergeFixtureMutationStage::TargetInspected);
        if (!filesystem.mountExistingWritable()) {
            event.filesystemMountError = filesystem.lastError();
            event.status = "fixture_mount_failed";
            break;
        }
        recordTargetsMergeFixtureMutationStage(
            TargetsMergeFixtureMutationStage::FilesystemMounted);
        event.filesystemMountError = filesystem.lastError();
        workspace = acquireTargetsStoreCodecWorkspace();
        if (workspace == nullptr) {
            event.status = "shared_codec_unavailable_after_mount";
            break;
        }
        recordTargetsMergeFixtureMutationStage(
            TargetsMergeFixtureMutationStage::WorkspaceAcquired);
        if (!supervisedCheckpoint()) {
            event.status = "safety_worker_deadline";
            break;
        }

