anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
        char scratchPath[leshy1::storage::kScratchPathMax] = {};
        const int scratchWritten = std::snprintf(
            scratchPath, sizeof(scratchPath), "%s%s",
            leshy1::storage::kScratchRoot,
            targetsMergeFixtureRtcState.runId);
        const std::uint64_t capacityBytes = filesystem.totalBytes();
        const bool scratchExists = scratchWritten > 0 &&
            static_cast<std::size_t>(scratchWritten) < sizeof(scratchPath) &&
            filesystem.exists(scratchPath);
        leshy1::storage::MediaIdentity media;
        media.present = capacityBytes != 0;
        media.kind = leshy1::storage::MediaKind::LittleFs;
        media.fingerprint =
            targetsMergeFixtureRtcState.expectedFingerprint;
        media.capacityBytes = capacityBytes;
        // This host-backed target is freshly formatted for two bounded
        // commits. The permit byte limit and LittleFS writes remain the
        // authority, without an unrelated product-FAT geometry scan.
        media.freeBytes = capacityBytes;
        leshy1::storage::ExistingScratchWriteRequest request;
        request.explicitlyDisposable = true;
        request.expectedFingerprint =
            targetsMergeFixtureRtcState.expectedFingerprint;
        request.runId = targetsMergeFixtureRtcState.runId;
        request.scratchExists = scratchExists;
        request.requiredBytes = kTargetsMergeFixtureByteLimit;
        const auto permit =
            leshy1::storage::authorizeExistingScratchWrite(media, request);
        if (!permit.allowed()) {
            event.status = leshy1::storage::permitStatusName(permit.status);
            break;
        }
        io = new (std::nothrow) ArduinoLittleFsSessionStoreIo(
            filesystem, supervisedCheckpoint);
        if (io == nullptr) {
            event.status = "io_workspace_unavailable";
            break;
        }
        if (!io->openExistingWritable(permit)) {
            event.status = "fixture_open_failed";
            break;
        }

        TargetMergeAction action{};
        action.kind = event.mergeKind;
        action.operationId = event.mergeOperationId;
        action.destinationId = event.targetId;
        action.sourceId = event.mergeSourceId;
        const auto* destination = catalog->find(event.targetId);
        const auto* source = catalog->find(event.mergeSourceId);
        action.expectedDestinationRevision = destination == nullptr
            ? 0U : destination->revision;
        action.expectedSourceRevision = source == nullptr
            ? 0U : source->revision;
        TargetMergeService service(*catalog, *merges);
        const auto applied = service.execute(action);
        event.mergeStatus = applied.status;
        if (!applied.applied()) {
            event.status = leshy1::domain::targets::targetMergeStatusName(
                applied.status);
            break;
        }
        recordTargetsMergeFixtureMutationStage(
            TargetsMergeFixtureMutationStage::MergeApplied);
        if (!supervisedCheckpoint()) {
            event.status = "safety_worker_deadline";
            break;
        }
        if (targetsStateGeneration == UINT32_MAX ||
            (targetsStateGeneration != 0 &&
             targetsStateHead != leshy1::storage::RecoveryChoice::A &&
             targetsStateHead != leshy1::storage::RecoveryChoice::B)) {
            event.status = "state_generation_invalid";
            break;
        }
        const std::uint32_t nextGeneration = targetsStateGeneration == 0
            ? 1U : targetsStateGeneration + 1U;
        const leshy1::storage::HeadSlot nextHead =
            targetsStateGeneration == 0 ||
                    targetsStateHead == leshy1::storage::RecoveryChoice::B
                ? leshy1::storage::HeadSlot::A
                : leshy1::storage::HeadSlot::B;
        recordTargetsMergeFixtureMutationStage(
            TargetsMergeFixtureMutationStage::CommitStarted);
        const auto committed = leshy1::storage::commitTargetProductState(
            *io, *workspace, *catalog, *decisions, *merges, nextGeneration,
            nextHead);
        recordTargetsMergeFixtureMutationStage(
            TargetsMergeFixtureMutationStage::CommitComplete);
        event.storeStatus = committed.status;
        event.commitStage = committed.stage;
        if (!supervisedCheckpoint()) {
            event.status = "safety_worker_deadline";
            break;
        }
        recordTargetsMergeFixtureMutationStage(
            TargetsMergeFixtureMutationStage::RecoveryStarted);
        const auto recovered = leshy1::storage::recoverTargetProductState(
            *io, *workspace, catalog, decisions, merges);
        recordTargetsMergeFixtureMutationStage(
            TargetsMergeFixtureMutationStage::RecoveryComplete);
        event.catalogRecovered = recovered.valid();
        if (recovered.valid()) {
            event.generation = recovered.generation;
            event.head = recovered.choice;
        }
        bool graphReopened = false;
        const auto* record = merges->find(event.mergeOperationId);
        if (record != nullptr &&
            event.mergeKind == TargetMergeActionKind::Merge) {
            const auto* reopenedDestination = catalog->find(
                record->destinationBefore.id);
            const auto* reopenedSource = catalog->find(
                record->sourceBefore.id);
            graphReopened = !record->split &&
                reopenedDestination != nullptr && reopenedSource == nullptr;
        } else if (record != nullptr &&
                   event.mergeKind == TargetMergeActionKind::Split) {
            const auto* reopenedDestination = catalog->find(
                record->destinationBefore.id);
            const auto* reopenedSource = catalog->find(
                record->sourceBefore.id);
            graphReopened = record->split &&
                reopenedDestination != nullptr && reopenedSource != nullptr &&
                leshy1::domain::targets::targetRecordGraphEqual(
                    *reopenedDestination, record->destinationBefore) &&
                leshy1::domain::targets::targetRecordGraphEqual(
                    *reopenedSource, record->sourceBefore);
        }
        event.persisted = committed.complete() && recovered.valid() &&
            recovered.generation == committed.generation && graphReopened;
        event.status = event.persisted
            ? "saved"
            : (committed.complete()
                   ? "reopen_failed"
                   : leshy1::storage::targetStateStoreStatusName(
                         committed.status));
    } while (false);

    recordTargetsMergeFixtureMutationStage(
        TargetsMergeFixtureMutationStage::CleanupStarted);
    if (io != nullptr) {
        event.bytesWritten = io->bytesWritten();
        event.writeCalls = io->writeCalls();
        event.fileSyncs = io->fileSyncs();
        event.directorySyncs = io->directorySyncs();
        io->end();
    }
    delete io;
    releaseTargetsStoreCodecWorkspace(workspace);
    if (filesystem.mounted()) filesystem.end();
    event.cleanupComplete = !filesystemAttempted ||
        filesystem.cleanupComplete();
    if (!event.cleanupComplete) {
        event.persisted = false;
        event.status = "cleanup_failed";
    }
    if (targetsStoreDeadlineCancelled()) {
        event.persisted = false;
        event.status = "safety_worker_deadline";
    }
    if (deadlineArmed) disarmTargetsStoreDeadline();
    resetTargetsStoreDeadlineCancel();
    const std::uint64_t finishedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    event.elapsedUs = finishedUs >= startedUs ? finishedUs - startedUs : 0;
    if (targetsMutationEvents != nullptr) {
        xQueueOverwrite(targetsMutationEvents, &event);
    }
    recordTargetsMergeFixtureMutationStage(
        TargetsMergeFixtureMutationStage::EventQueued);
    vTaskDelete(nullptr);
}

void runTargetsMutationWorker(void*) {
    TargetsMutationEvent event;
    event.status = "store_failed";
    event.favorite = targetsMutationFavorite;
    event.actionKind = targetsMutationKind;
    event.correlation = targetsMutationCorrelation;
    event.correlationKind = targetsMutationCorrelationKind;
    event.merge = targetsMutationMerge;
    event.mergeKind = targetsMutationMergeKind;
    event.mergeOperationId = targetsMutationMergeOperationId;
    event.mergeSourceId = targetsMutationMergeSourceId;
    event.name = targetsMutationText;
    event.nameLength = targetsMutationTextLength;
    event.targetId = targetsMutationTargetId;
    event.expectedRevision = targetsMutationExpectedRevision;
    event.companion = targetsMutationCompanion;
    event.companionWeb = targetsMutationCompanionWeb;
    const std::uint64_t startedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    TargetCatalog* catalog = targetsMutationCatalog;
    CorrelationDecisionLog* decisions = targetsMutationDecisions;
    TargetMergeHistory* merges = targetsMutationMerges;
    BoardSdFilesystem filesystem;
    bool identityCleanupComplete = true;
    bool filesystemAttempted = false;
    bool deadlineArmed = false;
    ArduinoFsSessionStoreIo* io = nullptr;
    auto* workspace = static_cast<
        leshy1::storage::TargetDecisionStateStoreWorkspace*>(nullptr);
    resetTargetsStoreDeadlineCancel();
    deadlineArmed = armTargetsStoreDeadline(startedUs == 0 ? 1 : startedUs);
    const auto supervisedCheckpoint = targetsStoreSupervisedCheckpoint;
    do {
        if (!deadlineArmed) {
            event.status = "deadline_unavailable";
            break;
        }
        if (catalog == nullptr || decisions == nullptr || merges == nullptr ||
            targetsMutationEvents == nullptr) {
            event.status = "worker_invalid";
            break;
        }
        const auto required =
            leshy1::kernel::runtime::resourceMask(Resource::Storage) |
            leshy1::kernel::runtime::resourceMask(Resource::RadioSpi);
        const auto owned = appRuntime.activeResources();
        if ((owned & required) != required) {
            event.status = "resources_missing";
            break;
        }
        if (!loadProductFingerprint(event.expectedFingerprint,
                                    sizeof(event.expectedFingerprint)) ||
            !exactCidFingerprint(event.expectedFingerprint)) {
            event.status = "enrollment_missing";
            break;
        }

        leshy1::storage::SdTransportRunResult identity{};
        for (std::uint8_t attempt = 1;
             attempt <= leshy1::storage::kProductStartMaximumIdentityAttempts;
             ++attempt) {
            BoardSdSpiTransport transport;
            const bool begun = transport.begin();
            identity = {};
            if (begun) {
                leshy1::storage::SdTransportRunPolicy policy;
                policy.allowPhysical = true;
                policy.explicitlySelected = true;
                policy.identificationOnly = true;
                policy.ownedResources = owned;
                identity = leshy1::storage::runSdIdentificationStateMachine(
                    leshy1::storage::defaultSdIdentificationPlan(), transport,
                    policy);
                transport.end();
            }
            event.identityAttempts = attempt;
            event.identityTransientRetries =
                static_cast<std::uint8_t>(attempt - 1U);
            identityCleanupComplete = transport.cleanupComplete();
            formatCidFingerprint(identity.identity, event.observedFingerprint,
                                 sizeof(event.observedFingerprint));
            if (identityCleanupComplete &&
                identity.status ==
                    leshy1::storage::SdTransportRunStatus::Valid) {
                break;
            }
            const leshy1::storage::ProductStartIdentityRetryEvidence evidence{
                true,
                true,
                true,
                true,
                transport.physicalSpiStarted(),
                identity.status,
                std::strcmp(event.observedFingerprint,
                            "00000000000000000000000000000000") == 0,
                identityCleanupComplete,
                false,
            };
            if (!leshy1::storage::shouldRetryProductStartIdentity(
                    evidence, attempt)) {
                break;
            }
            vTaskDelay(pdMS_TO_TICKS(
                leshy1::storage::productStartIdentityRetryDelayMs(attempt)));
        }
        if (!identityCleanupComplete ||
            identity.status != leshy1::storage::SdTransportRunStatus::Valid) {
            event.status = "identity_failed";
            break;
        }
        if (std::strcmp(event.expectedFingerprint,
                        event.observedFingerprint) != 0) {
            event.status = "fingerprint_mismatch";
            break;
        }
        if (!supervisedCheckpoint()) {
            event.status = "safety_worker_deadline";
            break;
        }

        event.heapFreeBeforeMount = static_cast<std::uint32_t>(
            heap_caps_get_free_size(MALLOC_CAP_8BIT));
        event.heapLargestBeforeMount = static_cast<std::uint32_t>(
            heap_caps_get_largest_free_block(MALLOC_CAP_8BIT));
        filesystemAttempted = true;
        if (!filesystem.begin()) {
            event.filesystemMountError = filesystem.mountError();
            event.status = "mount_failed";
            break;
        }
        // FatFs needs the largest contiguous heap block during mount.  The
        // 24.8-KiB decision-state codec is not needed until after admission;
        // allocating it first made the real correlation review path fail at
        // 29.7 KiB even though total free heap was sufficient.  Mount first,
        // then allocate the codec before opening a writable store or issuing
        // any physical write.
        workspace = acquireTargetsStoreCodecWorkspace();
        if (workspace == nullptr) {
            event.status = "shared_codec_unavailable_after_mount";
            break;
        }
        if (!supervisedCheckpoint()) {
            event.status = "safety_worker_deadline";
            break;
        }
        event.filesystemMountError = filesystem.mountError();
        const std::uint64_t cardCapacity = filesystem.cardCapacityBytes();
        leshy1::storage::MediaIdentity media;
        media.present = cardCapacity != 0 &&
            cardCapacity == identity.identity.capacityBytes;
        media.kind = leshy1::storage::MediaKind::Sd;
        media.fingerprint = event.observedFingerprint;
        media.capacityBytes = cardCapacity;
        media.freeBytes = filesystem.cachedFreeBytes();
        leshy1::storage::ProductStoreRequest request;
        request.operation =
            leshy1::storage::ProductStoreOperation::CommitSession;
        request.explicitlySelected = true;
        request.expectedFingerprint = event.expectedFingerprint;
        request.rootPath = leshy1::storage::kProductSessionStoreRoot;
        request.rootExists = knownProductSessionRootExists(
            event.observedFingerprint);
        request.driverWriteEnabled = true;
        request.requiredBytes = kProductSurveyCommitBytes;
        request.reserveBytes = kProductSurveyReserveBytes;
        request.ownedResources = owned;
        request.power = powerSafetyPolicy.writeDisposition();
        const auto permit = leshy1::storage::authorizeProductStore(
            media, request);
        if (!permit.allowed()) {
            event.status =
                leshy1::storage::productStoreAccessStatusName(permit.status);
            break;
        }
        io = new (std::nothrow) ArduinoFsSessionStoreIo(
            filesystem.driveNumber(), sdSessionStoreIoWorkspace,
            supervisedCheckpoint, &protectedDataCipher, &deviceLock);
        if (io == nullptr) {
            event.status = "io_workspace_unavailable";
            break;
        }
        if (!io->openExistingWritable(permit)) {
            event.status = "open_failed";
            break;
        }
        if (!supervisedCheckpoint()) {
            event.status = "safety_worker_deadline";
            break;
        }

