anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
        if (event.merge) {
            TargetMergeAction action{};
            action.kind = event.mergeKind;
            action.operationId = event.mergeOperationId;
            action.destinationId = event.targetId;
            action.sourceId = event.mergeSourceId;
            const auto* destination = catalog->find(event.targetId);
            const auto* source = catalog->find(event.mergeSourceId);
            action.expectedDestinationRevision = destination == nullptr
                ? 0U : destination->revision;
            action.expectedSourceRevision = source == nullptr
                ? 0U : source->revision;
            TargetMergeService service(*catalog, *merges);
            const auto applied = service.execute(action);
            event.mergeStatus = applied.status;
            if (!applied.applied()) {
                event.status = leshy1::domain::targets::targetMergeStatusName(
                    applied.status);
                break;
            }
        } else if (event.correlation) {
            if (!targetsComparisonLoaded ||
                targetsBaselineBinding.session == nullptr ||
                targetsCurrentBinding.session == nullptr) {
                event.status = "correlation_sessions_unavailable";
                break;
            }
            leshy1::domain::targets::TargetComparisonSource baselineSource{};
            leshy1::domain::targets::TargetComparisonSource currentSource{};
            if (!leshy1::services::targets::sourceIdForSession(
                    *targetsBaselineBinding.session, &baselineSource.id) ||
                !leshy1::services::targets::sourceIdForSession(
                    *targetsCurrentBinding.session, &currentSource.id)) {
                event.status = "correlation_sources_unavailable";
                break;
            }
            baselineSource.generation = targetsBaselineBinding.generation;
            currentSource.generation = targetsCurrentBinding.generation;
            SurveySessionTargetEvidenceLookup lookup(
                {baselineSource, targetsBaselineBinding.session},
                {currentSource, targetsCurrentBinding.session});
            CorrelationService service(*catalog, *decisions, lookup);
            CorrelationAction action{};
            action.kind = event.correlationKind;
            action.proposal = targetsMutationProposal;
            const auto* target = catalog->find(action.proposal.targetId);
            action.expectedTargetRevision = target == nullptr
                ? 0U : target->revision;
            const auto applied = service.execute(action);
            event.correlationStatus = applied.status;
            if ((event.correlationKind == CorrelationActionKind::Accept &&
                 applied.status != CorrelationDecisionStatus::Accepted) ||
                (event.correlationKind == CorrelationActionKind::Reject &&
                 applied.status != CorrelationDecisionStatus::Rejected)) {
                event.status =
                    leshy1::services::targets::correlationDecisionStatusName(
                        applied.status);
                break;
            }
        } else {
            TargetAction action;
            action.kind = event.actionKind;
            action.targetId = event.targetId;
            action.expectedRevision = event.expectedRevision;
            action.favorite = event.favorite;
            if ((event.actionKind == TargetActionKind::SetName ||
                 event.actionKind == TargetActionKind::SetNotes ||
                 event.actionKind == TargetActionKind::AddTag ||
                 event.actionKind == TargetActionKind::RemoveTag) &&
                !leshy1::services::targets::setTargetActionText(
                    &action, event.name.data(), event.nameLength)) {
                event.status = "text_invalid";
                break;
            }
            TargetService service(*catalog);
            const auto applied = service.execute(action);
            if (!applied.applied()) {
                event.status =
                    leshy1::domain::targets::targetMutationStatusName(
                        applied.status);
                break;
            }
        }
        if (!supervisedCheckpoint()) {
            event.status = "safety_worker_deadline";
            break;
        }
        if (targetsStateGeneration == UINT32_MAX ||
            (targetsStateGeneration != 0 &&
             targetsStateHead != leshy1::storage::RecoveryChoice::A &&
             targetsStateHead != leshy1::storage::RecoveryChoice::B)) {
            event.status = "state_generation_invalid";
            break;
        }
        const std::uint32_t nextGeneration =
            targetsStateGeneration == 0 ? 1U : targetsStateGeneration + 1U;
        const leshy1::storage::HeadSlot nextHead =
            targetsStateGeneration == 0 ||
                    targetsStateHead == leshy1::storage::RecoveryChoice::B
                ? leshy1::storage::HeadSlot::A
                : leshy1::storage::HeadSlot::B;
        const auto committed = leshy1::storage::commitTargetProductState(
            *io, *workspace, *catalog, *decisions, *merges, nextGeneration,
            nextHead);
        event.storeStatus = committed.status;
        event.commitStage = committed.stage;
        if (!supervisedCheckpoint()) {
            event.status = "safety_worker_deadline";
            break;
        }
        const auto recovered = leshy1::storage::recoverTargetProductState(
            *io, *workspace, catalog, decisions, merges);
        if (!supervisedCheckpoint()) {
            event.status = "safety_worker_deadline";
            break;
        }
        event.catalogRecovered = recovered.valid();
        if (recovered.valid()) {
            event.generation = recovered.generation;
            event.head = recovered.choice;
        }
        const auto* reopened = catalog->find(event.targetId);
        if (reopened != nullptr) event.targetRevision = reopened->revision;
        bool tagReopened = false;
        if (reopened != nullptr &&
            (event.actionKind == TargetActionKind::AddTag ||
             event.actionKind == TargetActionKind::RemoveTag)) {
            for (std::size_t index = 0; index < reopened->tagCount; ++index) {
                if (reopened->tagLengths[index] == event.nameLength &&
                    std::memcmp(reopened->tags[index].data(),
                                event.name.data(), event.nameLength) == 0) {
                    tagReopened = true;
                    break;
                }
            }
        }
        bool valueReopened = false;
        if (event.merge) {
            const auto* record = merges->find(event.mergeOperationId);
            if (record != nullptr && event.mergeKind ==
                                      TargetMergeActionKind::Merge) {
                const auto* destination = catalog->find(
                    record->destinationBefore.id);
                const auto* source = catalog->find(record->sourceBefore.id);
                valueReopened = !record->split && destination != nullptr &&
                    source == nullptr;
            } else if (record != nullptr && event.mergeKind ==
                                             TargetMergeActionKind::Split) {
                const auto* destination = catalog->find(
                    record->destinationBefore.id);
                const auto* source = catalog->find(record->sourceBefore.id);
                valueReopened = record->split && destination != nullptr &&
                    source != nullptr &&
                    leshy1::domain::targets::targetRecordGraphEqual(
                        *destination, record->destinationBefore) &&
                    leshy1::domain::targets::targetRecordGraphEqual(
                        *source, record->sourceBefore);
            }
        } else if (event.correlation) {
            const auto* decision = decisions->find(targetsMutationProposal);
            const auto* candidate = catalog->findByIdentity(
                targetsMutationProposal.candidateIdentity);
            const bool decisionReopened = decision != nullptr &&
                decision->decision ==
                    (event.correlationKind == CorrelationActionKind::Accept
                         ? CorrelationDecision::Accept
                         : CorrelationDecision::Reject);
            const bool ownershipReopened =
                event.correlationKind == CorrelationActionKind::Accept
                ? candidate != nullptr &&
                    leshy1::domain::targets::targetIdEqual(
                        candidate->id, targetsMutationProposal.targetId)
                : candidate == nullptr;
            valueReopened = decisionReopened && ownershipReopened;
        } else if (reopened != nullptr) {
            if (event.actionKind == TargetActionKind::SetFavorite) {
                valueReopened = reopened->favorite == event.favorite;
            } else if (event.actionKind == TargetActionKind::SetName) {
                valueReopened = reopened->nameLength == event.nameLength &&
                    std::memcmp(reopened->name.data(), event.name.data(),
                                event.nameLength) == 0;
            } else if (event.actionKind == TargetActionKind::SetNotes) {
                valueReopened = reopened->notesLength == event.nameLength &&
                    std::memcmp(reopened->notes.data(), event.name.data(),
                                event.nameLength) == 0;
            } else if (event.actionKind == TargetActionKind::AddTag) {
                valueReopened = tagReopened;
            } else if (event.actionKind == TargetActionKind::RemoveTag) {
                valueReopened = !tagReopened;
            }
        }
        event.persisted = committed.complete() && recovered.valid() &&
            recovered.generation == committed.generation && valueReopened;
        event.status = event.persisted
            ? "saved"
            : (committed.complete()
                   ? "reopen_failed"
                   : leshy1::storage::targetStateStoreStatusName(
                         committed.status));
    } while (false);

    if (io != nullptr) {
        event.bytesWritten = io->bytesWritten();
        event.writeCalls = io->writeCalls();
        event.fileSyncs = io->fileSyncs();
        event.directorySyncs = io->directorySyncs();
        io->end();
    }
    delete io;
    releaseTargetsStoreCodecWorkspace(workspace);
    workspace = nullptr;
    if (filesystem.mounted()) filesystem.end();
    const bool filesystemCleanup = !filesystemAttempted ||
        filesystem.cleanupComplete();
    event.cleanupComplete = identityCleanupComplete && filesystemCleanup &&
        !filesystem.mounted();
    if (!event.cleanupComplete) {
        event.persisted = false;
        event.status = "cleanup_failed";
    }
    if (targetsStoreDeadlineCancelled()) {
        event.persisted = false;
        event.status = "safety_worker_deadline";
    }
    if (deadlineArmed) disarmTargetsStoreDeadline();
    resetTargetsStoreDeadlineCancel();
    const std::uint64_t finishedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    event.elapsedUs = finishedUs >= startedUs ? finishedUs - startedUs : 0;
    if (targetsMutationEvents != nullptr) {
        xQueueOverwrite(targetsMutationEvents, &event);
    }
    vTaskDelete(nullptr);
}

bool requestTargetsMutationExact(const TargetAction& action,
                                 bool companionRequest,
                                 bool companionWebRequest = false) {
    if (!deviceLockOperationAllowed(
            companionRequest
                ? leshy1::services::security::DeviceLockOperation::Companion
                : leshy1::services::security::
                      DeviceLockOperation::ProtectedEvidence)) {
        targetsMutationState = TargetsMutationState::Failed;
        targetsMutationStatus = "device_locked";
        noteDeviceLockAdmissionBlocked();
        return true;
    }
    const std::uint64_t actionStartedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    TargetCatalog* activeCatalog = targetsProductRuntime == nullptr
        ? (companionWebRequest ? webCompanionCatalog : nullptr)
        : &targetsProductRuntime->workspace.catalog;
    if (activeCatalog == nullptr ||
        targetsMutationState == TargetsMutationState::Saving) {
        return false;
    }
    const bool basicAction = action.kind == TargetActionKind::SetFavorite ||
        action.kind == TargetActionKind::SetName ||
        action.kind == TargetActionKind::SetNotes ||
        action.kind == TargetActionKind::AddTag ||
        action.kind == TargetActionKind::RemoveTag;
    if (!basicAction) return false;
    TargetService previewService(*activeCatalog);
    const auto preview = previewService.preview(action);
    if (preview.status !=
        leshy1::domain::targets::TargetMutationStatus::Applied) {
        targetsMutationState = TargetsMutationState::Failed;
        targetsMutationStatus =
            leshy1::domain::targets::targetMutationStatusName(preview.status);
        lastRuntimeEvent = "targets_store_preview_failed";
        return true;
    }
    if (targetsMergeFixtureRuntime) {
        targetsMutationState = TargetsMutationState::Failed;
        targetsMutationStatus = "fixture_merge_split_only";
        lastRuntimeEvent = targetsMutationStatus;
        return true;
    }
    if (powerSafetyPolicy.writeDisposition() ==
        PowerWriteDisposition::ProhibitedLowVoltage) {
        targetsMutationState = TargetsMutationState::Failed;
        targetsMutationStatus = "power_unsafe";
        lastRuntimeEvent = "targets_store_power_unsafe";
        return true;
    }
    if (targetsMutationEvents == nullptr ||
        targetsMutationTaskHandle != nullptr ||
        targetsMutationCatalog != nullptr ||
        targetsMutationDecisions != nullptr ||
        targetsMutationMerges != nullptr) {
        targetsMutationState = TargetsMutationState::Failed;
        targetsMutationStatus = "worker_unavailable";
        lastRuntimeEvent = "targets_store_worker_unavailable";
        return true;
    }
    targetsMutationTargetId = action.targetId;
    targetsMutationCorrelation = false;
    targetsMutationMerge = false;
    targetsMutationProposal = {};
    targetsMutationKind = action.kind;
    targetsMutationFavorite = action.favorite;
    targetsMutationExpectedRevision = action.expectedRevision;
    targetsMutationCompanion = companionRequest;
    targetsMutationCompanionWeb = companionRequest && companionWebRequest;
    targetsMutationText.fill('\0');
    targetsMutationTextLength = 0;
    if (action.kind == TargetActionKind::SetName ||
        action.kind == TargetActionKind::SetNotes ||
        action.kind == TargetActionKind::AddTag ||
        action.kind == TargetActionKind::RemoveTag) {
        const bool tagAction = action.kind == TargetActionKind::AddTag ||
            action.kind == TargetActionKind::RemoveTag;
        const std::size_t maximum = tagAction
            ? TargetRecord::kTagCapacity
            : action.kind == TargetActionKind::SetNotes
                  ? TargetRecord::kNotesCapacity
                  : TargetRecord::kNameCapacity;
        if (action.textLength > maximum ||
            (tagAction && action.textLength == 0)) {
            targetsMutationState = TargetsMutationState::Failed;
            targetsMutationStatus = tagAction
                ? "tag_invalid"
                : action.kind == TargetActionKind::SetNotes
                      ? "notes_invalid" : "name_invalid";
            lastRuntimeEvent = tagAction
                ? "targets_store_tag_invalid"
                : action.kind == TargetActionKind::SetNotes
                      ? "targets_store_notes_invalid"
                      : "targets_store_name_invalid";
            return true;
        }
        if (action.textLength != 0) {
            std::memcpy(targetsMutationText.data(), action.text.data(),
                        action.textLength);
        }
        targetsMutationTextLength = action.textLength;
    }
    targetsMutationReport = {};
    const bool detached = companionWebRequest &&
            targetsProductRuntime == nullptr &&
            webCompanionTargetsSuspended()
        ? ([&]() {
              targetsMutationCatalog = webCompanionCatalog;
              targetsMutationDecisions = webCompanionDecisions;
              targetsMutationMerges = webCompanionMerges;
              webCompanionCatalog = nullptr;
              webCompanionDecisions = nullptr;
              webCompanionMerges = nullptr;
              delete webCompanionComparison;
              webCompanionComparison = nullptr;
              return true;
          })()
        : detachTargetsProductState(targetsMutationCatalog,
                                    targetsMutationDecisions,
                                    targetsMutationMerges);
    if (!detached) {
        targetsMutationState = TargetsMutationState::Failed;
        targetsMutationStatus = "workspace_unavailable";
        lastRuntimeEvent = "targets_store_workspace_unavailable";
        return true;
    }
    targetsMutationState = TargetsMutationState::Saving;
    targetsMutationStatus = "saving";
    const bool started = xTaskCreatePinnedToCore(
        runTargetsMutationWorker, "leshy-targets-store",
        kTargetsStoreTaskStackBytes, nullptr, 1,
        &targetsMutationTaskHandle, 0) == pdPASS;
    targetsMutationStartActionUs =
        static_cast<std::uint64_t>(esp_timer_get_time()) - actionStartedUs;
    if (!started) {
        targetsMutationTaskHandle = nullptr;
        rebuildTargetsProductFromCatalog(targetsMutationCatalog,
                                         targetsMutationDecisions,
                                         targetsMutationMerges,
                                         targetsMutationTargetId, true);
        delete targetsMutationCatalog;
        delete targetsMutationDecisions;
        targetsMutationCatalog = nullptr;
        targetsMutationDecisions = nullptr;
        delete targetsMutationMerges;
        targetsMutationMerges = nullptr;
        targetsMutationState = TargetsMutationState::Failed;
        targetsMutationStatus = "worker_unavailable";
        lastRuntimeEvent = "targets_store_worker_unavailable";
    } else {
        targetsProductStatus = "saving";
        lastRuntimeEvent = "targets_store_saving";
    }
    return true;
}

