anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
bool requestTargetsMutation(TargetActionKind kind, bool favorite,
                            const char* text, std::size_t textLength) {
    if (targetsProductRuntime == nullptr ||
        (targetsProductRuntime->controller.view() != TargetsView::Actions &&
         targetsProductRuntime->controller.view() != TargetsView::NameEdit &&
         targetsProductRuntime->controller.view() != TargetsView::TagList &&
         targetsProductRuntime->controller.view() != TargetsView::TagEdit &&
         targetsProductRuntime->controller.view() != TargetsView::NotesEdit)) {
        return false;
    }
    const auto* selected =
        targetsProductRuntime->controller.selectedTarget();
    if (selected == nullptr) return false;
    TargetAction action{};
    action.kind = kind;
    action.targetId = selected->id;
    action.expectedRevision = selected->revision;
    action.favorite = favorite;
    if ((kind == TargetActionKind::SetName ||
         kind == TargetActionKind::SetNotes ||
         kind == TargetActionKind::AddTag ||
         kind == TargetActionKind::RemoveTag) &&
        !leshy1::services::targets::setTargetActionText(
            &action, text, textLength)) {
        targetsMutationState = TargetsMutationState::Failed;
        targetsMutationStatus = "text_invalid";
        lastRuntimeEvent = "targets_store_text_invalid";
        return true;
    }
    return requestTargetsMutationExact(action, false);
}

bool requestTargetsCorrelationMutation(CorrelationActionKind kind) {
    if (!deviceLockOperationAllowed(
            leshy1::services::security::
                DeviceLockOperation::ProtectedEvidence)) {
        targetsMutationState = TargetsMutationState::Failed;
        targetsMutationStatus = "device_locked";
        noteDeviceLockAdmissionBlocked();
        return true;
    }
    const std::uint64_t actionStartedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (targetsProductRuntime == nullptr ||
        targetsProductRuntime->controller.view() !=
            TargetsView::CorrelationReview ||
        targetsProductRuntime->controller.correlationReviewSelection() < 2 ||
        targetsMutationState == TargetsMutationState::Saving) {
        return false;
    }
    const auto* proposal =
        targetsProductRuntime->controller.reviewedCorrelationProposal();
    if (proposal == nullptr) return false;
    if (targetsMergeFixtureRuntime) {
        targetsMutationState = TargetsMutationState::Failed;
        targetsMutationStatus = "fixture_merge_split_only";
        lastRuntimeEvent = targetsMutationStatus;
        return true;
    }
    if (powerSafetyPolicy.writeDisposition() ==
        PowerWriteDisposition::ProhibitedLowVoltage) {
        targetsMutationState = TargetsMutationState::Failed;
        targetsMutationStatus = "power_unsafe";
        lastRuntimeEvent = "targets_store_power_unsafe";
        return true;
    }
    if (targetsMutationEvents == nullptr ||
        targetsMutationTaskHandle != nullptr ||
        targetsMutationCatalog != nullptr ||
        targetsMutationDecisions != nullptr ||
        targetsMutationMerges != nullptr) {
        targetsMutationState = TargetsMutationState::Failed;
        targetsMutationStatus = "worker_unavailable";
        lastRuntimeEvent = "targets_store_worker_unavailable";
        return true;
    }
    targetsMutationCorrelation = true;
    targetsMutationMerge = false;
    targetsMutationCompanion = false;
    targetsMutationCompanionWeb = false;
    targetsMutationExpectedRevision = 0;
    targetsMutationCorrelationKind = kind;
    targetsMutationProposal = *proposal;
    targetsMutationTargetId = proposal->targetId;
    targetsMutationText.fill('\0');
    targetsMutationTextLength = 0;
    targetsMutationReport = {};
    if (!detachTargetsProductState(targetsMutationCatalog,
                                   targetsMutationDecisions,
                                   targetsMutationMerges)) {
        targetsMutationState = TargetsMutationState::Failed;
        targetsMutationStatus = "workspace_unavailable";
        lastRuntimeEvent = "targets_store_workspace_unavailable";
        return true;
    }
    targetsMutationState = TargetsMutationState::Saving;
    targetsMutationStatus = "saving";
    const bool started = xTaskCreatePinnedToCore(
        runTargetsMutationWorker, "leshy-targets-store",
        kTargetsStoreTaskStackBytes, nullptr, 1,
        &targetsMutationTaskHandle, 0) == pdPASS;
    targetsMutationStartActionUs =
        static_cast<std::uint64_t>(esp_timer_get_time()) - actionStartedUs;
    if (!started) {
        targetsMutationTaskHandle = nullptr;
        rebuildTargetsProductFromCatalog(
            targetsMutationCatalog, targetsMutationDecisions,
            targetsMutationMerges,
            targetsMutationTargetId, true);
        delete targetsMutationCatalog;
        delete targetsMutationDecisions;
        targetsMutationCatalog = nullptr;
        targetsMutationDecisions = nullptr;
        delete targetsMutationMerges;
        targetsMutationMerges = nullptr;
        targetsMutationState = TargetsMutationState::Failed;
        targetsMutationStatus = "worker_unavailable";
        lastRuntimeEvent = "targets_store_worker_unavailable";
    } else {
        targetsProductStatus = "saving";
        lastRuntimeEvent = "targets_correlation_saving";
    }
    return true;
}

bool requestTargetsMergeMutation() {
    if (!deviceLockOperationAllowed(
            leshy1::services::security::
                DeviceLockOperation::ProtectedEvidence)) {
        targetsMutationState = TargetsMutationState::Failed;
        targetsMutationStatus = "device_locked";
        noteDeviceLockAdmissionBlocked();
        return true;
    }
    const std::uint64_t actionStartedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (targetsProductRuntime == nullptr ||
        (targetsProductRuntime->controller.view() != TargetsView::MergeConfirm &&
         targetsProductRuntime->controller.view() != TargetsView::SplitConfirm) ||
        targetsMutationState == TargetsMutationState::Saving) {
        return false;
    }
    TargetsController& controller = targetsProductRuntime->controller;
    const auto* destination = controller.selectedTarget();
    if (destination == nullptr) return false;
    const bool split = controller.view() == TargetsView::SplitConfirm;
    const auto* active = activeTargetMerge(targetsProductRuntime->merges,
                                           destination->id);
    const auto* candidate = split ? nullptr : controller.selectedMergeCandidate();
    if ((split && active == nullptr) || (!split && candidate == nullptr)) {
        return false;
    }
    if (powerSafetyPolicy.writeDisposition() ==
        PowerWriteDisposition::ProhibitedLowVoltage) {
        targetsMutationState = TargetsMutationState::Failed;
        targetsMutationStatus = "power_unsafe";
        lastRuntimeEvent = "targets_store_power_unsafe";
        return true;
    }
    if (targetsMutationEvents == nullptr ||
        targetsMutationTaskHandle != nullptr ||
        targetsMutationCatalog != nullptr ||
        targetsMutationDecisions != nullptr ||
        targetsMutationMerges != nullptr) {
        targetsMutationState = TargetsMutationState::Failed;
        targetsMutationStatus = "worker_unavailable";
        lastRuntimeEvent = "targets_store_worker_unavailable";
        return true;
    }
    targetsMutationTargetId = destination->id;
    targetsMutationMergeSourceId = split
        ? active->sourceBefore.id : candidate->targetId;
    targetsMutationMergeOperationId = split
        ? active->id : newTargetMergeOperationId();
    targetsMutationMergeKind = split ? TargetMergeActionKind::Split
                                     : TargetMergeActionKind::Merge;
    targetsMutationMerge = true;
    targetsMutationCorrelation = false;
    targetsMutationCompanion = false;
    targetsMutationCompanionWeb = false;
    targetsMutationExpectedRevision = 0;
    targetsMutationText.fill('\0');
    targetsMutationTextLength = 0;
    targetsMutationReport = {};
    if (!detachTargetsProductState(targetsMutationCatalog,
                                   targetsMutationDecisions,
                                   targetsMutationMerges)) {
        targetsMutationState = TargetsMutationState::Failed;
        targetsMutationStatus = "workspace_unavailable";
        lastRuntimeEvent = "targets_store_workspace_unavailable";
        return true;
    }
    targetsMutationState = TargetsMutationState::Saving;
    targetsMutationStatus = "saving";
    if (targetsMergeFixtureRuntime) {
        recordTargetsMergeFixtureMutationStage(
            TargetsMergeFixtureMutationStage::Queued, false);
    }
    const bool started = xTaskCreatePinnedToCore(
        targetsMergeFixtureRuntime
            ? runTargetsMergeFixtureMutationWorker
            : runTargetsMutationWorker,
        "leshy-targets-store", kTargetsStoreTaskStackBytes, nullptr, 1,
        &targetsMutationTaskHandle, 0) == pdPASS;
    targetsMutationStartActionUs =
        static_cast<std::uint64_t>(esp_timer_get_time()) - actionStartedUs;
    if (!started) {
        if (targetsMergeFixtureRuntime) {
            recordTargetsMergeFixtureMutationStage(
                TargetsMergeFixtureMutationStage::Idle, false);
        }
        targetsMutationTaskHandle = nullptr;
        rebuildTargetsProductFromCatalog(
            targetsMutationCatalog, targetsMutationDecisions,
            targetsMutationMerges, targetsMutationTargetId, true);
        delete targetsMutationCatalog;
        delete targetsMutationDecisions;
        delete targetsMutationMerges;
        targetsMutationCatalog = nullptr;
        targetsMutationDecisions = nullptr;
        targetsMutationMerges = nullptr;
        targetsMutationState = TargetsMutationState::Failed;
        targetsMutationStatus = "worker_unavailable";
        lastRuntimeEvent = "targets_store_worker_unavailable";
    } else {
        targetsProductStatus = "saving";
        lastRuntimeEvent = split ? "targets_split_saving"
                                 : "targets_merge_saving";
    }
    return true;
}

bool requestTargetsFavoriteMutation() {
    if (targetsProductRuntime == nullptr ||
        targetsProductRuntime->controller.view() != TargetsView::Actions ||
        targetsProductRuntime->controller.selectedAction() !=
            TargetActionItem::Favorite) {
        return false;
    }
    const auto* selected = targetsProductRuntime->controller.selectedTarget();
    return selected != nullptr && requestTargetsMutation(
        TargetActionKind::SetFavorite, !selected->favorite, nullptr, 0);
}

bool requestTargetsNameMutation() {
    if (targetsProductRuntime == nullptr ||
        targetsProductRuntime->controller.view() != TargetsView::NameEdit ||
        !targetsProductRuntime->controller.nameEditorDirty()) {
        return false;
    }
    return requestTargetsMutation(
        TargetActionKind::SetName, false,
        targetsProductRuntime->controller.nameEditorText(),
        targetsProductRuntime->controller.nameEditorLength());
}

