anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
bool parseLittleFsResetCommand(const char* command, const char* prefix,
                               char* fingerprint,
                               std::size_t fingerprintCapacity, char* runId,
                               std::size_t runIdCapacity,
                               unsigned* boundaryNumber) {
    if (command == nullptr || prefix == nullptr || fingerprint == nullptr ||
        runId == nullptr || boundaryNumber == nullptr ||
        fingerprintCapacity < 65 || runIdCapacity < 33 ||
        std::strncmp(command, prefix, std::strlen(prefix)) != 0) {
        return false;
    }
    char extra = '\0';
    unsigned parsedBoundary = 0;
    const int parsed = std::sscanf(
        command + std::strlen(prefix),
        "%64[0-9a-fA-F] %32[A-Za-z0-9_-] %u %c", fingerprint, runId,
        &parsedBoundary, &extra);
    if (parsed != 3 || std::strlen(fingerprint) != 64 || runId[0] == '\0' ||
        !leshy1::storage::isSessionStoreBoundary(
            resetBoundaryStage(parsedBoundary))) {
        return false;
    }
    *boundaryNumber = parsedBoundary;
    return true;
}

bool parseTargetsMergeFixtureCommand(
    const char* command, const char* prefix, char* fingerprint,
    std::size_t fingerprintCapacity, char* runId,
    std::size_t runIdCapacity) {
    if (command == nullptr || prefix == nullptr || fingerprint == nullptr ||
        runId == nullptr || fingerprintCapacity < 65 || runIdCapacity < 33 ||
        std::strncmp(command, prefix, std::strlen(prefix)) != 0) {
        return false;
    }
    char confirmation[8] = {};
    char extra = '\0';
    const int parsed = std::sscanf(
        command + std::strlen(prefix),
        "%64[0-9a-fA-F] %32[A-Za-z0-9_-] %7s %c", fingerprint, runId,
        confirmation, &extra);
    return parsed == 3 &&
        targetsMergeFixtureFingerprintValid(fingerprint) &&
        targetsMergeFixtureRunIdValid(runId) &&
        std::strcmp(confirmation, "confirm") == 0;
}

void emitTargetsMergeFixtureState(Stream& reply) {
    const bool armed = targetsMergeFixtureRtcState.magic ==
        kTargetsMergeFixtureRtcMagic;
    const bool continuityValid = armed &&
        targetsMergeFixtureContinuityValid();
    const bool mutationStageValid =
        targetsMergeFixtureMutationStageValid();
    const auto mutationStage = mutationStageValid
        ? static_cast<TargetsMergeFixtureMutationStage>(
              targetsMergeFixtureRtcState.mutationStage)
        : TargetsMergeFixtureMutationStage::Idle;
    const bool mutationStackObserved = mutationStageValid &&
        targetsMergeFixtureRtcState.mutationWorkerStackMinimumFree !=
            UINT32_MAX;
    std::snprintf(
        sdPhysicalEvidence.line, sizeof(sdPhysicalEvidence.line),
        "{\"schema\":\"leshy.targets_merge_split_fixture.v1\","
        "\"kind\":\"state\",\"armed\":%s,\"continuity_valid\":%s,"
        "\"runtime_active\":%s,\"run_id\":\"%s\","
        "\"storage\":\"%s\",\"ota1_restore_required\":%s,"
        "\"reset_reason_code\":%u,"
        "\"mutation_stage\":\"%s\",\"mutation_stage_code\":%lu,"
        "\"mutation_stage_valid\":%s,"
        "\"mutation_worker_stack_observed\":%s,"
        "\"mutation_worker_stack_min_free\":%lu,"
        "\"sd_accessed\":%s,\"product_target_state_touched\":%s,"
        "\"radio_touched\":false,\"rf_tx_attempts\":0}",
        armed ? "true" : "false",
        continuityValid ? "true" : "false",
        targetsMergeFixtureRuntime ? "true" : "false",
        continuityValid ? targetsMergeFixtureRtcState.runId : "",
        armed ? "disposable_ota1" : "product_sd",
        armed ? "true" : "false",
        static_cast<unsigned>(esp_reset_reason()),
        targetsMergeFixtureMutationStageName(mutationStage),
        static_cast<unsigned long>(targetsMergeFixtureRtcState.mutationStage),
        mutationStageValid ? "true" : "false",
        mutationStackObserved ? "true" : "false",
        static_cast<unsigned long>(mutationStackObserved
            ? targetsMergeFixtureRtcState.mutationWorkerStackMinimumFree : 0),
        targetsMergeFixtureSdAccessed ? "true" : "false",
        targetsMergeFixtureProductStateTouched ? "true" : "false");
    reply.println(sdPhysicalEvidence.line);
}

void emitTargetsMergeFixturePrepare(Stream& reply,
                                    const char* expectedFingerprint,
                                    const char* runId) {
    char observedFingerprint[65] = {};
    const bool idleUi = uiController.isRoot() && !appRuntime.running() &&
        productSurveyControl() == ProductSurveyWorkerControl::Idle &&
        targetsMutationTaskHandle == nullptr;
    DisposableOtaLittleFs filesystem;
    const bool inspected = filesystem.inspect();
    const bool targetSafe = inspected && filesystem.safeInactiveTarget();
    const bool resourcesAcquired = idleUi && targetSafe &&
        resourceBroker.acquire(
            kLittleFsHilOwner,
            leshy1::kernel::runtime::resourceMask(Resource::Storage));
    const std::uint32_t ownedDuring =
        resourceBroker.ownedBy(kLittleFsHilOwner);
    const bool targetHashed = resourcesAcquired &&
        filesystem.hashTarget(observedFingerprint,
                              sizeof(observedFingerprint));
    const bool fingerprintMatched = targetHashed &&
        std::strcmp(expectedFingerprint, observedFingerprint) == 0;
    const bool mounted = fingerprintMatched &&
        filesystem.formatAndMountWritable();
    const std::uint64_t capacityBytes = mounted ? filesystem.totalBytes() : 0;
    const std::uint64_t freeBytes = mounted ? filesystem.freeBytes() : 0;
    char scratchPath[leshy1::storage::kScratchPathMax] = {};
    std::snprintf(scratchPath, sizeof(scratchPath), "%s%s",
                  leshy1::storage::kScratchRoot, runId);
    const bool scratchPreexisting = mounted &&
        filesystem.exists(scratchPath);

    leshy1::storage::MediaIdentity media;
    media.present = mounted && capacityBytes != 0 && freeBytes <= capacityBytes;
    media.kind = leshy1::storage::MediaKind::LittleFs;
    media.fingerprint = observedFingerprint;
    media.capacityBytes = capacityBytes;
    media.freeBytes = freeBytes;
    leshy1::storage::WriteRequest request;
    request.explicitlyDisposable = true;
    request.expectedFingerprint = expectedFingerprint;
    request.runId = runId;
    request.scratchExists = scratchPreexisting;
    request.requiredBytes = kTargetsMergeFixtureByteLimit;
    request.reserveBytes = 512U * 1024U;
    const auto permit = leshy1::storage::authorizeScratchWrite(media, request);

    const char* status = "target_not_inspected";
    if (!idleUi) {
        status = "ui_not_idle";
    } else if (!inspected) {
        status = "target_not_found";
    } else if (!targetSafe) {
        status = "target_not_inactive_ota1";
    } else if (!resourcesAcquired) {
        status = "resources_unavailable";
    } else if (!targetHashed) {
        status = "target_hash_failed";
    } else if (!fingerprintMatched) {
        status = "target_fingerprint_mismatch";
    } else if (!mounted) {
        status = "format_or_mount_failed";
    } else if (!permit.allowed()) {
        status = leshy1::storage::permitStatusName(permit.status);
    } else {
        status = "ready";
    }

    bool prepared = false;
    bool scratchCreated = false;
    const char* ioFailure = "not_started";
    int ioErrno = 0;
    if (std::strcmp(status, "ready") == 0) {
        ArduinoLittleFsSessionStoreIo io(filesystem);
        prepared = io.prepare(permit);
        scratchCreated = prepared && filesystem.exists(permit.scratchPath);
        ioFailure = io.lastFailure();
        ioErrno = io.lastErrno();
        io.end();
        if (!scratchCreated) status = "scratch_prepare_failed";
    }
    filesystem.end();
    resourceBroker.releaseAll(kLittleFsHilOwner);
    const std::uint32_t ownedAfter =
        resourceBroker.ownedBy(kLittleFsHilOwner);
    const bool cleanupComplete = filesystem.cleanupComplete() &&
        ownedAfter == 0;
    bool continuityArmed = false;
    if (std::strcmp(status, "ready") == 0 && cleanupComplete) {
        continuityArmed = armTargetsMergeFixtureContinuity(
            expectedFingerprint, runId);
        if (!continuityArmed) status = "continuity_arm_failed";
    } else if (!cleanupComplete && std::strcmp(status, "ready") == 0) {
        status = "cleanup_failed";
    }
    targetsMergeFixtureRuntime = false;
    targetsMergeFixtureSdAccessed = false;
    targetsMergeFixtureProductStateTouched = false;

    std::snprintf(
        sdPhysicalEvidence.line, sizeof(sdPhysicalEvidence.line),
        "{\"schema\":\"leshy.targets_merge_split_fixture.v1\","
        "\"kind\":\"prepared\",\"status\":\"%s\",\"run_id\":\"%s\","
        "\"expected_fingerprint\":\"%s\","
        "\"observed_fingerprint\":\"%s\",\"fingerprint_matched\":%s,"
        "\"target\":\"ota1\",\"target_address\":%lu,"
        "\"target_size\":%lu,\"target_inactive\":%s,"
        "\"format_performed\":%s,\"scratch_path\":\"%s\","
        "\"scratch_preexisting\":%s,\"scratch_created\":%s,"
        "\"permit_status\":\"%s\",\"byte_limit\":%llu,"
        "\"continuity_armed\":%s,\"cleanup_complete\":%s,"
        "\"owned_during\":%lu,\"owned_after\":%lu,"
        "\"io_failure\":\"%s\",\"io_errno\":%d,"
        "\"ota1_restore_required\":true,"
        "\"product_partition_touched\":false,\"sd_accessed\":false,"
        "\"product_target_state_touched\":false,\"nvs_touched\":false,"
        "\"radio_touched\":false,\"rf_tx_attempts\":0}",
        status, runId, expectedFingerprint, observedFingerprint,
        fingerprintMatched ? "true" : "false",
        static_cast<unsigned long>(filesystem.targetAddress()),
        static_cast<unsigned long>(filesystem.targetSize()),
        targetSafe ? "true" : "false",
        filesystem.formatted() ? "true" : "false",
        permit.allowed() ? permit.scratchPath : "",
        scratchPreexisting ? "true" : "false",
        scratchCreated ? "true" : "false",
        leshy1::storage::permitStatusName(permit.status),
        static_cast<unsigned long long>(permit.byteLimit),
        continuityArmed ? "true" : "false",
        cleanupComplete ? "true" : "false",
        static_cast<unsigned long>(ownedDuring),
        static_cast<unsigned long>(ownedAfter), ioFailure, ioErrno);
    reply.println(sdPhysicalEvidence.line);
}

