anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void emitTargetsMergeFixtureClear(Stream& reply,
                                  const char* expectedFingerprint,
                                  const char* runId) {
    const bool idleUi = uiController.isRoot() && !appRuntime.running() &&
        productSurveyControl() == ProductSurveyWorkerControl::Idle &&
        targetsMutationTaskHandle == nullptr;
    const bool continuityValid = targetsMergeFixtureContinuityValid();
    const bool identityMatched = continuityValid &&
        std::strcmp(expectedFingerprint,
                    targetsMergeFixtureRtcState.expectedFingerprint) == 0 &&
        std::strcmp(runId, targetsMergeFixtureRtcState.runId) == 0;
    const char* status = "cleared";
    if (!idleUi) {
        status = "ui_not_idle";
    } else if (!continuityValid) {
        status = "continuity_invalid";
    } else if (!identityMatched) {
        status = "fixture_identity_mismatch";
    } else {
        clearTargetsMergeFixtureContinuity();
        targetsMergeFixtureRuntime = false;
    }
    std::snprintf(
        sdPhysicalEvidence.line, sizeof(sdPhysicalEvidence.line),
        "{\"schema\":\"leshy.targets_merge_split_fixture.v1\","
        "\"kind\":\"cleared\",\"status\":\"%s\",\"run_id\":\"%s\","
        "\"identity_matched\":%s,\"continuity_disarmed\":%s,"
        "\"ota1_restore_required\":true,\"ota1_restored\":false,"
        "\"product_partition_touched\":false,\"sd_accessed\":false,"
        "\"product_target_state_touched\":false,\"nvs_touched\":false,"
        "\"radio_touched\":false,\"rf_tx_attempts\":0}",
        status, runId, identityMatched ? "true" : "false",
        std::strcmp(status, "cleared") == 0 ? "true" : "false");
    reply.println(sdPhysicalEvidence.line);
}

void emitLittleFsParity(Stream& reply, const char* expectedFingerprint,
                        const char* runId) {
    auto& line = sdPhysicalEvidence.line;
    auto& commitUs = sdPhysicalEvidence.commitUs;
    commitUs.fill(0);
    char observedFingerprint[65] = {};
    const bool idleUi = uiController.isRoot() && !appRuntime.running() &&
        productSurveyControl() == ProductSurveyWorkerControl::Idle;
    DisposableOtaLittleFs filesystem;
    const bool inspected = filesystem.inspect();
    const bool targetSafe = inspected && filesystem.safeInactiveTarget();
    const bool resourcesAcquired = idleUi && targetSafe &&
        resourceBroker.acquire(
            kLittleFsHilOwner,
            leshy1::kernel::runtime::resourceMask(Resource::Storage));
    const std::uint32_t ownedDuring =
        resourceBroker.ownedBy(kLittleFsHilOwner);
    const bool targetHashed = resourcesAcquired &&
        filesystem.hashTarget(observedFingerprint, sizeof(observedFingerprint));
    const bool fingerprintMatched = targetHashed &&
        std::strcmp(expectedFingerprint, observedFingerprint) == 0;
    const std::uint32_t heapFreeBefore = ESP.getFreeHeap();
    const std::uint64_t mountStartedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    const bool mounted = fingerprintMatched &&
        filesystem.formatAndMountWritable();
    const std::uint64_t mountUs = mounted
        ? static_cast<std::uint64_t>(esp_timer_get_time()) - mountStartedUs : 0;
    const std::uint64_t capacityBytes = mounted ? filesystem.totalBytes() : 0;
    const std::uint64_t freeBefore = mounted ? filesystem.freeBytes() : 0;
    const bool scratchPreexisting = mounted && filesystem.exists(
        leshy1::storage::kScratchRoot);

    leshy1::storage::MediaIdentity media;
    media.present = mounted && capacityBytes != 0 && freeBefore <= capacityBytes;
    media.kind = leshy1::storage::MediaKind::LittleFs;
    media.fingerprint = observedFingerprint;
    media.capacityBytes = capacityBytes;
    media.freeBytes = freeBefore;
    leshy1::storage::WriteRequest request;
    request.explicitlyDisposable = true;
    request.expectedFingerprint = expectedFingerprint;
    request.runId = runId;
    request.scratchExists = scratchPreexisting;
    request.requiredBytes = 1024U * 1024U;
    request.reserveBytes = 512U * 1024U;
    const leshy1::storage::WritePermit permit =
        leshy1::storage::authorizeScratchWrite(media, request);

    const char* status = "target_not_inspected";
    if (!idleUi) {
        status = "ui_not_idle";
    } else if (!inspected) {
        status = "target_not_found";
    } else if (!targetSafe) {
        status = "target_not_inactive_ota1";
    } else if (!resourcesAcquired) {
        status = "resources_unavailable";
    } else if (!targetHashed) {
        status = "target_hash_failed";
    } else if (!fingerprintMatched) {
        status = "target_fingerprint_mismatch";
    } else if (!mounted) {
        status = "format_or_mount_failed";
    } else if (!permit.allowed()) {
        status = "permit_rejected";
    } else {
        status = "ready";
    }

    std::size_t fixtureSegmentBytes = 0;
    const bool fixtureReady = std::strcmp(status, "ready") == 0 &&
        prepareBatchThroughputSession(&fixtureSegmentBytes);
    if (std::strcmp(status, "ready") == 0 && !fixtureReady) {
        status = "fixture_prepare_failed";
    }

    std::size_t commitsCompleted = 0;
    std::uint64_t bytesWritten = 0;
    std::uint32_t fileSyncs = 0;
    std::uint32_t directorySyncs = 0;
    const char* ioFailure = "not_started";
    int ioErrno = 0;
    bool prepared = false;
    leshy1::storage::SessionStoreRecoveryResult recoveryBeforeRemount;
    leshy1::storage::SessionStoreRecoveryResult recoveryAfterRemount;
    std::uint64_t freeAfter = freeBefore;
    if (fixtureReady) {
        ArduinoLittleFsSessionStoreIo io(filesystem);
        prepared = io.prepare(permit);
        if (!prepared || !filesystem.exists(permit.scratchPath)) {
            status = "scratch_prepare_failed";
        } else {
            for (std::size_t sample = 0; sample < kSdThroughputSamples;
                 ++sample) {
                const std::uint64_t started =
                    static_cast<std::uint64_t>(esp_timer_get_time());
                const leshy1::storage::SessionStoreCommitResult committed =
                    leshy1::storage::commitNextSession(
                        io, sessionStoreWorkspace(), librarySession);
                commitUs[sample] =
                    static_cast<std::uint64_t>(esp_timer_get_time()) - started;
                if (!committed.complete() ||
                    committed.generation != sample + 1U) {
                    status = "commit_failed";
                    break;
                }
                ++commitsCompleted;
            }
            if (commitsCompleted == kSdThroughputSamples) {
                recoveryBeforeRemount = leshy1::storage::recoverSession(
                    io, sessionStoreWorkspace(),
                    &sessionStoreWorkspace().validationSession);
                status = recoveryBeforeRemount.valid() &&
                                 recoveryBeforeRemount.generation ==
                                     kSdThroughputSamples &&
                                 recoveryBeforeRemount.observations ==
                                     SurveySession::kObservationCapacity
                    ? "awaiting_remount" : "pre_remount_recovery_failed";
            }
        }
        bytesWritten = io.bytesWritten();
        fileSyncs = io.fileSyncs();
        directorySyncs = io.directorySyncs();
        ioFailure = io.lastFailure();
        ioErrno = io.lastErrno();
        freeAfter = filesystem.freeBytes();
        io.end();
    }

