anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    filesystem.end();
    const bool writableCleanup = filesystem.cleanupComplete();
    bool remountedReadOnly = false;
    bool reopenedReadOnly = false;
    if (std::strcmp(status, "awaiting_remount") == 0) {
        remountedReadOnly = filesystem.mountReadOnly();
        if (remountedReadOnly && filesystem.exists(permit.scratchPath)) {
            ArduinoLittleFsSessionStoreIo readOnlyIo(filesystem);
            reopenedReadOnly = readOnlyIo.openExistingReadOnly(permit);
            if (reopenedReadOnly) {
                recoveryAfterRemount = leshy1::storage::recoverSession(
                    readOnlyIo, sessionStoreWorkspace(),
                    &sessionStoreWorkspace().validationSession);
            }
            readOnlyIo.end();
        }
        status = recoveryAfterRemount.valid() &&
                         recoveryAfterRemount.generation ==
                             kSdThroughputSamples &&
                         recoveryAfterRemount.observations ==
                             SurveySession::kObservationCapacity
            ? "valid" : "post_remount_recovery_failed";
    }
    filesystem.end();
    const bool cleanupComplete = writableCleanup && filesystem.cleanupComplete();
    resourceBroker.releaseAll(kLittleFsHilOwner);
    const std::uint32_t ownedAfter = resourceBroker.ownedBy(kLittleFsHilOwner);

    const leshy1::storage::StorageTimingSummary timings =
        leshy1::storage::summarizeStorageTimings(
            commitUs.data(), commitsCompleted);
    const std::uint64_t encodedPayloadBytesPerSecond =
        timings.valid && timings.totalUs != 0
            ? (static_cast<std::uint64_t>(fixtureSegmentBytes) *
               commitsCompleted * 1000000ULL) / timings.totalUs
            : 0;
    const bool storageRateTargetMet =
        encodedPayloadBytesPerSecond >=
            kStorageRequiredEncodedBytesPerSecond;
    const bool valid = std::strcmp(status, "valid") == 0 && targetSafe &&
        fingerprintMatched && mounted && filesystem.formatted() &&
        permit.allowed() && prepared &&
        commitsCompleted == kSdThroughputSamples && timings.valid &&
        bytesWritten != 0 && fileSyncs == kSdThroughputSamples * 3U &&
        directorySyncs == fileSyncs && remountedReadOnly && reopenedReadOnly &&
        storageRateTargetMet && cleanupComplete && ownedAfter == 0;
    if (!valid && std::strcmp(status, "valid") == 0) {
        status = "postcondition_failed";
    }
    const std::uint32_t heapFreeAfter = ESP.getFreeHeap();

    std::snprintf(
        line, sizeof(sdPhysicalEvidence.line),
        "{\"schema\":\"leshy.storage.littlefs.parity.v1\","
        "\"kind\":\"result\",\"status\":\"%s\","
        "\"explicitly_disposable\":true,\"target\":\"ota1\","
        "\"expected_fingerprint\":\"%s\","
        "\"observed_fingerprint\":\"%s\","
        "\"fingerprint_matched\":%s,\"run_id\":\"%s\","
        "\"target_address\":%lu,\"target_size\":%lu,"
        "\"running_address\":%lu,\"boot_address\":%lu,"
        "\"target_inactive\":%s,"
        "\"host_backup_fingerprint_confirmed\":%s,"
        "\"ota1_restore_required\":true,\"ota1_restored\":false,"
        "\"partition_table_modified\":false,"
        "\"product_partition_touched\":false,\"nvs_touched\":false,"
        "\"sd_accessed\":false,\"radio_touched\":false,"
        "\"format_allowed\":true,\"format_performed\":%s,"
        "\"mounted_writable\":%s,\"remounted_read_only\":%s,"
        "\"reopened_read_only\":%s,\"mount_us\":%llu,"
        "\"permit_status\":\"%s\",\"scratch_path\":\"%s\","
        "\"scratch_preexisting_after_format\":%s,"
        "\"byte_limit\":%llu,\"filesystem_capacity_bytes\":%llu,"
        "\"free_before\":%llu,\"free_after\":%llu,"
        "\"bytes_written\":%llu,\"file_syncs\":%lu,"
        "\"directory_syncs\":%lu,"
        "\"file_sync_covers_directory\":true,"
        "\"commit_samples_requested\":%u,"
        "\"commit_samples_completed\":%u,\"commit_total_us\":%llu,"
        "\"commit_min_us\":%llu,\"commit_p50_us\":%llu,"
        "\"commit_p95_us\":%llu,\"commit_p99_us\":%llu,"
        "\"commit_max_us\":%llu,\"fixture_observations\":%u,"
        "\"fixture_segment_bytes\":%u,"
        "\"encoded_payload_bytes_per_second\":%llu,"
        "\"required_encoded_bytes_per_second\":%llu,"
        "\"storage_rate_target_met\":%s,"
        "\"pre_remount_status\":\"%s\","
        "\"pre_remount_generation\":%lu,"
        "\"post_remount_status\":\"%s\","
        "\"post_remount_generation\":%lu,"
        "\"post_remount_observations\":%u,"
        "\"io_failure\":\"%s\",\"io_errno\":%d,"
        "\"owned_during\":%lu,\"owned_after\":%lu,"
        "\"cleanup_complete\":%s,\"heap_free_before\":%lu,"
        "\"heap_free_after\":%lu,\"heap_min_free\":%lu,"
        "\"reset_injection\":false,\"physical_power_cut\":false}",
        status, expectedFingerprint, observedFingerprint,
        fingerprintMatched ? "true" : "false", runId,
        static_cast<unsigned long>(filesystem.targetAddress()),
        static_cast<unsigned long>(filesystem.targetSize()),
        static_cast<unsigned long>(filesystem.runningAddress()),
        static_cast<unsigned long>(filesystem.bootAddress()),
        targetSafe ? "true" : "false",
        fingerprintMatched ? "true" : "false",
        filesystem.formatted() ? "true" : "false",
        mounted ? "true" : "false",
        remountedReadOnly ? "true" : "false",
        reopenedReadOnly ? "true" : "false",
        static_cast<unsigned long long>(mountUs),
        leshy1::storage::permitStatusName(permit.status),
        permit.allowed() ? permit.scratchPath : "",
        scratchPreexisting ? "true" : "false",
        static_cast<unsigned long long>(permit.byteLimit),
        static_cast<unsigned long long>(capacityBytes),
        static_cast<unsigned long long>(freeBefore),
        static_cast<unsigned long long>(freeAfter),
        static_cast<unsigned long long>(bytesWritten),
        static_cast<unsigned long>(fileSyncs),
        static_cast<unsigned long>(directorySyncs),
        static_cast<unsigned>(kSdThroughputSamples),
        static_cast<unsigned>(commitsCompleted),
        static_cast<unsigned long long>(timings.totalUs),
        static_cast<unsigned long long>(timings.minimumUs),
        static_cast<unsigned long long>(timings.p50Us),
        static_cast<unsigned long long>(timings.p95Us),
        static_cast<unsigned long long>(timings.p99Us),
        static_cast<unsigned long long>(timings.maximumUs),
        static_cast<unsigned>(SurveySession::kObservationCapacity),
        static_cast<unsigned>(fixtureSegmentBytes),
        static_cast<unsigned long long>(encodedPayloadBytesPerSecond),
        static_cast<unsigned long long>(
            kStorageRequiredEncodedBytesPerSecond),
        storageRateTargetMet ? "true" : "false",
        leshy1::storage::sessionStoreStatusName(recoveryBeforeRemount.status),
        static_cast<unsigned long>(recoveryBeforeRemount.generation),
        leshy1::storage::sessionStoreStatusName(recoveryAfterRemount.status),
        static_cast<unsigned long>(recoveryAfterRemount.generation),
        static_cast<unsigned>(recoveryAfterRemount.observations),
        ioFailure, ioErrno, static_cast<unsigned long>(ownedDuring),
        static_cast<unsigned long>(ownedAfter),
        cleanupComplete ? "true" : "false",
        static_cast<unsigned long>(heapFreeBefore),
        static_cast<unsigned long>(heapFreeAfter),
        static_cast<unsigned long>(ESP.getMinFreeHeap()));
    reply.println(line);
}

void emitLittleFsResetArm(Stream& reply, const char* expectedFingerprint,
                          const char* runId, unsigned boundaryNumber) {
    auto& line = sdPhysicalEvidence.line;
    littleFsResetRtcState.magic = 0;
    char observedFingerprint[65] = {};
    char scratchPath[leshy1::storage::kScratchPathMax] = {};
    std::snprintf(scratchPath, sizeof(scratchPath), "%s%s",
                  leshy1::storage::kScratchRoot, runId);
    const leshy1::storage::CommitStage boundary =
        resetBoundaryStage(boundaryNumber);
    const bool idleUi = uiController.isRoot() && !appRuntime.running() &&
        productSurveyControl() == ProductSurveyWorkerControl::Idle;
    DisposableOtaLittleFs filesystem;
    const bool inspected = filesystem.inspect();
    const bool targetSafe = inspected && filesystem.safeInactiveTarget();
    const bool resourcesAcquired = idleUi && targetSafe &&
        resourceBroker.acquire(
            kLittleFsHilOwner,
            leshy1::kernel::runtime::resourceMask(Resource::Storage));
    const std::uint32_t ownedDuring =
        resourceBroker.ownedBy(kLittleFsHilOwner);
    const bool targetHashed = resourcesAcquired &&
        filesystem.hashTarget(observedFingerprint, sizeof(observedFingerprint));
    const bool fingerprintMatched = targetHashed &&
        std::strcmp(expectedFingerprint, observedFingerprint) == 0;
    const bool mounted = fingerprintMatched &&
        filesystem.formatAndMountWritable();
    const std::uint64_t capacityBytes = mounted ? filesystem.totalBytes() : 0;
    const std::uint64_t freeBefore = mounted ? filesystem.freeBytes() : 0;
    const bool scratchPreexisting = mounted && filesystem.exists(scratchPath);

    leshy1::storage::MediaIdentity media;
    media.present = mounted && capacityBytes != 0 && freeBefore <= capacityBytes;
    media.kind = leshy1::storage::MediaKind::LittleFs;
    media.fingerprint = observedFingerprint;
    media.capacityBytes = capacityBytes;
    media.freeBytes = freeBefore;
    leshy1::storage::WriteRequest request;
    request.explicitlyDisposable = true;
    request.expectedFingerprint = expectedFingerprint;
    request.runId = runId;
    request.scratchExists = scratchPreexisting;
    request.requiredBytes = 1024U * 1024U;
    request.reserveBytes = 512U * 1024U;
    const leshy1::storage::WritePermit permit =
        leshy1::storage::authorizeScratchWrite(media, request);

    const char* status = "target_not_inspected";
    if (!leshy1::storage::isSessionStoreBoundary(boundary)) {
        status = "invalid_boundary";
    } else if (!idleUi) {
        status = "ui_not_idle";
    } else if (!inspected) {
        status = "target_not_found";
    } else if (!targetSafe) {
        status = "target_not_inactive_ota1";
    } else if (!resourcesAcquired) {
        status = "resources_unavailable";
    } else if (!targetHashed) {
        status = "target_hash_failed";
    } else if (!fingerprintMatched) {
        status = "target_fingerprint_mismatch";
    } else if (!mounted) {
        status = "format_or_mount_failed";
    } else if (!permit.allowed()) {
        status = "permit_rejected";
    } else {
        status = "ready";
    }

    leshy1::storage::SessionStoreCommitResult initialCommit;
    leshy1::storage::SessionStoreRecoveryResult initialRecovery;
    StoredGenerationEvidence priorEvidence;
    bool fixtureReady = false;
    bool prepared = false;
    bool scratchCreated = false;
    bool priorUnchanged = false;
    bool continuityArmed = false;
    std::uint64_t bytesWritten = 0;
    std::uint32_t fileSyncs = 0;
    std::uint32_t directorySyncs = 0;
    const char* ioFailure = "not_started";
    int ioErrno = 0;
    if (std::strcmp(status, "ready") == 0) {
        fixtureReady = prepareLittleFsResetFixture();
        if (!fixtureReady) status = "fixture_prepare_failed";
    }
    if (fixtureReady) {
        ArduinoLittleFsSessionStoreIo io(filesystem);
        prepared = io.prepare(permit);
        scratchCreated = prepared && filesystem.exists(permit.scratchPath);
        if (!prepared || !scratchCreated) {
            status = "scratch_prepare_failed";
        } else {
            initialCommit = leshy1::storage::commitNextSession(
                io, sessionStoreWorkspace(), littleFsResetSession);
            initialRecovery = leshy1::storage::recoverSession(
                io, sessionStoreWorkspace(),
                &sessionStoreWorkspace().validationSession);
            priorUnchanged = initialCommit.complete() &&
                initialCommit.generation == 1 && initialRecovery.valid() &&
                initialRecovery.generation == 1 &&
                initialRecovery.observations == 3 &&
                inspectStoredGeneration(
                    io, sessionStoreWorkspace(), littleFsResetSession, 1,
                    &priorEvidence);
            if (!priorUnchanged) {
                status = "initial_generation_failed";
            } else {
                continuityArmed = armLittleFsResetContinuity(
                    expectedFingerprint, runId, boundaryNumber);
                if (!continuityArmed) {
                    status = "continuity_arm_failed";
                } else {
                    std::snprintf(
                        line, sizeof(sdPhysicalEvidence.line),
                        "{\"schema\":\"leshy.storage.littlefs.reset.v1\","
                        "\"kind\":\"armed\",\"status\":\"ready\","
                        "\"run_id\":\"%s\",\"boundary\":%u,"
                        "\"boundary_name\":\"%s\","
                        "\"expected_recovery\":\"%s\","
                        "\"expected_fingerprint\":\"%s\","
                        "\"observed_fingerprint\":\"%s\","
                        "\"fingerprint_matched\":true,"
                        "\"target\":\"ota1\",\"target_address\":%lu,"
                        "\"target_size\":%lu,\"target_inactive\":true,"
                        "\"scratch_path\":\"%s\","
                        "\"initial_generation\":1,"
                        "\"initial_observations\":3,"
                        "\"prior_segment_crc32c\":%lu,"
                        "\"prior_manifest_crc32c\":%lu,"
                        "\"continuity_armed\":true,"
                        "\"format_performed\":true,"
                        "\"writes_bounded_to_scratch\":true,"
                        "\"ota1_restore_required\":true,"
                        "\"product_partition_touched\":false,"
                        "\"sd_accessed\":false,\"nvs_touched\":false,"
                        "\"radio_touched\":false,"
                        "\"reset_injection\":true,"
                        "\"physical_power_cut\":false}",
                        runId, boundaryNumber,
                        leshy1::storage::sessionStoreBoundaryName(boundary),
                        resetExpectedRecovery(boundaryNumber),
                        expectedFingerprint, observedFingerprint,
                        static_cast<unsigned long>(filesystem.targetAddress()),
                        static_cast<unsigned long>(filesystem.targetSize()),
                        permit.scratchPath,
                        static_cast<unsigned long>(
                            priorEvidence.observedSegmentCrc),
                        static_cast<unsigned long>(
                            priorEvidence.observedManifestCrc));
                    reply.println(line);
                    reply.flush();
                    ResetBoundaryHookContext hookContext{
                        &reply, runId, boundaryNumber};
                    leshy1::storage::SessionStoreBoundaryIo injecting(
                        io, boundary, restartAtLittleFsSessionStoreBoundary,
                        &hookContext);
                    static_cast<void>(leshy1::storage::commitNextSession(
                        injecting, sessionStoreWorkspace(),
                        littleFsResetSession));
                    status = "reset_not_triggered";
                }
            }
        }
        bytesWritten = io.bytesWritten();
        fileSyncs = io.fileSyncs();
        directorySyncs = io.directorySyncs();
        ioFailure = io.lastFailure();
        ioErrno = io.lastErrno();
        io.end();
    }

