anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void runPowerLowVoltageAdmissionTest(Stream& reply) {
    const bool ready = hilSession.active() && uiController.isRoot() &&
        !appRuntime.running() && boundedSleepReady();
    if (!ready) {
        reply.println(
            "{\"schema\":\"leshy.power.low_voltage_test.v1\","
            "\"kind\":\"error\",\"reason\":\"runtime_not_idle\"}");
        return;
    }
    const std::uint32_t generationBefore =
        productBootRecovery.catalog.generation;
    const std::size_t observationsBefore =
        productBootRecovery.catalog.observations;
    const std::uint32_t ownedBefore =
        resourceBroker.ownedBy(AppRuntime::kForegroundOwner);
    const std::uint32_t tripsBefore = powerSafetyPolicy.lowVoltageTrips();
    powerSafetyPolicy.resetUnavailable();
    for (std::uint8_t sample = 0;
         sample < PowerSafetyPolicy::kConfirmSamples; ++sample) {
        powerSafetyPolicy.observeMillivolts(
            PowerSafetyPolicy::kLowMillivolts);
    }
    const PowerTelemetryState injectedState = powerSafetyPolicy.state();
    const PowerWriteDisposition injectedDisposition =
        powerSafetyPolicy.writeDisposition();

    leshy1::storage::MediaIdentity media;
    media.present = true;
    media.kind = leshy1::storage::MediaKind::Sd;
    media.fingerprint = "POWERTEST";
    media.capacityBytes = 1024U * 1024U;
    media.freeBytes = 512U * 1024U;
    leshy1::storage::ProductStoreRequest request;
    request.operation = leshy1::storage::ProductStoreOperation::CommitSession;
    request.explicitlySelected = true;
    request.expectedFingerprint = "POWERTEST";
    request.rootPath = leshy1::storage::kProductSessionStoreRoot;
    request.rootExists = true;
    request.driverWriteEnabled = true;
    request.requiredBytes = 4096;
    request.reserveBytes = 4096;
    request.ownedResources =
        leshy1::kernel::runtime::resourceMask(Resource::Storage) |
        leshy1::kernel::runtime::resourceMask(Resource::RadioSpi);
    request.power = injectedDisposition;
    const leshy1::storage::ProductStorePermit permit =
        leshy1::storage::authorizeProductStore(media, request);
    powerSafetyPolicy.resetUnavailable();
    const std::uint32_t ownedAfter =
        resourceBroker.ownedBy(AppRuntime::kForegroundOwner);
    const bool passed = injectedState == PowerTelemetryState::LowVoltage &&
        injectedDisposition == PowerWriteDisposition::ProhibitedLowVoltage &&
        permit.status == leshy1::storage::ProductStoreAccessStatus::PowerUnsafe &&
        powerSafetyPolicy.lowVoltageTrips() == tripsBefore + 1U &&
        generationBefore == productBootRecovery.catalog.generation &&
        observationsBefore == productBootRecovery.catalog.observations &&
        ownedBefore == ownedAfter;
    char line[1024] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.power.low_voltage_test.v1\","
        "\"kind\":\"result\",\"status\":\"%s\","
        "\"injected_state\":\"%s\",\"write_disposition\":\"%s\","
        "\"store_permit\":\"%s\",\"samples\":%u,"
        "\"trip_delta\":%lu,\"physical_storage_opened\":false,"
        "\"physical_write_calls\":0,\"filesystem_mounted\":false,"
        "\"generation_before\":%lu,\"generation_after\":%lu,"
        "\"observations_before\":%u,\"observations_after\":%u,"
        "\"owned_before\":%lu,\"owned_after\":%lu,"
        "\"restored_state\":\"%s\",\"buzzer_inactive\":%s}",
        passed ? "pass" : "fail",
        leshy1::services::power::powerTelemetryStateName(injectedState),
        leshy1::services::power::powerWriteDispositionName(
            injectedDisposition),
        leshy1::storage::productStoreAccessStatusName(permit.status),
        static_cast<unsigned>(PowerSafetyPolicy::kConfirmSamples),
        static_cast<unsigned long>(powerSafetyPolicy.lowVoltageTrips() -
                                   tripsBefore),
        static_cast<unsigned long>(generationBefore),
        static_cast<unsigned long>(productBootRecovery.catalog.generation),
        static_cast<unsigned>(observationsBefore),
        static_cast<unsigned>(productBootRecovery.catalog.observations),
        static_cast<unsigned long>(ownedBefore),
        static_cast<unsigned long>(ownedAfter),
        leshy1::services::power::powerTelemetryStateName(
            powerSafetyPolicy.state()),
        BoardSafeOutputs::buzzerHeldInactive() ? "true" : "false");
    reply.println(line);
}

void emitPowerSleepTestReport(Stream& reply) {
    if (!powerSleepTestReport.available) {
        reply.println(
            "{\"schema\":\"leshy.power.sleep_test.v1\","
            "\"kind\":\"error\",\"reason\":\"not_run\"}");
        return;
    }
    char line[1024] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.power.sleep_test.v1\","
        "\"kind\":\"result\",\"status\":\"%s\","
        "\"sleep_kind\":\"esp32_light_sleep\","
        "\"requested_us\":%llu,\"elapsed_us\":%llu,"
        "\"wakeup\":\"%s\",\"backlight_restored\":true,"
        "\"input_task_retained\":%s,\"filesystem_mounted\":false,"
        "\"physical_write_calls\":0,\"generation_before\":%lu,"
        "\"generation_after\":%lu,\"observations_before\":%u,"
        "\"observations_after\":%u,\"heap_before\":%lu,"
        "\"heap_after\":%lu,\"minimum_heap_before\":%lu,"
        "\"minimum_heap_after\":%lu,\"lease_mask\":%lu,"
        "\"buzzer_inactive\":%s,\"radio_tx_commands\":0}",
        powerSleepTestReport.passed ? "pass" : "fail",
        static_cast<unsigned long long>(powerSleepTestReport.requestedUs),
        static_cast<unsigned long long>(powerSleepTestReport.elapsedUs),
        powerSleepTestReport.wakeCause == ESP_SLEEP_WAKEUP_TIMER
            ? "timer" : "unexpected",
        powerSleepTestReport.inputTaskRetained ? "true" : "false",
        static_cast<unsigned long>(powerSleepTestReport.generationBefore),
        static_cast<unsigned long>(powerSleepTestReport.generationAfter),
        static_cast<unsigned>(powerSleepTestReport.observationsBefore),
        static_cast<unsigned>(powerSleepTestReport.observationsAfter),
        static_cast<unsigned long>(powerSleepTestReport.heapBefore),
        static_cast<unsigned long>(powerSleepTestReport.heapAfter),
        static_cast<unsigned long>(powerSleepTestReport.minimumHeapBefore),
        static_cast<unsigned long>(powerSleepTestReport.minimumHeapAfter),
        static_cast<unsigned long>(powerSleepTestReport.leaseMask),
        powerSleepTestReport.buzzerInactive ? "true" : "false");
    reply.println(line);
}

void runPowerSleepTest(Stream& reply) {
    const bool ready = hilSession.active() && uiController.isRoot() &&
        !appRuntime.running() && boundedSleepReady();
    if (!ready) {
        reply.println(
            "{\"schema\":\"leshy.power.sleep_test.v1\","
            "\"kind\":\"error\",\"reason\":\"runtime_not_idle\"}");
        return;
    }
    constexpr std::uint64_t requestedUs = 300000ULL;
    powerSleepTestReport = {};
    powerSleepTestReport.requestedUs = requestedUs;
    powerSleepTestReport.generationBefore =
        productBootRecovery.catalog.generation;
    powerSleepTestReport.observationsBefore =
        productBootRecovery.catalog.observations;
    powerSleepTestReport.heapBefore = ESP.getFreeHeap();
    powerSleepTestReport.minimumHeapBefore = ESP.getMinFreeHeap();
    const bool slept = performBoundedLightSleep(requestedUs);
    powerSleepTestReport.elapsedUs = lastBoundedSleepElapsedUs;
    powerSleepTestReport.wakeCause = lastBoundedSleepWakeCause;
    powerSleepTestReport.generationAfter =
        productBootRecovery.catalog.generation;
    powerSleepTestReport.observationsAfter =
        productBootRecovery.catalog.observations;
    powerSleepTestReport.heapAfter = ESP.getFreeHeap();
    powerSleepTestReport.minimumHeapAfter = ESP.getMinFreeHeap();
    powerSleepTestReport.leaseMask =
        resourceBroker.ownedBy(AppRuntime::kForegroundOwner);
    powerSleepTestReport.inputTaskRetained = physicalInputTaskStarted;
    powerSleepTestReport.buzzerInactive =
        BoardSafeOutputs::buzzerHeldInactive();
    const bool timerWake =
        powerSleepTestReport.wakeCause == ESP_SLEEP_WAKEUP_TIMER;
    const bool elapsedBounded =
        powerSleepTestReport.elapsedUs + kLightSleepTimerToleranceUs >= requestedUs &&
        powerSleepTestReport.elapsedUs <= requestedUs + 500000ULL;
    powerSleepTestReport.passed = slept && timerWake && elapsedBounded &&
        powerSleepTestReport.generationBefore ==
            powerSleepTestReport.generationAfter &&
        powerSleepTestReport.observationsBefore ==
            powerSleepTestReport.observationsAfter &&
        boundedSleepReady() && powerSleepTestReport.buzzerInactive;
    powerSleepTestReport.available = true;
    // UART can retain this immediate reply. Native USB may discard it while
    // resuming, so HIL retrieves the retained result through the read-only
    // `power.sleep-test state` command.
    emitPowerSleepTestReport(reply);
}

void emitSafetyState(Stream& reply) {
    const bool watchdogArmed = runtimeSafetyWatchdogReady &&
        __atomic_load_n(&runtimeSafetyWatchdogArmed, __ATOMIC_ACQUIRE) != 0;
    const WorkerDeadlineSnapshot worker = workerDeadlineSnapshot();
    const ProductSurveyPreparationSnapshot preparation =
        productSurveyPreparationSnapshot();
    std::uint64_t preparationNowUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (preparationNowUs < preparation.stageStartedUs) {
        preparationNowUs = preparation.stageStartedUs;
    }
    const std::uint64_t preparationStageAgeMs =
        preparation.stageStartedUs == 0
            ? 0 : (preparationNowUs - preparation.stageStartedUs) / 1000ULL;
    char line[1400] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.safety.v1\",\"kind\":\"state\","
        "\"state\":\"%s\",\"reason\":\"%s\",\"armed\":%s,"
        "\"latched\":%s,\"clear_pending\":%s,"
        "\"watchdog_timeout_ms\":%lu,\"trip_count\":%lu,"
        "\"emergency_quiesce_count\":%lu,\"reset_reason_code\":%lu,"
        "\"startup_guard_tripped\":%s,"
        "\"buzzer_inactive\":%s,\"nrf_ce_inactive\":%s,"
        "\"runtime_owner\":\"%s\",\"lease_mask\":%lu,"
        "\"worker_supervision\":true,\"worker_active\":\"%s\","
        "\"worker_last_expired\":\"%s\",\"worker_armed\":%s,"
        "\"worker_expired\":%s,\"worker_deadline_ms\":%llu,"
        "\"worker_age_ms\":%llu,\"worker_arm_count\":%lu,"
        "\"worker_heartbeat_count\":%lu,\"worker_trip_count\":%lu,"
        "\"product_survey_preparation_stage\":\"%s\","
        "\"product_survey_preparation_stage_age_ms\":%llu,"
        "\"software_only\":true,\"physical_rail_kill_available\":false,"
        "\"thermal_sensor_available\":false,"
        "\"cc1101_hard_kill_available\":false,"
        "\"automatic_clear\":false}",
        leshy1::kernel::safety::safetyStateName(safetySupervisor.state()),
        leshy1::kernel::safety::safetyReasonName(safetySupervisor.reason()),
        watchdogArmed ? "true" : "false",
        safetySupervisor.latched() ? "true" : "false",
        safetySupervisor.clearPending() ? "true" : "false",
        static_cast<unsigned long>(
            leshy1::storage::kProductBootRecoveryHardwareWatchdogMs),
        static_cast<unsigned long>(safetySupervisor.tripCount()),
        static_cast<unsigned long>(safetySupervisor.quiesceCount()),
        static_cast<unsigned long>(bootMetrics.resetReason),
        earlyBootGuardTrippedAtBoot ? "true" : "false",
        BoardSafeOutputs::buzzerHeldInactive() ? "true" : "false",
        BoardSafeOutputs::radioTransmitPathsHeldInactive() ? "true" : "false",
        appRuntime.activeApp(),
        static_cast<unsigned long>(appRuntime.activeResources()),
        leshy1::kernel::safety::supervisedWorkerName(worker.activeWorker),
        leshy1::kernel::safety::supervisedWorkerName(
            worker.lastExpiredWorker),
        worker.armed ? "true" : "false",
        worker.expired ? "true" : "false",
        static_cast<unsigned long long>(worker.deadlineUs / 1000ULL),
        static_cast<unsigned long long>(worker.lastObservedAgeUs / 1000ULL),
        static_cast<unsigned long>(worker.armCount),
        static_cast<unsigned long>(worker.heartbeatCount),
        static_cast<unsigned long>(worker.tripCount),
        preparation.stage,
        static_cast<unsigned long long>(preparationStageAgeMs));
    reply.println(line);
}

void triggerWorkerDeadlineTest(Stream& reply) {
    const bool outputsInactive = BoardSafeOutputs::buzzerHeldInactive() &&
        BoardSafeOutputs::radioTransmitPathsHeldInactive();
    const WorkerDeadlineSnapshot worker = workerDeadlineSnapshot();
    const bool eligible = safetySupervisor.state() == SafetyState::Armed &&
        runtimeSafetyWatchdogReady && outputsInactive &&
        productSurveyWorkerReady && !appRuntime.running() &&
        appRuntime.activeResources() == 0 && !worker.armed &&
        !productSurveyPreparationDeadlineInjectionArmed() &&
        !productSurveyWorkerDeadlineInjectionArmed() &&
        !wifiCaptureStoreDeadlineInjectionArmed() &&
        !pulseCaptureStoreDeadlineInjectionArmed(
            SupervisedWorker::SubGhzCaptureStore) &&
        !pulseCaptureStoreDeadlineInjectionArmed(
            SupervisedWorker::InfraredCaptureStore);
    if (!eligible) {
        reply.println(
            "{\"schema\":\"leshy.safety.worker_deadline_test.v1\","
            "\"kind\":\"error\",\"reason\":\"unsafe_precondition\"}");
        return;
    }
    setProductSurveyWorkerDeadlineInjection(true);
    reply.println(
        "{\"schema\":\"leshy.safety.worker_deadline_test.v1\","
        "\"kind\":\"armed\",\"worker\":\"product_survey\","
        "\"deadline_ms\":8000,\"injection_ms\":10000,"
        "\"requires_public_survey_start\":true,"
        "\"outputs_inactive\":true,\"physical_write_calls\":0}");
}

void triggerPreparationDeadlineTest(Stream& reply) {
    const bool outputsInactive = BoardSafeOutputs::buzzerHeldInactive() &&
        BoardSafeOutputs::radioTransmitPathsHeldInactive();
    const WorkerDeadlineSnapshot worker = workerDeadlineSnapshot();
    const bool eligible = safetySupervisor.state() == SafetyState::Armed &&
        runtimeSafetyWatchdogReady && outputsInactive &&
        productSurveyWorkerReady && !appRuntime.running() &&
        appRuntime.activeResources() == 0 && !worker.armed &&
        !productSurveyPreparationDeadlineInjectionArmed() &&
        !productSurveyWorkerDeadlineInjectionArmed() &&
        !wifiCaptureStoreDeadlineInjectionArmed() &&
        !pulseCaptureStoreDeadlineInjectionArmed(
            SupervisedWorker::SubGhzCaptureStore) &&
        !pulseCaptureStoreDeadlineInjectionArmed(
            SupervisedWorker::InfraredCaptureStore);
    if (!eligible) {
        reply.println(
            "{\"schema\":\"leshy.safety.worker_preparation_deadline_test.v1\","
            "\"kind\":\"error\",\"reason\":\"unsafe_precondition\"}");
        return;
    }
    setProductSurveyPreparationDeadlineInjection(true);
    reply.println(
        "{\"schema\":\"leshy.safety.worker_preparation_deadline_test.v1\","
        "\"kind\":\"armed\",\"worker\":\"product_survey_preparation\","
        "\"deadline_ms\":8000,\"injection_ms\":10000,"
        "\"requires_public_survey_start\":true,"
        "\"before_hardware_preparation\":true,"
        "\"outputs_inactive\":true,\"physical_write_calls\":0}");
}

