anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void triggerWifiCaptureStoreDeadlineTest(Stream& reply) {
    const bool outputsInactive = BoardSafeOutputs::buzzerHeldInactive() &&
        BoardSafeOutputs::radioTransmitPathsHeldInactive();
    const WorkerDeadlineSnapshot worker = workerDeadlineSnapshot();
    const bool eligible = safetySupervisor.state() == SafetyState::Armed &&
        runtimeSafetyWatchdogReady && outputsInactive &&
        captureStoreEvents != nullptr && captureStoreTaskHandle == nullptr &&
        !appRuntime.running() && appRuntime.activeResources() == 0 &&
        !worker.armed &&
        !productSurveyPreparationDeadlineInjectionArmed() &&
        !productSurveyWorkerDeadlineInjectionArmed() &&
        !wifiCaptureStoreDeadlineInjectionArmed() &&
        !pulseCaptureStoreDeadlineInjectionArmed(
            SupervisedWorker::SubGhzCaptureStore) &&
        !pulseCaptureStoreDeadlineInjectionArmed(
            SupervisedWorker::InfraredCaptureStore);
    if (!eligible) {
        reply.println(
            "{\"schema\":\"leshy.safety.capture_store_deadline_test.v1\","
            "\"kind\":\"error\",\"reason\":\"unsafe_precondition\"}");
        return;
    }
    setWifiCaptureStoreDeadlineInjection(true);
    reply.println(
        "{\"schema\":\"leshy.safety.capture_store_deadline_test.v1\","
        "\"kind\":\"armed\",\"worker\":\"wifi_capture_store\","
        "\"deadline_ms\":8000,\"injection_ms\":10000,"
        "\"requires_public_capture_save\":true,"
        "\"before_storage_hardware\":true,"
        "\"outputs_inactive\":true,\"physical_write_calls\":0}");
}

void triggerPulseCaptureStoreDeadlineTest(Stream& reply, bool infrared) {
    const SupervisedWorker selected = infrared
        ? SupervisedWorker::InfraredCaptureStore
        : SupervisedWorker::SubGhzCaptureStore;
    const bool queueReady = infrared
        ? infraredCaptureStoreEvents != nullptr &&
              infraredCaptureStoreTaskHandle == nullptr
        : subGhzCaptureStoreEvents != nullptr &&
              subGhzCaptureStoreTaskHandle == nullptr;
    const bool outputsInactive = BoardSafeOutputs::buzzerHeldInactive() &&
        BoardSafeOutputs::radioTransmitPathsHeldInactive();
    const WorkerDeadlineSnapshot worker = workerDeadlineSnapshot();
    const bool eligible = safetySupervisor.state() == SafetyState::Armed &&
        runtimeSafetyWatchdogReady && outputsInactive && queueReady &&
        !appRuntime.running() && appRuntime.activeResources() == 0 &&
        !worker.armed &&
        !productSurveyPreparationDeadlineInjectionArmed() &&
        !productSurveyWorkerDeadlineInjectionArmed() &&
        !wifiCaptureStoreDeadlineInjectionArmed() &&
        !pulseCaptureStoreDeadlineInjectionArmed(
            SupervisedWorker::SubGhzCaptureStore) &&
        !pulseCaptureStoreDeadlineInjectionArmed(
            SupervisedWorker::InfraredCaptureStore);
    if (!eligible) {
        reply.println(
            "{\"schema\":\"leshy.safety.pulse_capture_store_deadline_test.v1\","
            "\"kind\":\"error\",\"reason\":\"unsafe_precondition\"}");
        return;
    }
    setPulseCaptureStoreDeadlineInjection(selected, true);
    char line[320] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.safety.pulse_capture_store_deadline_test.v1\","
        "\"kind\":\"armed\",\"worker\":\"%s\",\"source\":\"%s\","
        "\"deadline_ms\":8000,\"injection_ms\":10000,"
        "\"requires_public_capture_save\":true,"
        "\"before_storage_hardware\":true,\"outputs_inactive\":true,"
        "\"physical_write_calls\":0}",
        leshy1::kernel::safety::supervisedWorkerName(selected),
        infrared ? "infrared" : "subghz");
    reply.println(line);
}

void triggerRuntimeSafetyWatchdogTest(Stream& reply) {
    const bool outputsInactive = BoardSafeOutputs::buzzerHeldInactive() &&
        BoardSafeOutputs::radioTransmitPathsHeldInactive();
    const bool eligible = safetySupervisor.state() == SafetyState::Armed &&
        runtimeSafetyWatchdogReady && outputsInactive &&
        !appRuntime.running() && appRuntime.activeResources() == 0;
    if (!eligible) {
        reply.println(
            "{\"schema\":\"leshy.safety.watchdog_test.v1\","
            "\"kind\":\"error\",\"reason\":\"unsafe_precondition\"}");
        return;
    }
    reply.println(
        "{\"schema\":\"leshy.safety.watchdog_test.v1\","
        "\"kind\":\"armed\",\"status\":\"ready\","
        "\"watchdog_timeout_ms\":5000,\"outputs_inactive\":true,"
        "\"filesystem_write_attempted\":false,"
        "\"physical_write_calls\":0}");
    reply.flush();
    // Deliberately stop feeding the loop task. The independent panic Task WDT
    // must take the ISR quiesce path, retain the reason, and reset the MCU.
    for (;;) delay(1000);
}

void triggerEarlyBootSafetyWatchdogTest(Stream& reply) {
    const bool outputsInactive = BoardSafeOutputs::buzzerHeldInactive() &&
        BoardSafeOutputs::radioTransmitPathsHeldInactive();
    const bool eligible = safetySupervisor.state() == SafetyState::Armed &&
        runtimeSafetyWatchdogReady && outputsInactive &&
        !appRuntime.running() && appRuntime.activeResources() == 0 &&
        productBootRecovery.catalogAdmitted &&
        productBootRecovery.ownedAfter == 0;
    if (!eligible) {
        reply.println(
            "{\"schema\":\"leshy.safety.early_boot_watchdog_test.v1\","
            "\"kind\":\"error\",\"reason\":\"unsafe_precondition\"}");
        return;
    }
    earlyBootWatchdogTestRtcState = kEarlyBootWatchdogTestRtcMagic;
    reply.println(
        "{\"schema\":\"leshy.safety.early_boot_watchdog_test.v1\","
        "\"kind\":\"armed\",\"status\":\"ready\","
        "\"stage\":\"before_setup\",\"watchdog_timeout_ms\":5000,"
        "\"outputs_inactive\":true,\"filesystem_write_attempted\":false,"
        "\"physical_write_calls\":0}");
    reply.flush();
    delay(50);
    esp_restart();
}

void restartLatchedSafetyStopForTest(Stream& reply) {
    const bool eligible = safetySupervisor.latched() &&
        !safetySupervisor.clearPending() && !appRuntime.running() &&
        appRuntime.activeResources() == 0;
    if (!eligible) {
        reply.println(
            "{\"schema\":\"leshy.safety.restart_test.v1\","
            "\"kind\":\"error\",\"reason\":\"unsafe_precondition\"}");
        return;
    }
    BoardSafeOutputs::emergencyQuiesce();
    BoardSdSpiTransport::holdRadioTransmitPathsInactive();
    __atomic_store_n(&runtimeSafetyWatchdogArmed, 0, __ATOMIC_RELEASE);
    reply.println(
        "{\"schema\":\"leshy.safety.restart_test.v1\","
        "\"kind\":\"restart\",\"latch_preserved\":true,"
        "\"outputs_inactive\":true,\"filesystem_write_attempted\":false,"
        "\"physical_write_calls\":0}");
    reply.flush();
    Serial.flush();
    Serial0.flush();
    delay(20);
    // The latched worker may have been cancelled while an SDK shutdown lock
    // was owned.  Bypass shutdown handlers after fail-safe quiesce so the
    // retained latch can always reach the next boot for inspection.
    esp_restart_noos();
    for (;;) {}
}

