anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void clearSafetyStopFromConsole(Stream& reply) {
    if (!safetySupervisor.latched()) {
        reply.println(
            "{\"schema\":\"leshy.safety.v1\",\"kind\":\"error\","
            "\"reason\":\"not_latched\"}");
        return;
    }
    if (!safetySupervisor.clearPending()) safetySupervisor.requestClear();
    reply.println(
        "{\"schema\":\"leshy.safety.v1\",\"kind\":\"clear_confirmed\","
        "\"restart_required\":true}");
    reply.flush();
    clearSafetyStopAndRestart();
}

bool readInputRaw(std::uint8_t* value) {
    if (value == nullptr) return false;
    const std::uint8_t received = Wire.requestFrom(BoardProfile::kPcf8574Address,
                                                   static_cast<std::uint8_t>(1), true);
    if (received != 1 || Wire.available() == 0) return false;
    *value = static_cast<std::uint8_t>(Wire.read());
    return true;
}

bool probeInputAtBoot(std::uint8_t* value, std::uint8_t* attempts) {
    if (value == nullptr || attempts == nullptr) return false;
    *attempts = 0;
    for (std::uint8_t attempt = 1; attempt <= kInputProbeMaxAttempts; ++attempt) {
        *attempts = attempt;
        if (readInputRaw(value)) return true;
        if (attempt < kInputProbeMaxAttempts) delay(kInputProbeRetryDelayMs);
    }
    return false;
}

bool probeI2cAddressAck(std::uint8_t address) {
    Wire.beginTransmission(address);
    // Address-only transaction: it observes ACK/NACK and writes no register or
    // payload byte to the unknown power-manager implementation.
    return Wire.endTransmission(true) == 0;
}

void pollPhysicalInput(void*) {
    TickType_t lastWake = xTaskGetTickCount();
    for (;;) {
        std::uint8_t current = 0xFF;
        const bool valid = readInputRaw(&current);
        const std::uint32_t now = millis();
        PhysicalInputEvent event;
        portENTER_CRITICAL(&physicalInputMux);
        event.action = physicalButtonInput.sample(valid, current, now);
        event.raw = physicalButtonInput.stableRaw();
        event.atMs = now;
        event.atUs = static_cast<std::uint64_t>(esp_timer_get_time());
        portEXIT_CRITICAL(&physicalInputMux);
        if (event.action != UiAction::Unknown) {
            if (xQueueSend(physicalInputEvents, &event, 0) != pdTRUE) {
                portENTER_CRITICAL(&physicalInputMux);
                ++physicalInputQueueDrops;
                portEXIT_CRITICAL(&physicalInputMux);
            } else {
                const std::uint32_t depth = static_cast<std::uint32_t>(
                    uxQueueMessagesWaiting(physicalInputEvents));
                portENTER_CRITICAL(&physicalInputMux);
                if (depth > physicalInputQueueHighWater) {
                    physicalInputQueueHighWater = depth;
                }
                portEXIT_CRITICAL(&physicalInputMux);
            }
        }
        vTaskDelayUntil(&lastWake,
                        pdMS_TO_TICKS(Pcf8574ButtonInput::kPollPeriodMs));
    }
}

const char* tr(UiTextId id) {
    return leshy1::ui::uiText(languageController.active(), id);
}

enum class ActiveDisplayFont : std::uint8_t {
    None,
    Body,
    Meta,
};

ActiveDisplayFont activeDisplayFont = ActiveDisplayFont::None;

void selectUiFont(UiTextRole role) {
    const ActiveDisplayFont requested = role == UiTextRole::Body
        ? ActiveDisplayFont::Body : ActiveDisplayFont::Meta;
    if (activeDisplayFont == requested) return;
    if (role == UiTextRole::Body) {
        display.setFreeFont(&RobotoCondensedBody);
    } else {
        display.setFreeFont(&RobotoCondensedMeta);
    }
    activeDisplayFont = requested;
}

std::int16_t uiFontAscent(UiTextRole role) {
    return role == UiTextRole::Body ? kRobotoCondensedBodyAscent
                                    : kRobotoCondensedMetaAscent;
}

void setUiCursor(UiTextRole role, std::int16_t x, std::int16_t top) {
    selectUiFont(role);
    display.setCursor(x, top + uiFontAscent(role));
}

constexpr std::int16_t kLiveTextRowWidth = Layout::ContentWidth;
constexpr std::int16_t kLiveTextRowHeight = 24;
constexpr std::int16_t kLiveMetaTextRowHeight = 19;

bool beginLiveTextRow(UiTextRole role, std::uint16_t foreground,
                      std::uint16_t background) {
    if (!liveTextRowSprite.created()) {
        liveTextRowSprite.setColorDepth(1);
        if (liveTextRowSprite.createSprite(kLiveTextRowWidth,
                                           kLiveTextRowHeight) == nullptr) {
            ++bleDeviceAtomicTextRowAllocationFailures;
            return false;
        }
        liveTextRowSprite.setTextWrap(false, false);
    }
    liveTextRowSprite.fillSprite(0U);
    liveTextRowSprite.setBitmapColor(foreground, background);
    // A 1-bpp sprite stores only foreground/background membership. The real
    // RGB565 colors are applied by setBitmapColor() during the single push.
    liveTextRowSprite.setTextColor(1U, 0U);
    liveTextRowSprite.setFreeFont(
        role == UiTextRole::Body ? &RobotoCondensedBody
                                 : &RobotoCondensedMeta);
    return true;
}

void setLiveTextRowCursor(UiTextRole role, std::int16_t x,
                          std::int16_t top) {
    liveTextRowSprite.setFreeFont(
        role == UiTextRole::Body ? &RobotoCondensedBody
                                 : &RobotoCondensedMeta);
    liveTextRowSprite.setCursor(x, top + uiFontAscent(role));
}

void pushLiveTextRow(std::int16_t x, std::int16_t y) {
    liveTextRowSprite.pushSprite(x, y);
    ++bleDeviceAtomicTextRowPushes;
}

bool beginLiveMetaTextRow(std::uint16_t foreground,
                          std::uint16_t background) {
    if (!liveMetaTextRowSprite.created()) {
        liveMetaTextRowSprite.setColorDepth(1);
        if (liveMetaTextRowSprite.createSprite(
                kLiveTextRowWidth, kLiveMetaTextRowHeight) == nullptr) {
            ++bleDeviceAtomicTextRowAllocationFailures;
            return false;
        }
        liveMetaTextRowSprite.setTextWrap(false, false);
    }
    liveMetaTextRowSprite.fillSprite(0U);
    liveMetaTextRowSprite.setBitmapColor(foreground, background);
    liveMetaTextRowSprite.setTextColor(1U, 0U);
    liveMetaTextRowSprite.setFreeFont(&RobotoCondensedMeta);
    return true;
}

bool pushLiveMetaTextRow(const char* text, std::uint16_t foreground,
                         std::int16_t top) {
    constexpr std::int16_t kLocalTextTop = 2;
    if (beginLiveMetaTextRow(foreground, Palette::Canvas)) {
        liveMetaTextRowSprite.setCursor(
            2, kLocalTextTop + kRobotoCondensedMetaAscent);
        liveMetaTextRowSprite.print(text);
        liveMetaTextRowSprite.pushSprite(
            Layout::Edge, top - kLocalTextTop);
        ++bleDeviceAtomicTextRowPushes;
        return true;
    }

    ++bleDeviceDirectTextRowFallbacks;
    display.fillRect(Layout::Edge, top - kLocalTextTop,
                     Layout::ContentWidth, kLiveMetaTextRowHeight,
                     Palette::Canvas);
    display.setTextColor(foreground, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, top);
    display.print(text);
    return false;
}

