anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
enum class NavigationKey : std::uint8_t {
    None,
    Left,
    UpDown,
    RightAndSelect,
};

struct NavigationCell final {
    NavigationKey key = NavigationKey::None;
    UiTextId label = UiTextId::Count;
};

struct NavigationFooter final {
    NavigationCell left{};
    NavigationCell middle{};
    NavigationCell right{};
};

NavigationFooter navigationFooterForCurrentState() {
    const NavigationCell back = {NavigationKey::Left, UiTextId::NavBack};
    const NavigationCell choose = {NavigationKey::UpDown, UiTextId::NavSelect};
    const NavigationCell enter = {NavigationKey::RightAndSelect,
                                  UiTextId::NavEnter};
    if (safetySupervisor.latched()) {
        return safetySupervisor.clearPending()
            ? NavigationFooter{
                  {NavigationKey::Left, UiTextId::NavCancel}, {},
                  {NavigationKey::RightAndSelect, UiTextId::NavConfirm}}
            : NavigationFooter{
                  {}, {},
                  {NavigationKey::RightAndSelect, UiTextId::NavUnlock}};
    }
    if (uiController.isRoot()) return {{}, choose, enter};
    if (uiController.page() == 1) return {back, {}, {}};

    if (uiController.page() == 2) {
        if (bleProductView == BleProductView::InspectorGatt) {
            const BleGattInspectorState state = bleGattTransport.state();
            if (state == BleGattInspectorState::PermissionReview ||
                state == BleGattInspectorState::AwaitingConfirmation) {
                return {back, {},
                        {NavigationKey::RightAndSelect,
                         UiTextId::NavConfirm}};
            }
            if (state == BleGattInspectorState::Ready &&
                bleGattTransport.serviceCount() +
                        bleGattTransport.characteristicCount() > 1U) {
                return {back, choose, {}};
            }
            return {back, {}, {}};
        }
        if (bleProductView == BleProductView::InspectorMenu) {
            return {back, choose, enter};
        }
        if (bleProductView == BleProductView::InspectorRaw) {
            const BleInspectorCaptureSummary summary =
                bleInspectorCaptureSnapshot();
            return {
                {NavigationKey::Left, UiTextId::NavInfo}, {},
                {NavigationKey::RightAndSelect,
                 summary.state == BleInspectorCaptureState::Running
                     ? UiTextId::NavFreeze : UiTextId::NavAgain}};
        }
        if (bleProductView == BleProductView::DeviceDetail) {
            return {{NavigationKey::Left, UiTextId::NavList}, {},
                    {NavigationKey::RightAndSelect, UiTextId::NavModes}};
        }
        if (bleProductView == BleProductView::Devices) {
            return {back, choose, enter};
        }
        if (wifiProductView == WifiProductView::Menu) {
            return {back, choose, enter};
        }
        if (wifiProductView == WifiProductView::AirspaceGuard) {
            if (airspaceGuardCaptureRunning()) {
                return {back, {}, {}};
            }
            if (airspaceGuardController.view() ==
                AirspaceGuardView::EvidenceDetail) {
                return {back, {}, {}};
            }
            if (airspaceGuardController.view() ==
                    AirspaceGuardView::Finding ||
                airspaceGuardController.view() ==
                    AirspaceGuardView::EvidenceList) {
                return {back, choose, enter};
            }
            return {back, {},
                    {NavigationKey::RightAndSelect, UiTextId::NavAgain}};
        }
        if (wifiProductView == WifiProductView::NetworkDetail) {
            return {{NavigationKey::Left, UiTextId::NavList}, {}, enter};
        }
        if (wifiProductView == WifiProductView::AuthenticationCapture) {
            const WifiAuthenticationCaptureController& controller =
                activeWifiAuthenticationCaptureController();
            const WifiAuthenticationCaptureReport& report =
                activeWifiAuthenticationCaptureReport();
            if (wifiAuthenticationProductState !=
                    WifiAuthenticationProductState::Result ||
                !controller.ready()) {
                return {back, {}, {}};
            }
            switch (controller.view()) {
                case WifiAuthenticationCaptureView::Outcome:
                    return {back, {}, enter};
                case WifiAuthenticationCaptureView::Actions:
                    return {back, choose, enter};
                case WifiAuthenticationCaptureView::PeerDetail:
                    return {
                        back,
                        controller.peerCount() > 1U
                            ? choose : NavigationCell{},
                        report.evidenceCount != 0U
                            ? enter : NavigationCell{}};
                case WifiAuthenticationCaptureView::EvidenceList:
                    return {back, choose, enter};
                case WifiAuthenticationCaptureView::EvidenceDetail:
                    return {back, {}, {}};
            }
            return {back, {}, {}};
        }
        if (wifiProductView == WifiProductView::DeviceDetail) {
            return {{NavigationKey::Left, UiTextId::NavList}, {}, {}};
        }
        if (wifiProductView == WifiProductView::Devices) {
            return {back, choose, enter};
        }
        if (wifiProductView == WifiProductView::Channels) {
            return {back, {}, {}};
        }
        if (rfSpectrumView == RfSpectrumView::SourceMenu) {
            return {back, choose, enter};
        }
        if (rfSpectrumView == RfSpectrumView::Nrf24Menu) {
            return {back, choose, enter};
        }
        if (rfSpectrumView == RfSpectrumView::Nrf24Finder) {
            return {back, {},
                    {NavigationKey::RightAndSelect, UiTextId::NavAgain}};
        }
        if (rfSpectrumView == RfSpectrumView::CcFinder) {
            return {back, {},
                    {NavigationKey::RightAndSelect, UiTextId::NavAgain}};
        }
        if (rfSpectrumView == RfSpectrumView::SubGhzMenu ||
            rfSpectrumView == RfSpectrumView::SubGhzCaptureModeMenu ||
            rfSpectrumView == RfSpectrumView::SubGhzCaptureBandMenu) {
            return {back, choose, enter};
        }
        if (rfSpectrumView == RfSpectrumView::SubGhzCaptureLive) {
            const auto state = subGhzRawCapture.stats().state;
            if (state == SubGhzRawCaptureState::Waiting ||
                state == SubGhzRawCaptureState::Capturing) {
                return {{NavigationKey::Left, UiTextId::NavCancel}, {}, {}};
            }
            if (state == SubGhzRawCaptureState::Complete) {
                return subGhzCapturePersistState ==
                               CapturePersistState::Result
                    ? NavigationFooter{
                          back, {}, {NavigationKey::RightAndSelect,
                                     UiTextId::NavSave}}
                    : subGhzCapturePersistState ==
                              CapturePersistState::Saving
                          ? NavigationFooter{}
                          : NavigationFooter{
                                back, {},
                                {NavigationKey::RightAndSelect,
                                 UiTextId::NavStart}};
            }
            return {back, {},
                    {NavigationKey::RightAndSelect, UiTextId::NavStart}};
        }
        if (rfSpectrumView == RfSpectrumView::CcBandMenu) {
            return {back, choose, enter};
        }
        if (rfSpectrumView == RfSpectrumView::Live) {
            const bool cc = rfSpectrumKind == RfSpectrumKind::Cc1101;
            const bool fault = cc
                ? cc1101SpectrumController.state() ==
                      Cc1101SpectrumViewState::Fault
                : nrf24SpectrumController.state() ==
                      Nrf24SpectrumViewState::Fault;
            const bool paused = cc
                ? cc1101SpectrumController.state() ==
                      Cc1101SpectrumViewState::Paused
                : nrf24SpectrumController.state() ==
                      Nrf24SpectrumViewState::Paused;
            if (fault) {
                return {back, {}, {}};
            }
            return {back,
                    {NavigationKey::UpDown, UiTextId::NavView},
                    {NavigationKey::RightAndSelect,
                     cc ? (paused ? UiTextId::NavResume
                                  : UiTextId::NavPause)
                        : UiTextId::NavMode}};
        }
        if (productSurveySourceUnavailableVisible()) {
            return {{NavigationKey::Left, UiTextId::NavHome}, {}, {}};
        }
        if (surveyWorkflow.state() == SurveyWorkflowState::Setup) {
            if (surveySourceController.view() == SurveySetupView::Sources) {
                return {back, choose,
                        {NavigationKey::RightAndSelect,
                         UiTextId::NavToggle}};
            }
            if (surveySourceController.scope() != SurveySourceScope::All) {
                return {back, {},
                        {NavigationKey::RightAndSelect,
                         UiTextId::NavStart}};
            }
            return {back, choose,
                    {NavigationKey::RightAndSelect,
                     surveySourceController.selection() < 2
                         ? UiTextId::NavEnter : UiTextId::NavStart}};
        }
        if (surveyWorkflow.state() == SurveyWorkflowState::Running &&
            surveyController.view() == SurveyView::Filter) {
            return {{NavigationKey::Left, UiTextId::NavList}, choose,
                    {NavigationKey::RightAndSelect, UiTextId::NavApply}};
        }
        if (surveyWorkflow.state() == SurveyWorkflowState::Running &&
            surveyController.view() == SurveyView::Detail) {
            return {{NavigationKey::Left, UiTextId::NavList}, {},
                    {NavigationKey::RightAndSelect,
                     surveyWorkflow.simulated() ? UiTextId::NavStop
                                                : UiTextId::NavSave}};
        }
        if (surveyWorkflow.state() == SurveyWorkflowState::Running) {
            return {{NavigationKey::Left, UiTextId::NavCancel}, choose,
                    {NavigationKey::RightAndSelect,
                     surveyController.filterFocused()
                         ? UiTextId::NavFilter : UiTextId::NavDetails}};
        }
        if (wifiProductView == WifiProductView::Visit &&
            fieldSurveyTracker.result().complete()) {
            return {{NavigationKey::Left, UiTextId::NavHome}, {},
                    {NavigationKey::RightAndSelect, UiTextId::NavExport}};
        }
        return {{NavigationKey::Left, UiTextId::NavHome}, {}, {}};
    }

    if (uiController.page() == 3) {
        if (libraryController.view() == LibraryView::ExportReady) {
            return {{NavigationKey::Left, UiTextId::NavDetails}, {}, {}};
        }
        if (libraryController.view() == LibraryView::SessionDetail) {
            return {{NavigationKey::Left, UiTextId::NavList}, {},
                    {NavigationKey::RightAndSelect, UiTextId::NavExport}};
        }
        return {back, choose,
                {NavigationKey::RightAndSelect, UiTextId::NavDetails}};
    }

    if (uiController.page() == 4) {
        if (captureView == CaptureView::SourceMenu) {
            return {back, choose, enter};
        }
        if (captureView == CaptureView::Infrared) {
            const auto state = infraredCapture.stats().state;
            if (state == InfraredCaptureState::Idle) {
                return {back, {},
                        {NavigationKey::RightAndSelect, UiTextId::NavStart}};
            }
            if (state == InfraredCaptureState::Waiting ||
                state == InfraredCaptureState::Capturing) {
                return {{NavigationKey::Left, UiTextId::NavCancel}, {}, {}};
            }
            if (state == InfraredCaptureState::Complete &&
                infraredCapturePersistState == CapturePersistState::Result) {
                return {back, {},
                        {NavigationKey::RightAndSelect, UiTextId::NavSave}};
            }
            if (infraredCapturePersistState == CapturePersistState::Saving) {
                return {{}, {}, {}};
            }
            if (state == InfraredCaptureState::Complete) {
                return {back, {},
                        {NavigationKey::RightAndSelect, UiTextId::NavStart}};
            }
            return {back, {},
                    {NavigationKey::RightAndSelect, UiTextId::NavStart}};
        }
        const auto state = wifiFrameCapture.stats().state;
        if (state == WifiFrameCaptureState::Idle) {
            return {back, {},
                    {NavigationKey::RightAndSelect, UiTextId::NavStart}};
        }
        if (state == WifiFrameCaptureState::Running) {
            return {{NavigationKey::Left, UiTextId::NavCancel}, {},
                    {NavigationKey::RightAndSelect, UiTextId::NavStop}};
        }
        if (state == WifiFrameCaptureState::Complete &&
            capturePersistState == CapturePersistState::Result) {
            return {back, {},
                    {NavigationKey::RightAndSelect, UiTextId::NavSave}};
        }
        if (state == WifiFrameCaptureState::Complete &&
            capturePersistState == CapturePersistState::Confirm) {
            return {{NavigationKey::Left, UiTextId::NavBack}, {},
                    {NavigationKey::RightAndSelect, UiTextId::NavSave}};
        }
        return {back, {}, {}};
    }

    if (uiController.page() == 5) {
        return {back, choose,
                {NavigationKey::RightAndSelect, UiTextId::NavApply}};
    }

