anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    if (uiController.page() == 6) {
        if (selfTestController.view() == SelfTestView::ModeMenu) {
            return {back, choose, enter};
        }
        if (selfTestController.view() == SelfTestView::Preflight) {
            return {{NavigationKey::Left, UiTextId::NavModes}, {},
                    {NavigationKey::RightAndSelect, UiTextId::NavStart}};
        }
        if (selfTestController.view() == SelfTestView::VisualCheck) {
            return {{NavigationKey::Left, UiTextId::NavCancel}, {},
                    {NavigationKey::RightAndSelect, UiTextId::NavNext}};
        }
        if (selfTestController.view() == SelfTestView::ActiveChecks) {
            return {{NavigationKey::Left, UiTextId::NavCancel}, {}, {}};
        }
        return {{NavigationKey::Left, UiTextId::NavModes}, {}, {}};
    }
    if (uiController.page() == 7) {
        if (targetsMutationState == TargetsMutationState::Saving) {
            return {{}, {}, {}};
        }
        if (webCompanionOverlay) {
            return {{NavigationKey::Left,
                     webCompanionConnectivity.authorized()
                         ? UiTextId::NavStop : UiTextId::NavBack},
                    {},
                    webCompanionConnectivity.authorized()
                        ? NavigationCell{}
                        : NavigationCell{NavigationKey::RightAndSelect,
                                         UiTextId::NavStart}};
        }
        if (targetsProductRuntime == nullptr) return {back, {}, {}};
        if (targetsProductRuntime->controller.view() == TargetsView::List) {
            return targetsProductRuntime->controller.entryCount() == 0
                ? NavigationFooter{back, {}, {}}
                : NavigationFooter{back, choose, enter};
        }
        if (targetsProductRuntime->controller.view() == TargetsView::Compare) {
            return targetsProductRuntime->controller.comparisonSize() == 0
                ? NavigationFooter{
                      {NavigationKey::Left, UiTextId::NavList}, {}, {}}
                : NavigationFooter{
                      {NavigationKey::Left, UiTextId::NavList}, choose, enter};
        }
        if (targetsProductRuntime->controller.view() ==
            TargetsView::CompareDetail) {
            return {{NavigationKey::Left, UiTextId::NavChanges}, {}, {}};
        }
        if (targetsProductRuntime->controller.view() ==
            TargetsView::CorrelationList) {
            return {{NavigationKey::Left, UiTextId::NavActions}, choose,
                    {NavigationKey::RightAndSelect, UiTextId::NavEnter}};
        }
        if (targetsProductRuntime->controller.view() ==
            TargetsView::CorrelationReview) {
            return {{NavigationKey::Left, UiTextId::NavBack}, choose,
                    {NavigationKey::RightAndSelect,
                     targetsProductRuntime->controller
                                 .correlationReviewSelection() < 2
                         ? UiTextId::NavEnter : UiTextId::NavApply}};
        }
        if (targetsProductRuntime->controller.view() ==
            TargetsView::CorrelationEvidence) {
            return {{NavigationKey::Left, UiTextId::NavBack}, {}, {}};
        }
        if (targetsProductRuntime->controller.view() == TargetsView::MergeList) {
            return {{NavigationKey::Left, UiTextId::NavActions}, choose,
                    {NavigationKey::RightAndSelect, UiTextId::NavEnter}};
        }
        if (targetsProductRuntime->controller.view() ==
                TargetsView::MergeConfirm ||
            targetsProductRuntime->controller.view() ==
                TargetsView::SplitConfirm) {
            return {{NavigationKey::Left, UiTextId::NavBack}, {},
                    {NavigationKey::RightAndSelect, UiTextId::NavApply}};
        }
        if (targetsProductRuntime->controller.view() == TargetsView::NameEdit) {
            const std::size_t selection =
                targetsProductRuntime->controller.nameEditorSelection();
            return {{NavigationKey::Left, UiTextId::NavCancel}, choose,
                    {NavigationKey::RightAndSelect,
                     selection == 3 ? UiTextId::NavSave
                                    : UiTextId::NavApply}};
        }
        if (targetsProductRuntime->controller.view() == TargetsView::TagEdit) {
            const std::size_t selection =
                targetsProductRuntime->controller.tagEditorSelection();
            return {{NavigationKey::Left, UiTextId::NavCancel}, choose,
                    {NavigationKey::RightAndSelect,
                     selection == 3 ? UiTextId::NavSave
                                    : UiTextId::NavApply}};
        }
        if (targetsProductRuntime->controller.view() == TargetsView::TagList) {
            return {{NavigationKey::Left, UiTextId::NavActions}, choose,
                    {NavigationKey::RightAndSelect,
                     targetsProductRuntime->controller.selectedTagIsAdd()
                         ? UiTextId::NavEnter : UiTextId::NavDelete}};
        }
        if (targetsProductRuntime->controller.view() ==
            TargetsView::NotesEdit) {
            const std::size_t selection =
                targetsProductRuntime->controller.notesEditorSelection();
            return {{NavigationKey::Left, UiTextId::NavCancel}, choose,
                    {NavigationKey::RightAndSelect,
                     selection == 3 ? UiTextId::NavSave
                                    : UiTextId::NavApply}};
        }
        if (targetsProductRuntime->controller.view() ==
            TargetsView::Actions) {
            return {{NavigationKey::Left, UiTextId::NavDetails}, choose,
                    {NavigationKey::RightAndSelect,
                     targetsProductRuntime->controller.selectedAction() ==
                             TargetActionItem::Favorite
                         ? UiTextId::NavToggle : UiTextId::NavEnter}};
        }
        return {{NavigationKey::Left, UiTextId::NavList}, {},
                {NavigationKey::RightAndSelect, UiTextId::NavActions}};
    }
    if (uiController.page() == 8U) {
        return automationCatalogRefreshPending ||
                       automationPackageCatalog.size() == 0U
            ? NavigationFooter{back, {}, {}}
            : NavigationFooter{back, choose, enter};
    }
    if (uiController.page() == kAutomationInspectorPage) {
        return {back, {}, {}};
    }
    if (uiController.page() == kDeviceLockPage) {
        const DeviceLockView view = deviceLockController.view();
        if (view == DeviceLockView::Working) return {};
        if (view == DeviceLockView::EnterPin ||
            view == DeviceLockView::ConfirmPin) {
            return {
                {NavigationKey::Left, UiTextId::NavCancel},
                {NavigationKey::UpDown, UiTextId::NavDigit},
                {NavigationKey::RightAndSelect,
                 deviceLockController.cursor() + 1U >=
                         DeviceLockController::kProductPinDigits
                     ? UiTextId::NavConfirm : UiTextId::NavNext},
            };
        }
        const auto state = deviceLockController.audit().state;
        if (state ==
            leshy1::services::security::DeviceLockState::Unconfigured) {
            return {back, {},
                    {NavigationKey::RightAndSelect, UiTextId::NavSetup}};
        }
        if (state == leshy1::services::security::DeviceLockState::Locked) {
            return {back, {},
                    {NavigationKey::RightAndSelect, UiTextId::NavUnlock}};
        }
        if (state == leshy1::services::security::DeviceLockState::Unlocked) {
            return {back, {},
                    {NavigationKey::RightAndSelect, UiTextId::NavLock}};
        }
        return {back, {}, {}};
    }
    if (uiController.page() == kSerialConsolePage) {
        if (serialConsoleUiView == SerialConsoleUiView::Running) {
            return {{NavigationKey::Left, UiTextId::NavCancel}, {}, {}};
        }
        if (serialConsoleUiView == SerialConsoleUiView::Confirm) {
            return {{NavigationKey::Left, UiTextId::NavBack}, {},
                    {NavigationKey::RightAndSelect,
                     UiTextId::NavConfirm}};
        }
        if (serialConsoleUiView == SerialConsoleUiView::Result) {
            return {back, {},
                    {NavigationKey::RightAndSelect, UiTextId::NavAgain}};
        }
        if (serialConsoleLastPreflight !=
            leshy1::services::serial::SerialConsolePreflightStatus::Ready) {
            return {back, {}, {}};
        }
        return {back, choose,
                {NavigationKey::RightAndSelect,
                 serialConsoleUiSelection == 3U
                     ? UiTextId::NavStart : UiTextId::NavToggle}};
    }
    if (uiController.page() == kDevicePage) return {back, choose, enter};
    return {back, {}, {}};
}

constexpr std::int16_t kNavigationInset = 6;
constexpr std::int16_t kNavigationGap = 4;
constexpr std::int16_t kNavigationArrowWidth = 9;
constexpr std::int16_t kNavigationUpDownWidth = 23;

std::int16_t navigationKeyWidth(NavigationKey key) {
    if (key == NavigationKey::Left) return kNavigationArrowWidth;
    if (key == NavigationKey::UpDown) return kNavigationUpDownWidth;
    if (key == NavigationKey::RightAndSelect) {
        selectUiFont(UiTextRole::Meta);
        return display.textWidth(tr(UiTextId::NavOk)) + 3 +
               kNavigationArrowWidth;
    }
    return 0;
}

