anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void renderNavigationKey(NavigationKey key, std::int16_t x,
                         std::int16_t centerY, std::int16_t textTop) {
    if (key == NavigationKey::Left) {
        display.fillTriangle(x, centerY, x + 8, centerY - 5,
                             x + 8, centerY + 5, Palette::TextSecondary);
    } else if (key == NavigationKey::UpDown) {
        display.fillTriangle(x, centerY + 2, x + 5, centerY - 4,
                             x + 10, centerY + 2,
                             Palette::TextSecondary);
        display.fillTriangle(x + 12, centerY - 2, x + 17, centerY + 4,
                             x + 22, centerY - 2,
                             Palette::TextSecondary);
    } else if (key == NavigationKey::RightAndSelect) {
        display.setTextColor(Palette::TextSecondary, Palette::Canvas);
        selectUiFont(UiTextRole::Meta);
        const char* ok = tr(UiTextId::NavOk);
        const std::int16_t okWidth = display.textWidth(ok);
        setUiCursor(UiTextRole::Meta, x, textTop);
        display.print(ok);
        const std::int16_t arrowX = x + okWidth + 3;
        display.fillTriangle(arrowX, centerY - 5, arrowX, centerY + 5,
                             arrowX + 8, centerY,
                             Palette::TextSecondary);
    }
}

void renderNavigationCell(std::uint8_t index, NavigationCell cell) {
    if (cell.key == NavigationKey::None || cell.label == UiTextId::Count) return;
    const Rect bounds = Components::navigationCell(index);
    const char* label = tr(cell.label);
    selectUiFont(UiTextRole::Meta);
    const std::int16_t labelWidth = display.textWidth(label);
    const std::int16_t keyWidth = navigationKeyWidth(cell.key);
    const std::int16_t totalWidth = keyWidth + kNavigationGap + labelWidth;
    const std::int16_t textHeight = kRobotoCondensedMetaAscent +
                                    kRobotoCondensedMetaDescent;
    const std::int16_t textTop = bounds.y + (bounds.height - textHeight) / 2;
    const std::int16_t centerY = bounds.y + bounds.height / 2;
    std::int16_t x = bounds.x + (bounds.width - totalWidth) / 2;
    if (index == 0) x = bounds.x + kNavigationInset;
    if (index == 2) {
        x = bounds.x + bounds.width - kNavigationInset - totalWidth;
    }
    display.setTextColor(Palette::TextSecondary, Palette::Canvas);
    if (cell.key == NavigationKey::RightAndSelect) {
        setUiCursor(UiTextRole::Meta, x, textTop);
        display.print(label);
        renderNavigationKey(cell.key, x + labelWidth + kNavigationGap,
                            centerY, textTop);
    } else {
        renderNavigationKey(cell.key, x, centerY, textTop);
        setUiCursor(UiTextRole::Meta, x + keyWidth + kNavigationGap,
                    textTop);
        display.print(label);
    }
}

void renderNavigationFooter() {
    const Rect hint = Components::footerHint();
    display.fillRect(hint.x, hint.y, hint.width, hint.height, Palette::Canvas);
    const NavigationFooter footer = navigationFooterForCurrentState();
    renderNavigationCell(0, footer.left);
    renderNavigationCell(1, footer.middle);
    renderNavigationCell(2, footer.right);
}

std::uint16_t toneColor(Tone tone) {
    switch (tone) {
        case Tone::Focus:
            return Palette::Focus;
        case Tone::Positive:
            return Palette::Positive;
        case Tone::Warning:
            return Palette::Warning;
        case Tone::Danger:
            return Palette::Danger;
        case Tone::Muted:
            return Palette::TextMuted;
        case Tone::Neutral:
        default:
            return Palette::TextSecondary;
    }
}

const char* headerReceiverStatus() {
    if (nrf24SpectrumController.state() ==
        Nrf24SpectrumViewState::Running) {
        static char nrfReceivers[12] = {};
        std::size_t at = 0;
        at += static_cast<std::size_t>(std::snprintf(
            nrfReceivers, sizeof(nrfReceivers), "RX N"));
        bool first = true;
        for (std::uint8_t slot = 0; slot < 3 && at + 2 < sizeof(nrfReceivers);
             ++slot) {
            if ((nrf24SpectrumReport.activeSlotMask & (1U << slot)) == 0) {
                continue;
            }
            at += static_cast<std::size_t>(std::snprintf(
                nrfReceivers + at, sizeof(nrfReceivers) - at,
                first ? "%u" : "+%u", static_cast<unsigned>(slot + 1U)));
            first = false;
        }
        return nrfReceivers;
    }
    if (cc1101SpectrumController.state() ==
        Cc1101SpectrumViewState::Running) {
        return "RX CC";
    }
    if (wifiFrameCapture.stats().state == WifiFrameCaptureState::Running ||
        wifiFrameCapture.deviceMonitorStats().active ||
        wifiFrameCapture.channelMonitorStats().active) {
        return "RX WIFI";
    }
    if (infraredCapture.stats().state == InfraredCaptureState::Waiting ||
        infraredCapture.stats().state == InfraredCaptureState::Capturing) {
        return "RX IR";
    }
    if (productSurveyRuntime.sourceActive) {
        const std::uint8_t wifiMask = leshy1::services::survey::sourceMask(
            RadioKind::Wifi);
        const std::uint8_t bleMask = leshy1::services::survey::sourceMask(
            RadioKind::Ble);
        const bool wifi =
            (productSurveyRuntime.activeSourceMask & wifiMask) != 0;
        const bool ble =
            (productSurveyRuntime.activeSourceMask & bleMask) != 0;
        if (wifi && ble) return "RX W+B";
        if (wifi) return "RX WIFI";
        if (ble) return "RX BLE";
    }
    return "RX --";
}

void renderHeaderStatus() {
    if (safetySupervisor.latched()) {
        constexpr const char* stopped = "STOP";
        selectUiFont(UiTextRole::Meta);
        const std::int16_t x = Layout::ScreenWidth - 6 -
                               display.textWidth(stopped);
        display.setTextColor(Palette::Danger, Palette::Header);
        setUiCursor(UiTextRole::Meta, x, 5);
        display.print(stopped);
        return;
    }
    const char* receiver = headerReceiverStatus();
    constexpr const char* transmitter = "TX --";
    const bool receiving = receiver[3] != '-';

    selectUiFont(UiTextRole::Meta);
    const std::int16_t transmitterWidth = display.textWidth(transmitter);
    const std::int16_t receiverWidth = display.textWidth(receiver);
    const std::int16_t transmitterX =
        Layout::ScreenWidth - 6 - transmitterWidth;
    const std::int16_t receiverX = transmitterX - 6 - receiverWidth;
    display.setTextColor(receiving ? Palette::Positive : Palette::TextMuted,
                         Palette::Header);
    setUiCursor(UiTextRole::Meta, receiverX, 5);
    display.print(receiver);
    display.setTextColor(Palette::TextMuted, Palette::Header);
    setUiCursor(UiTextRole::Meta, transmitterX, 5);
    display.print(transmitter);
}

void formatHomeVersion(char* output, std::size_t capacity) {
    if (output == nullptr || capacity == 0) return;
    std::size_t written = 0;
    if (capacity > 1) output[written++] = 'v';
    const char* source = LESHY1_VERSION;
    while (*source != '\0' && *source != '-' && written + 1 < capacity) {
        output[written++] = *source++;
    }
    output[written] = '\0';
}

void renderHeader(const char* title, bool clearContent) {
    const Rect header = Components::header();
    display.fillRect(header.x, header.y, header.width, header.height,
                     Palette::Header);
    if (clearContent) {
        display.fillRect(0, header.y + header.height, Layout::ScreenWidth,
                         Layout::ScreenHeight - header.height,
                         Palette::Canvas);
    }
    display.setTextColor(Palette::TextPrimary, Palette::Header);
    const bool home = uiController.isRoot() && !safetySupervisor.latched();
    if (home) {
        const char* brand = tr(UiTextId::Brand);
        selectUiFont(UiTextRole::Body);
        const std::int16_t brandWidth = display.textWidth(brand);
        setUiCursor(UiTextRole::Body, 10, 2);
        display.print(brand);
        char version[24] = {};
        formatHomeVersion(version, sizeof(version));
        display.setTextColor(Palette::TextMuted, Palette::Header);
        const std::int16_t versionTop = 2 + kRobotoCondensedBodyAscent -
                                        kRobotoCondensedMetaAscent;
        setUiCursor(UiTextRole::Meta, 10 + brandWidth + 5, versionTop);
        display.print(version);
    } else {
        const Rect titleBounds = Components::title();
        setUiCursor(UiTextRole::Meta, titleBounds.x, titleBounds.y);
        display.print(title);
    }
    renderHeaderStatus();
}

void renderFocusCue(Rect bounds, bool selected) {
    if (!selected) return;
    display.drawRoundRect(bounds.x, bounds.y, bounds.width, bounds.height,
                          Layout::Radius, Palette::Focus);
    const Rect marker = Components::focusMarker(bounds);
    display.fillTriangle(marker.x, marker.y,
                         marker.x, marker.y + marker.height,
                         marker.x + marker.width,
                         marker.y + marker.height / 2,
                         Palette::Focus);
}

constexpr std::int16_t kInteractiveRowTextInset = 12;

std::int16_t menuRowTextTop(Rect bounds) {
    constexpr std::int16_t kLineGap = 1;
    constexpr std::int16_t kTextBlockHeight =
        kRobotoCondensedBodyAscent + kRobotoCondensedBodyDescent +
        kLineGap + kRobotoCondensedMetaAscent + kRobotoCondensedMetaDescent;
    return static_cast<std::int16_t>(
        bounds.y + (bounds.height - kTextBlockHeight) / 2);
}

void renderMenuRow(Rect bounds, const char* label, const char* note,
                   bool selected, bool enabled, Tone noteTone) {
    const std::uint16_t background = selected
        ? (enabled ? Palette::SurfaceFocus : Palette::SurfaceFocusDisabled)
        : Palette::Surface;
    display.fillRoundRect(bounds.x, bounds.y, bounds.width, bounds.height,
                          Layout::Radius, background);
    renderFocusCue(bounds, selected);
    display.setTextColor(selected ? Palette::Focus : Palette::TextSecondary,
                         background);
    const std::int16_t labelTop = menuRowTextTop(bounds);
    setUiCursor(UiTextRole::Body,
                bounds.x + kInteractiveRowTextInset, labelTop);
    display.print(label);
    display.setTextColor(enabled ? toneColor(noteTone) : Palette::TextMuted,
                         background);
    setUiCursor(
        UiTextRole::Meta, bounds.x + kInteractiveRowTextInset,
        labelTop + kRobotoCondensedBodyAscent +
            kRobotoCondensedBodyDescent + 1);
    display.print(note);
}

