anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void renderMetric(std::uint8_t index, const char* text,
                  Tone tone = Tone::Neutral) {
    const Rect bounds = Components::metricRow(index);
    display.setTextColor(toneColor(tone), Palette::Canvas);
    setUiCursor(UiTextRole::Body, bounds.x + 2, bounds.y - 2);
    display.print(text);
}

void renderStateCard(const char* state, const char* detail, Tone tone,
                     std::uint8_t step) {
    const Rect bounds = Components::stateCard();
    display.fillRoundRect(bounds.x, bounds.y, bounds.width, bounds.height,
                          Layout::Radius, Palette::Surface);
    display.drawRoundRect(bounds.x, bounds.y, bounds.width, bounds.height,
                          Layout::Radius, toneColor(tone));
    display.drawRect(bounds.x + 12, bounds.y + 15, 18, 18, toneColor(tone));
    display.setTextColor(toneColor(tone), Palette::Surface);
    setUiCursor(UiTextRole::Body, bounds.x + 40, bounds.y + 10);
    display.print(state);
    display.setTextColor(Palette::TextSecondary, Palette::Surface);
    setUiCursor(UiTextRole::Meta, bounds.x + 16, bounds.y + 50);
    display.print(detail);
    char line[40] = {};
    std::snprintf(line, sizeof(line), tr(UiTextId::VisualStepFormat),
                  static_cast<unsigned>(step + 1U));
    display.setTextColor(Palette::TextMuted, Palette::Surface);
    setUiCursor(UiTextRole::Meta, bounds.x + 16, bounds.y + 78);
    display.print(line);
}

UiTextId homeLabel(const AppMenuItem& item) {
    if (std::strcmp(item.id, "wifi") == 0) return UiTextId::AppWifi;
    if (std::strcmp(item.id, "ble") == 0) return UiTextId::AppBle;
    if (std::strcmp(item.id, "spectrum24") == 0) {
        return UiTextId::AppSpectrum24;
    }
    if (std::strcmp(item.id, "subghz") == 0) return UiTextId::AppSubGhz;
    if (std::strcmp(item.id, "survey") == 0) return UiTextId::AppSurvey;
    if (std::strcmp(item.id, "library") == 0) return UiTextId::AppLibrary;
    if (std::strcmp(item.id, "capture") == 0) return UiTextId::AppCapture;
    if (std::strcmp(item.id, "targets") == 0) return UiTextId::AppTargets;
    if (std::strcmp(item.id, "lab") == 0) return UiTextId::AppLab;
    return UiTextId::AppDevice;
}

UiTextId homeNote(const AppMenuItem& item) {
    if (std::strcmp(item.id, "wifi") == 0) {
        return item.enabled ? UiTextId::NoteWifiReady
                            : UiTextId::NoteSurveyUnavailable;
    }
    if (std::strcmp(item.id, "ble") == 0) {
        return item.enabled ? UiTextId::NoteBleReady
                            : UiTextId::NoteSurveyUnavailable;
    }
    if (std::strcmp(item.id, "spectrum24") == 0) {
        return UiTextId::NoteSpectrum24;
    }
    if (std::strcmp(item.id, "subghz") == 0) {
        return UiTextId::NoteSubGhz;
    }
    if (std::strcmp(item.id, "survey") == 0) {
        if (item.simulated) return UiTextId::NoteSurveySimulated;
        if (!item.enabled) return UiTextId::NoteSurveyUnavailable;
        if (std::strcmp(item.reason, "passive / persistent") == 0) {
            return UiTextId::NoteSurveyPersistent;
        }
    }
    if (std::strcmp(item.id, "library") == 0) {
        if (item.simulated) return UiTextId::NoteLibrarySimulated;
        if (!item.enabled) return UiTextId::NoteLibraryUnavailable;
        return UiTextId::NoteLibraryReady;
    }
    if (std::strcmp(item.id, "capture") == 0) {
        return item.enabled ? UiTextId::NoteCaptureReady
                            : UiTextId::NoteCaptureUnavailable;
    }
    if (std::strcmp(item.id, "targets") == 0) {
        return item.enabled ? UiTextId::NoteTargetsReady
                            : UiTextId::NoteTargetsUnavailable;
    }
    if (std::strcmp(item.id, "lab") == 0) return UiTextId::NoteLabReady;
    if (std::strcmp(item.id, "device") == 0) return UiTextId::NoteDevice;
    return UiTextId::Ready;
}

constexpr std::uint8_t kVisibleHomeRows = 4;

std::uint8_t homeFirstVisible(std::uint8_t selection) {
    return selection < kVisibleHomeRows
               ? 0U
               : static_cast<std::uint8_t>(selection -
                                           (kVisibleHomeRows - 1U));
}

void renderHomeRow(std::uint8_t index, std::uint8_t firstVisible) {
    const AppMenuItem* item = appCatalog.get(index);
    if (item == nullptr) return;
    if (index < firstVisible || index >= firstVisible + kVisibleHomeRows) return;
    const Rect bounds = Components::homeRow(
        static_cast<std::uint8_t>(index - firstVisible));
    const bool selected = uiController.selection() == index;
    renderMenuRow(bounds, tr(homeLabel(*item)), tr(homeNote(*item)), selected,
                  item->enabled,
                  item->enabled ? Tone::Positive : Tone::Muted);
}

void renderHome(bool clearContent) {
    renderHeader(tr(UiTextId::HomeTitle), clearContent);
    const std::uint8_t first = homeFirstVisible(uiController.selection());
    const std::size_t end = appCatalog.size() < first + kVisibleHomeRows
                                ? appCatalog.size()
                                : first + kVisibleHomeRows;
    for (std::uint8_t i = first; i < end; ++i) {
        renderHomeRow(i, first);
    }
}

void formatAutomationPackageDisplayName(const char* source, char* output,
                                        std::size_t capacity) {
    if (output == nullptr || capacity == 0U) return;
    output[0] = '\0';
    if (source == nullptr) return;
    constexpr std::size_t kVisibleCharacters = 25U;
    const std::size_t length = std::strlen(source);
    if (length <= kVisibleCharacters) {
        std::snprintf(output, capacity, "%s", source);
        return;
    }
    std::snprintf(output, capacity, "%.*s...", 22, source);
}

void renderAutomationPackageRow(std::uint8_t index) {
    const AutomationPackageCatalogEntry* entry =
        automationPackageCatalog.get(index);
    if (entry == nullptr) return;
    char label[32] = {};
    char note[64] = {};
    formatAutomationPackageDisplayName(entry->name.data(), label,
                                       sizeof(label));
    if (index + 1U == AutomationPackageCatalog::kCapacity &&
        automationCatalogOmittedEntries != 0U) {
        std::snprintf(note, sizeof(note),
                      tr(UiTextId::AutomationLibraryOmittedFormat),
                      static_cast<unsigned long>(
                          automationCatalogOmittedEntries));
    } else {
        std::snprintf(note, sizeof(note),
                      tr(UiTextId::AutomationPackageBytesFormat),
                      static_cast<unsigned long>(entry->size));
    }
    const bool bounded = entry->size <=
        leshy1::apps::automation::kAutomationMaximumPackageBytes;
    renderMenuRow(Components::homeRow(index), label, note,
                  automationPackageCatalog.selection() == index, true,
                  bounded ? Tone::Positive : Tone::Warning);
}

