anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void renderAutomationLibraryPage(bool clearContent) {
    renderHeader(tr(UiTextId::AutomationLibraryTitle), clearContent);
    if (automationCatalogRefreshPending) {
        renderMetric(0, tr(UiTextId::AutomationLibraryLoading),
                     Tone::Neutral);
        renderMetric(2, tr(UiTextId::AutomationLibraryReadOnly),
                     Tone::Positive);
        return;
    }
    if (automationCatalogStatus != BoardAutomationPackageStatus::Ready) {
        renderMetric(0, tr(UiTextId::AutomationLibraryNoMedia),
                     Tone::Warning);
        renderMetric(2, tr(UiTextId::AutomationLibraryPath), Tone::Muted);
        renderMetric(4, tr(UiTextId::AutomationLibraryReadOnly),
                     Tone::Positive);
        return;
    }
    if (automationPackageCatalog.size() == 0U) {
        renderMetric(0, tr(UiTextId::AutomationLibraryEmpty), Tone::Muted);
        renderMetric(2, tr(UiTextId::AutomationLibraryPath), Tone::Neutral);
        renderMetric(4, tr(UiTextId::AutomationLibraryReadOnly),
                     Tone::Positive);
        return;
    }
    for (std::uint8_t index = 0U;
         index < automationPackageCatalog.size(); ++index) {
        renderAutomationPackageRow(index);
    }
}

UiTextId automationInspectorHeadline(const AutomationInspectorModel& model) {
    if (model.sourceStatus == AutomationInspectorSourceStatus::TooLarge) {
        return UiTextId::AutomationInspectorTooLarge;
    }
    if (model.sourceStatus == AutomationInspectorSourceStatus::ReadFailed) {
        return UiTextId::AutomationInspectorReadFailed;
    }
    if (model.inspection.parseStatus != AutomationParseStatus::Parsed) {
        return UiTextId::AutomationInspectorRejected;
    }
    if (model.inspection.policyStatus != AutomationPolicyStatus::Ready) {
        return UiTextId::AutomationInspectorPolicyRejected;
    }
    if (model.inspection.trustStatus ==
        AutomationTrustStatus::VerifiedTrusted) {
        return UiTextId::AutomationInspectorVerified;
    }
    if (model.inspection.trustStatus ==
        AutomationTrustStatus::MissingSignature) {
        return UiTextId::AutomationInspectorUnsigned;
    }
    return UiTextId::AutomationInspectorUntrusted;
}

UiTextId automationInspectorKind(const AutomationInspectorModel& model) {
    switch (model.inspection.kind) {
        case AutomationPackageKind::ActionScript:
            return UiTextId::AutomationInspectorActionKind;
        case AutomationPackageKind::UsbHid:
            return UiTextId::AutomationInspectorUsbKind;
        case AutomationPackageKind::BleHid:
            return UiTextId::AutomationInspectorBleKind;
    }
    return UiTextId::AutomationInspectorActionKind;
}

void renderAutomationInspectorPage(bool clearContent) {
    renderHeader(tr(UiTextId::AutomationInspectorTitle), clearContent);
    if (automationInspectionPending) {
        renderMetric(0, tr(UiTextId::AutomationInspectorLoading),
                     Tone::Neutral);
        renderMetric(6, tr(UiTextId::AutomationInspectorNoOutput),
                     Tone::Positive);
        return;
    }
    const AutomationInspectorModel& model =
        automationInspectorController.model();
    char line[96] = {};
    char name[32] = {};
    formatAutomationPackageDisplayName(model.sourceName.data(), name,
                                       sizeof(name));
    renderMetric(0, tr(automationInspectorHeadline(model)),
                 model.inspection.executionEligible ? Tone::Positive
                                                     : Tone::Warning);
    std::snprintf(line, sizeof(line), "%s · %lu B", name,
                  static_cast<unsigned long>(model.sourceSize));
    renderMetric(1, line, Tone::Neutral);

    if (model.sourceStatus == AutomationInspectorSourceStatus::Inspected &&
        model.inspection.parseStatus == AutomationParseStatus::Parsed) {
        renderMetric(2, tr(automationInspectorKind(model)), Tone::Neutral);
        std::snprintf(line, sizeof(line),
                      tr(UiTextId::AutomationInspectorCountsFormat),
                      static_cast<unsigned>(model.inspection.observedSteps),
                      static_cast<unsigned>(model.inspection.activeEvents));
        renderMetric(3, line);
        std::snprintf(
            line, sizeof(line),
            tr(UiTextId::AutomationInspectorLimitsFormat),
            static_cast<unsigned long>(model.inspection.runtimeCeilingMs /
                                       1000U),
            static_cast<unsigned>(model.inspection.outputCeilingBytes));
        renderMetric(4, line);
        if (model.inspection.policyStatus != AutomationPolicyStatus::Ready) {
            std::snprintf(
                line, sizeof(line),
                tr(UiTextId::AutomationInspectorPolicyFormat),
                leshy1::apps::automation::automationPolicyStatusName(
                    model.inspection.policyStatus));
        } else {
            std::snprintf(
                line, sizeof(line),
                tr(UiTextId::AutomationInspectorTrustFormat),
                leshy1::apps::automation::automationTrustStatusName(
                    model.inspection.trustStatus));
        }
        renderMetric(5, line, Tone::Muted);
    } else {
        std::snprintf(
            line, sizeof(line),
            tr(UiTextId::AutomationInspectorParseFormat),
            leshy1::apps::automation::automationParseStatusName(
                model.inspection.parseStatus));
        renderMetric(3, line, Tone::Danger);
    }
    renderMetric(7, tr(UiTextId::AutomationInspectorNoOutput),
                 Tone::Positive);
}

std::uint8_t deviceFirstVisible(std::uint8_t selection) {
    return selection < kVisibleHomeRows
               ? 0U
               : static_cast<std::uint8_t>(selection -
                                           (kVisibleHomeRows - 1U));
}

UiTextId deviceLabel(std::uint8_t index) {
    switch (index) {
        case 0: return UiTextId::DevicePower;
        case 1: return UiTextId::DeviceSettings;
        case 2: return UiTextId::DeviceLockMenu;
        case 3: return UiTextId::DeviceSerialConsole;
        case 4: return UiTextId::DeviceAbout;
        case 5: return UiTextId::AppDiagnostics;
        default: return UiTextId::AppSelfTest;
    }
}

UiTextId deviceLockMenuNote() {
    switch (deviceLock.state()) {
        case leshy1::services::security::DeviceLockState::Unconfigured:
            return UiTextId::DeviceLockMenuOff;
        case leshy1::services::security::DeviceLockState::Unlocked:
            return UiTextId::DeviceLockMenuOpen;
        case leshy1::services::security::DeviceLockState::Locked:
        case leshy1::services::security::DeviceLockState::RetryDelay:
            return UiTextId::DeviceLockMenuLocked;
        case leshy1::services::security::DeviceLockState::RecoveryOnly:
        case leshy1::services::security::DeviceLockState::Fault:
            return UiTextId::DeviceLockMenuFault;
    }
    return UiTextId::DeviceLockMenuFault;
}

UiTextId deviceNote(std::uint8_t index) {
    switch (index) {
        case 0: return UiTextId::DevicePowerNote;
        case 1: return UiTextId::DeviceSettingsNote;
        case 2: return deviceLockMenuNote();
        case 3:
            return BoardProfile::kRfShieldDeclared
                ? UiTextId::DeviceSerialConsoleConflict
                : UiTextId::DeviceSerialConsoleReady;
        case 4: return UiTextId::DeviceAboutNote;
        case 5: return UiTextId::DeviceDiagnosticsNote;
        default: return UiTextId::NoteSelfTest;
    }
}

