anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void renderDeviceRow(std::uint8_t index, std::uint8_t firstVisible) {
    if (index < firstVisible ||
        index >= firstVisible + kVisibleHomeRows ||
        index >= kDeviceItemCount) return;
    const Rect bounds = Components::homeRow(
        static_cast<std::uint8_t>(index - firstVisible));
    renderMenuRow(bounds, tr(deviceLabel(index)), tr(deviceNote(index)),
                  deviceSelection == index, true, Tone::Positive);
}

void renderDevicePage(bool clearContent) {
    renderHeader(tr(UiTextId::DeviceTitle), clearContent);
    const std::uint8_t first = deviceFirstVisible(deviceSelection);
    const std::uint8_t end = static_cast<std::uint8_t>(
        kDeviceItemCount < first + kVisibleHomeRows
            ? kDeviceItemCount : first + kVisibleHomeRows);
    for (std::uint8_t index = first; index < end; ++index) {
        renderDeviceRow(index, first);
    }
}

UiTextId deviceLockStateText(
    leshy1::services::security::DeviceLockState state) {
    switch (state) {
        case leshy1::services::security::DeviceLockState::Unconfigured:
            return UiTextId::DeviceLockUnconfigured;
        case leshy1::services::security::DeviceLockState::Locked:
            return UiTextId::DeviceLockLocked;
        case leshy1::services::security::DeviceLockState::RetryDelay:
            return UiTextId::DeviceLockRetry;
        case leshy1::services::security::DeviceLockState::RecoveryOnly:
            return UiTextId::DeviceLockRecovery;
        case leshy1::services::security::DeviceLockState::Unlocked:
            return UiTextId::DeviceLockUnlocked;
        case leshy1::services::security::DeviceLockState::Fault:
            return UiTextId::DeviceLockFault;
    }
    return UiTextId::DeviceLockFault;
}

Tone deviceLockStateTone(
    leshy1::services::security::DeviceLockState state) {
    switch (state) {
        case leshy1::services::security::DeviceLockState::Unconfigured:
        case leshy1::services::security::DeviceLockState::Locked:
            return Tone::Warning;
        case leshy1::services::security::DeviceLockState::Unlocked:
            return Tone::Positive;
        case leshy1::services::security::DeviceLockState::RetryDelay:
            return Tone::Warning;
        case leshy1::services::security::DeviceLockState::RecoveryOnly:
        case leshy1::services::security::DeviceLockState::Fault:
            return Tone::Danger;
    }
    return Tone::Danger;
}

UiTextId deviceLockOutcomeText(DeviceLockUiOutcome outcome) {
    switch (outcome) {
        case DeviceLockUiOutcome::Configured:
            return UiTextId::DeviceLockConfigured;
        case DeviceLockUiOutcome::Unlocked:
            return UiTextId::DeviceLockOpened;
        case DeviceLockUiOutcome::Locked:
            return UiTextId::DeviceLockClosed;
        case DeviceLockUiOutcome::PinMismatch:
            return UiTextId::DeviceLockMismatch;
        case DeviceLockUiOutcome::WeakPin:
            return UiTextId::DeviceLockWeak;
        case DeviceLockUiOutcome::Failed:
            return UiTextId::DeviceLockFailed;
        case DeviceLockUiOutcome::None:
            break;
    }
    return UiTextId::DeviceLockProtectedClosed;
}

Tone deviceLockOutcomeTone(DeviceLockUiOutcome outcome) {
    switch (outcome) {
        case DeviceLockUiOutcome::Configured:
        case DeviceLockUiOutcome::Unlocked:
        case DeviceLockUiOutcome::Locked:
            return Tone::Positive;
        case DeviceLockUiOutcome::PinMismatch:
        case DeviceLockUiOutcome::WeakPin:
            return Tone::Warning;
        case DeviceLockUiOutcome::Failed:
            return Tone::Danger;
        case DeviceLockUiOutcome::None:
            return Tone::Muted;
    }
    return Tone::Muted;
}

void renderDeviceLockAction(UiTextId label) {
    const Rect bounds = Components::homeRow(3);
    renderMenuRow(bounds, tr(label), tr(UiTextId::DeviceLockSetupNote),
                  true, true, Tone::Positive);
}

void renderDeviceLockPinCells() {
    constexpr std::int16_t kCellWidth = 28;
    constexpr std::int16_t kCellGap = 7;
    constexpr std::int16_t kCellsWidth =
        static_cast<std::int16_t>(
            DeviceLockController::kProductPinDigits * kCellWidth +
            (DeviceLockController::kProductPinDigits - 1U) * kCellGap);
    constexpr std::int16_t kCellLeft =
        static_cast<std::int16_t>((Layout::ScreenWidth - kCellsWidth) / 2);
    constexpr std::int16_t kCellTop = 88;
    constexpr std::int16_t kCellHeight = 42;
    for (std::size_t index = 0;
         index < DeviceLockController::kProductPinDigits; ++index) {
        const bool selected = index == deviceLockController.cursor();
        const std::int16_t x = static_cast<std::int16_t>(
            kCellLeft + static_cast<std::int16_t>(index) *
                            (kCellWidth + kCellGap));
        const std::uint16_t background =
            selected ? Palette::SurfaceFocus : Palette::Surface;
        display.fillRoundRect(x, kCellTop, kCellWidth, kCellHeight,
                              Layout::Radius, background);
        display.drawRoundRect(x, kCellTop, kCellWidth, kCellHeight,
                              Layout::Radius,
                              selected ? Palette::Focus : Palette::Divider);
        char glyph[2] = {'-', '\0'};
        if (selected) {
            glyph[0] = static_cast<char>('0' + deviceLockController.digit());
        } else if (index < deviceLockController.cursor()) {
            glyph[0] = '*';
        }
        selectUiFont(UiTextRole::Body);
        display.setTextColor(selected ? Palette::Focus
                                      : Palette::TextSecondary,
                             background);
        const std::int16_t glyphX = static_cast<std::int16_t>(
            x + (kCellWidth - display.textWidth(glyph)) / 2);
        setUiCursor(UiTextRole::Body, glyphX, kCellTop + 10);
        display.print(glyph);
    }
}

void renderDeviceLockPinAdvanceAction() {
    const UiTextId next = deviceLockController.cursor() + 1U >=
                                  DeviceLockController::kProductPinDigits
        ? UiTextId::DeviceLockConfirmAction
        : UiTextId::DeviceLockNextAction;
    renderMenuRow(Components::homeRow(2), tr(next),
                  tr(UiTextId::DeviceLockTouchNote), true, true,
                  Tone::Positive);
}

void renderDeviceLockPinEditor() {
    const DeviceLockView view = deviceLockController.view();
    const UiTextId headline = view == DeviceLockView::ConfirmPin
        ? UiTextId::DeviceLockConfirmPin
        : (deviceLockController.intent() == DeviceLockIntent::Configure
               ? UiTextId::DeviceLockSetupPin
               : UiTextId::DeviceLockEnterPin);
    renderMetric(0, tr(headline), Tone::Positive);
    renderDeviceLockPinCells();

    display.setTextColor(Palette::TextSecondary, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 140);
    display.print(tr(UiTextId::DeviceLockDigitNote));
    renderDeviceLockPinAdvanceAction();
    renderMenuRow(Components::homeRow(3),
                  tr(UiTextId::DeviceLockCancelAction),
                  tr(UiTextId::DeviceLockTouchNote), false, true,
                  Tone::Muted);
}

void renderDeviceLockPage(bool clearContent) {
    renderHeader(tr(UiTextId::DeviceLockTitle), clearContent);
    const DeviceLockView view = deviceLockController.view();
    if (view == DeviceLockView::EnterPin ||
        view == DeviceLockView::ConfirmPin) {
        renderDeviceLockPinEditor();
        return;
    }
    if (view == DeviceLockView::Working) {
        renderMetric(
            0,
            tr(deviceLockController.intent() == DeviceLockIntent::Configure
                   ? UiTextId::DeviceLockSecuring
                   : UiTextId::DeviceLockVerifying),
            Tone::Positive);
        renderMetric(2, tr(UiTextId::DeviceLockResponsive), Tone::Muted);
        return;
    }

    const auto audit = deviceLockController.audit();
    renderMetric(0, tr(deviceLockStateText(audit.state)),
                 deviceLockStateTone(audit.state));
    char line[64] = {};
    if (audit.state ==
        leshy1::services::security::DeviceLockState::RetryDelay) {
        const unsigned long long seconds =
            static_cast<unsigned long long>(
                (audit.retryRemainingUs + 999999ULL) / 1000000ULL);
        std::snprintf(line, sizeof(line), tr(UiTextId::DeviceLockRetryFormat),
                      seconds);
        renderMetric(1, line, Tone::Warning);
    } else if (audit.state ==
               leshy1::services::security::DeviceLockState::Unlocked) {
        renderMetric(1, tr(UiTextId::DeviceLockAutoNote), Tone::Muted);
    } else if (audit.state ==
                   leshy1::services::security::DeviceLockState::RecoveryOnly ||
               audit.state ==
                   leshy1::services::security::DeviceLockState::Fault) {
        renderMetric(1, tr(UiTextId::DeviceLockRecoveryNote), Tone::Danger);
    } else {
        renderMetric(1, tr(UiTextId::DeviceLockProtectedClosed), Tone::Muted);
    }
    if (audit.failedAttempts != 0U) {
        std::snprintf(line, sizeof(line),
                      tr(UiTextId::DeviceLockAttemptsFormat),
                      static_cast<unsigned>(audit.failedAttempts));
        renderMetric(2, line, Tone::Warning);
    }
    if (deviceLockController.outcome() != DeviceLockUiOutcome::None) {
        renderMetric(3,
                     tr(deviceLockOutcomeText(deviceLockController.outcome())),
                     deviceLockOutcomeTone(deviceLockController.outcome()));
    }

    if (audit.state ==
        leshy1::services::security::DeviceLockState::Unconfigured) {
        renderDeviceLockAction(UiTextId::DeviceLockSetupAction);
    } else if (audit.state ==
               leshy1::services::security::DeviceLockState::Locked) {
        renderDeviceLockAction(UiTextId::DeviceLockUnlockAction);
    } else if (audit.state ==
               leshy1::services::security::DeviceLockState::Unlocked) {
        renderDeviceLockAction(UiTextId::DeviceLockLockAction);
    }
}

void renderDeviceLockBlockedPage(bool clearContent) {
    renderHeader(tr(UiTextId::DeviceLockTitle), clearContent);
    const auto audit = deviceLock.audit(
        static_cast<std::uint64_t>(esp_timer_get_time()));
    renderMetric(0, tr(deviceLockStateText(audit.state)),
                 deviceLockStateTone(audit.state));
    renderMetric(1, tr(UiTextId::DeviceLockProtectedClosed), Tone::Danger);
    renderMetric(2, tr(audit.state ==
                               leshy1::services::security::
                                   DeviceLockState::Unconfigured
                           ? UiTextId::DeviceLockSetupNote
                           : UiTextId::DeviceLockRecoveryNote),
                 Tone::Muted);
}

void runDeviceLockWorker(void*) {
    DeviceLockWorkerEvent event{};
    event.mode = deviceLockWorkerMode;
    event.heapBefore = ESP.getFreeHeap();
    std::uint64_t startedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (startedUs == 0U) startedUs = 1U;
    const bool productBlockingOperation =
        event.mode == DeviceLockWorkerMode::Product &&
        (deviceLockWorkerRequest.intent == DeviceLockIntent::Configure ||
         deviceLockWorkerRequest.intent == DeviceLockIntent::Unlock);
    if (event.mode == DeviceLockWorkerMode::KdfBenchmark) {
        // A fixed diagnostic vector exercises the production 120k-round KDF
        // without reading or changing the owner's credential. Every byte is
        // stack-local and wiped before the completion event is published.
        std::array<char, 7> pin{{'4', '8', '2', '9', '1', '5', '\0'}};
        std::array<std::uint8_t,
                   leshy1::services::security::kDeviceLockSaltBytes> salt{};
        std::array<std::uint8_t,
                   leshy1::services::security::kDeviceLockVerifierBytes>
            verifier{};
        for (std::size_t index = 0; index < salt.size(); ++index) {
            salt[index] = static_cast<std::uint8_t>(0x31U + index * 7U);
        }
        const bool derived = deviceLockCrypto.deriveVerifier(
            pin.data(), pin.size() - 1U, salt,
            leshy1::services::security::kDeviceLockPbkdf2Iterations,
            &verifier);
        constexpr std::array<std::uint8_t, 32> expected{{
            0xefU, 0x8cU, 0x61U, 0x23U, 0xe7U, 0xbfU, 0xd8U, 0x1cU,
            0xb9U, 0xd7U, 0x93U, 0xa9U, 0xb5U, 0xd9U, 0xebU, 0x84U,
            0x78U, 0xd2U, 0xa2U, 0x14U, 0xb3U, 0xf4U, 0x71U, 0x18U,
            0x25U, 0x88U, 0x94U, 0x48U, 0x3bU, 0xecU, 0x75U, 0xa1U,
        }};
        std::uint8_t difference = 0U;
        for (std::size_t index = 0; index < verifier.size(); ++index) {
            difference = static_cast<std::uint8_t>(
                difference | (verifier[index] ^ expected[index]));
        }
        event.success = derived && difference == 0U;
        volatile char* pinBytes = pin.data();
        for (std::size_t index = 0; index < pin.size(); ++index) {
            pinBytes[index] = '\0';
        }
        volatile std::uint8_t* saltBytes = salt.data();
        for (std::size_t index = 0; index < salt.size(); ++index) {
            saltBytes[index] = 0U;
        }
        volatile std::uint8_t* verifierBytes = verifier.data();
        for (std::size_t index = 0; index < verifier.size(); ++index) {
            verifierBytes[index] = 0U;
        }
    } else if (deviceLockWorkerRequest.intent ==
               DeviceLockIntent::Configure) {
        event.success = deviceLock.configure(
            deviceLockWorkerRequest.pin.data(),
            deviceLockWorkerRequest.pinLength, startedUs);
    } else if (deviceLockWorkerRequest.intent == DeviceLockIntent::Unlock) {
        event.success = deviceLock.unlock(
            deviceLockWorkerRequest.pin.data(),
            deviceLockWorkerRequest.pinLength, startedUs);
    }
    const std::uint64_t finishedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (productBlockingOperation &&
        !deviceLock.completeBlockingOperation(startedUs, finishedUs)) {
        event.success = false;
    }
    deviceLockWorkerRequest.clear();
    event.elapsedUs = finishedUs >= startedUs ? finishedUs - startedUs : 0U;
    event.heapAfter = ESP.getFreeHeap();
    event.minimumHeapAfter = ESP.getMinFreeHeap();
    event.audit = deviceLock.audit(finishedUs);
    if (deviceLockWorkerEvents != nullptr) {
        xQueueOverwrite(deviceLockWorkerEvents, &event);
    }
    vTaskDelete(nullptr);
}

