anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
bool requestDeviceLockWorker() {
    if (deviceLockWorkerTaskHandle != nullptr ||
        !deviceLockController.takeSubmission(&deviceLockWorkerRequest)) {
        return false;
    }
    if (deviceLockWorkerEvents == nullptr) {
        deviceLockWorkerRequest.clear();
        deviceLockController.complete(
            deviceLock.audit(static_cast<std::uint64_t>(esp_timer_get_time())),
            false);
        return false;
    }
    deviceLockWorkerMode = DeviceLockWorkerMode::Product;
    const bool started = xTaskCreatePinnedToCore(
        runDeviceLockWorker, "leshy-device-lock", 6144, nullptr, 1,
        &deviceLockWorkerTaskHandle, 0) == pdPASS;
    if (!started) {
        deviceLockWorkerTaskHandle = nullptr;
        deviceLockWorkerRequest.clear();
        deviceLockController.complete(
            deviceLock.audit(static_cast<std::uint64_t>(esp_timer_get_time())),
            false);
    }
    return started;
}

bool requestDeviceLockKdfBenchmark() {
    if (deviceLockWorkerTaskHandle != nullptr ||
        deviceLockWorkerEvents == nullptr) {
        return false;
    }
    deviceLockKdfBenchmark = {};
    deviceLockKdfBenchmark.requested = true;
    deviceLockWorkerMode = DeviceLockWorkerMode::KdfBenchmark;
    const bool started = xTaskCreatePinnedToCore(
        runDeviceLockWorker, "leshy-lock-kdf-hil", 6144, nullptr, 1,
        &deviceLockWorkerTaskHandle, 0) == pdPASS;
    if (!started) {
        deviceLockWorkerTaskHandle = nullptr;
        deviceLockKdfBenchmark.complete = true;
    }
    return started;
}

void serviceDeviceLock() {
    if (deviceLockWorkerEvents != nullptr) {
        DeviceLockWorkerEvent event{};
        if (xQueueReceive(deviceLockWorkerEvents, &event, 0) == pdTRUE) {
            deviceLockWorkerTaskHandle = nullptr;
            deviceLockLastKdfUs = event.elapsedUs;
            if (event.mode == DeviceLockWorkerMode::KdfBenchmark) {
                deviceLockKdfBenchmark.complete = true;
                deviceLockKdfBenchmark.success = event.success;
                deviceLockKdfBenchmark.elapsedUs = event.elapsedUs;
                deviceLockKdfBenchmark.heapBefore = event.heapBefore;
                deviceLockKdfBenchmark.heapAfter = event.heapAfter;
                deviceLockKdfBenchmark.minimumHeapAfter =
                    event.minimumHeapAfter;
                lastRuntimeEvent = event.success
                    ? "device_lock_kdf_benchmark_complete"
                    : "device_lock_kdf_benchmark_failed";
            } else {
                deviceLockController.complete(event.audit, event.success);
                lastRuntimeEvent = event.success
                    ? "device_lock_operation_complete"
                    : "device_lock_operation_failed";
                if (!safetySupervisor.latched() &&
                    uiController.page() == kDeviceLockPage) {
                    renderInteractiveScreen(true);
                }
            }
        }
    }
    if (deviceLockWorkerTaskHandle != nullptr) return;
    const std::uint64_t nowUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (deviceLock.service(nowUs)) {
        if (uiController.page() == kDeviceLockPage) {
            deviceLockController.enter(deviceLock.audit(nowUs));
        }
        if (!safetySupervisor.latched() &&
            (uiController.page() == kDeviceLockPage ||
             deviceLockProtectedPage(uiController.page()))) {
            renderInteractiveScreen(true);
        }
    }
}

void emitDeviceLockState(Stream& reply) {
    const std::uint64_t nowUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    const auto audit = deviceLock.audit(nowUs);
    char line[768] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.device_lock.v1\",\"kind\":\"state\","
        "\"status\":\"%s\",\"failure\":\"%s\","
        "\"failed_attempts\":%u,\"credential_generation\":%lu,"
        "\"retry_remaining_ms\":%llu,\"protected_access\":%s,"
        "\"worker_active\":%s,\"last_kdf_us\":%llu,"
        "\"benchmark_requested\":%s,\"benchmark_complete\":%s,"
        "\"benchmark_success\":%s,\"benchmark_elapsed_us\":%llu,"
        "\"benchmark_vector_verified\":%s,"
        "\"benchmark_heap_before\":%lu,\"benchmark_heap_after\":%lu,"
        "\"benchmark_minimum_heap_after\":%lu,"
        "\"persistence_touched_by_benchmark\":false,"
        "\"persistence_fixture_active\":%s,"
        "\"persistence_fixture_cleanup_required\":%s,"
        "\"radio_touched\":false}",
        leshy1::services::security::deviceLockStateName(audit.state),
        leshy1::services::security::deviceLockFailureName(audit.lastFailure),
        static_cast<unsigned>(audit.failedAttempts),
        static_cast<unsigned long>(audit.credentialGeneration),
        static_cast<unsigned long long>(audit.retryRemainingUs / 1000ULL),
        audit.protectedAccessAllowed ? "true" : "false",
        deviceLockWorkerTaskHandle != nullptr ? "true" : "false",
        static_cast<unsigned long long>(deviceLockLastKdfUs),
        deviceLockKdfBenchmark.requested ? "true" : "false",
        deviceLockKdfBenchmark.complete ? "true" : "false",
        deviceLockKdfBenchmark.success ? "true" : "false",
        static_cast<unsigned long long>(deviceLockKdfBenchmark.elapsedUs),
        deviceLockKdfBenchmark.success ? "true" : "false",
        static_cast<unsigned long>(deviceLockKdfBenchmark.heapBefore),
        static_cast<unsigned long>(deviceLockKdfBenchmark.heapAfter),
        static_cast<unsigned long>(
            deviceLockKdfBenchmark.minimumHeapAfter),
        deviceLockPersistenceHilActive ? "true" : "false",
        deviceLockPersistenceHilCleanupRequired ? "true" : "false");
    reply.println(line);
}

void emitDeviceLockAdmissionMatrix(Stream& reply) {
    using leshy1::services::security::DeviceLockAccess;
    using leshy1::services::security::DeviceLockOperation;
    constexpr std::array<DeviceLockOperation, 16> operations{{
        DeviceLockOperation::Status,
        DeviceLockOperation::Configure,
        DeviceLockOperation::Unlock,
        DeviceLockOperation::Lock,
        DeviceLockOperation::ProtectedUi,
        DeviceLockOperation::ProtectedEvidence,
        DeviceLockOperation::SecretRead,
        DeviceLockOperation::Export,
        DeviceLockOperation::Backup,
        DeviceLockOperation::Companion,
        DeviceLockOperation::SensitiveSettings,
        DeviceLockOperation::SafeStop,
        DeviceLockOperation::Panic,
        DeviceLockOperation::Cleanup,
        DeviceLockOperation::UpdateRecovery,
        DeviceLockOperation::FactoryReset,
    }};
    std::array<DeviceLockAccess, operations.size()> access{};
    for (std::size_t index = 0; index < operations.size(); ++index) {
        access[index] = checkDeviceLockAdmission(operations[index]);
    }
    const bool protectedAllowed =
        access[4] == DeviceLockAccess::Allowed &&
        access[5] == DeviceLockAccess::Allowed &&
        access[6] == DeviceLockAccess::Allowed &&
        access[7] == DeviceLockAccess::Allowed &&
        access[8] == DeviceLockAccess::Allowed &&
        access[9] == DeviceLockAccess::Allowed &&
        access[10] == DeviceLockAccess::Allowed;
    const bool safeAllowed =
        access[0] == DeviceLockAccess::Allowed &&
        access[3] == DeviceLockAccess::Allowed &&
        access[11] == DeviceLockAccess::Allowed &&
        access[12] == DeviceLockAccess::Allowed &&
        access[13] == DeviceLockAccess::Allowed &&
        access[14] == DeviceLockAccess::Allowed &&
        access[15] == DeviceLockAccess::Allowed;
    const auto audit = deviceLock.audit(
        static_cast<std::uint64_t>(esp_timer_get_time()));
    char line[2048] = {};
    int written = std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.device_lock.admission.v1\","
        "\"kind\":\"matrix\",\"state\":\"%s\",\"access\":{",
        leshy1::services::security::deviceLockStateName(audit.state));
    for (std::size_t index = 0;
         written > 0 && static_cast<std::size_t>(written) < sizeof(line) &&
         index < operations.size(); ++index) {
        const int appended = std::snprintf(
            line + written, sizeof(line) - static_cast<std::size_t>(written),
            "%s\"%s\":\"%s\"", index == 0 ? "" : ",",
            leshy1::services::security::deviceLockOperationName(
                operations[index]),
            leshy1::services::security::deviceLockAccessName(access[index]));
        if (appended <= 0) {
            written = -1;
        } else {
            written += appended;
        }
    }
    if (written <= 0 || static_cast<std::size_t>(written) >= sizeof(line)) {
        reply.println(
            "{\"schema\":\"leshy.device_lock.admission.v1\","
            "\"kind\":\"error\",\"status\":\"encoding_failed\"}");
        return;
    }
    const int appended = std::snprintf(
        line + written, sizeof(line) - static_cast<std::size_t>(written),
        "},\"protected_all_allowed\":%s,\"safe_all_allowed\":%s,"
        "\"protected_content_returned\":false,"
        "\"admission_checks\":%lu,\"admission_blocks\":%lu,"
        "\"radio_touched\":false}",
        protectedAllowed ? "true" : "false",
        safeAllowed ? "true" : "false",
        static_cast<unsigned long>(deviceLockAdmissionChecks),
        static_cast<unsigned long>(deviceLockAdmissionBlocks));
    if (appended <= 0 ||
        static_cast<std::size_t>(written + appended) >= sizeof(line)) {
        reply.println(
            "{\"schema\":\"leshy.device_lock.admission.v1\","
            "\"kind\":\"error\",\"status\":\"encoding_failed\"}");
        return;
    }
    reply.println(line);
}

void runDeviceLockPersistenceFixture(Stream& reply, const char* command) {
    constexpr const char* beginCommand =
        "device-lock.persistence-fixture begin";
    constexpr const char* resumeCommand =
        "device-lock.persistence-fixture resume";
    constexpr const char* cleanupCommand =
        "device-lock.persistence-fixture cleanup";
    constexpr const char* factoryResetPreviewCommand =
        "device-lock.persistence-fixture factory-reset-preview";
    constexpr const char* factoryResetConfirmCommand =
        "device-lock.persistence-fixture factory-reset-confirm";
    const bool begin = std::strcmp(command, beginCommand) == 0;
    const bool resume = std::strcmp(command, resumeCommand) == 0;
    const bool cleanup = std::strcmp(command, cleanupCommand) == 0;
    const bool factoryResetPreview =
        std::strcmp(command, factoryResetPreviewCommand) == 0;
    const bool factoryResetConfirm =
        std::strcmp(command, factoryResetConfirmCommand) == 0;
    const bool factoryReset = factoryResetPreview || factoryResetConfirm;
    const char* operation = begin
        ? "begin"
        : resume
              ? "resume"
              : cleanup
                    ? "cleanup"
                    : factoryResetPreview ? "factory_reset_preview"
                                          : "factory_reset_confirm";
    const char* status = "invalid_operation";
    bool fixtureCleanupComplete = false;
    bool productRestored = false;
    bool resetResult = false;
    const std::uint64_t nowUs =
        static_cast<std::uint64_t>(esp_timer_get_time());

    if (!hilSession.active()) {
        status = "hil_session_required";
    } else if (deviceLockWorkerTaskHandle != nullptr) {
        status = "worker_busy";
    } else if (!begin && !resume && !cleanup && !factoryReset) {
        status = "invalid_operation";
    } else if ((begin || resume) && deviceLockPersistenceHilActive) {
        status = "already_active";
    } else if (factoryReset && !deviceLockPersistenceHilActive) {
        status = "fixture_required";
    } else if (factoryResetConfirm &&
               deviceLock.state() != leshy1::services::security::
                                         DeviceLockState::RecoveryOnly) {
        status = "recovery_only_required";
    } else if (factoryReset) {
        deviceLockFixtureEraser.reset();
        resetResult = deviceLock.factoryReset(
            factoryResetConfirm, deviceLockFixtureEraser);
        if (factoryResetPreview) {
            status = !resetResult && deviceLockFixtureEraser.calls == 0U
                ? "confirmation_required" : "preview_failed";
        } else {
            status = resetResult && deviceLockFixtureEraser.calls == 1U &&
                    deviceLockFixtureEraser.credentialPresentDuringErase &&
                    deviceLockFixtureEraser.fixtureProtectedDataErased
                ? "recovered" : "recovery_failed";
        }
    } else if (cleanup) {
        deviceLock.prepareSystemBoundary();
        deviceLockStore.useHilFixtureNamespace(true);
        fixtureCleanupComplete = deviceLockStore.clearCredentialAndLatch();
        deviceLockStore.useHilFixtureNamespace(false);
        productRestored = deviceLock.restore(nowUs);
        deviceLockPersistenceHilActive = false;
        deviceLockPersistenceHilCleanupRequired =
            !fixtureCleanupComplete;
        status = fixtureCleanupComplete && productRestored
            ? "cleaned" : "cleanup_failed";
    } else {
        deviceLock.prepareSystemBoundary();
        deviceLockStore.useHilFixtureNamespace(true);
        fixtureCleanupComplete = begin
            ? deviceLockStore.clearCredentialAndLatch() : true;
        const bool fixtureRestored =
            fixtureCleanupComplete && deviceLock.restore(nowUs);
        deviceLockPersistenceHilActive = true;
        deviceLockPersistenceHilCleanupRequired = true;
        status = fixtureRestored
            ? (begin ? "begun" : "resumed") : "fixture_restore_failed";
    }

    deviceLockController.enter(deviceLock.audit(nowUs));
    if (!safetySupervisor.latched() &&
        uiController.page() == kDeviceLockPage) {
        renderInteractiveScreen(true);
    }
    const auto audit = deviceLock.audit(nowUs);
    char line[1024] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.device_lock.fixture.v1\","
        "\"kind\":\"persistence_fixture\",\"operation\":\"%s\","
        "\"status\":\"%s\",\"active\":%s,"
        "\"cleanup_required\":%s,"
        "\"fixture_namespace_selected\":%s,"
        "\"fixture_cleanup_complete\":%s,\"product_restored\":%s,"
        "\"lock_status\":\"%s\",\"failure\":\"%s\","
        "\"failed_attempts\":%u,\"credential_generation\":%lu,"
        "\"factory_reset_result\":%s,\"protected_erase_calls\":%lu,"
        "\"credential_present_during_erase\":%s,"
        "\"fixture_protected_data_erased\":%s,"
        "\"destructive_order_proven\":%s,"
        "\"product_namespace_written_or_erased\":false,"
        "\"whole_nvs_read_or_copied\":false,\"radio_touched\":false}",
        operation, status,
        deviceLockPersistenceHilActive ? "true" : "false",
        deviceLockPersistenceHilCleanupRequired ? "true" : "false",
        deviceLockStore.hilFixtureNamespaceActive() ? "true" : "false",
        fixtureCleanupComplete ? "true" : "false",
        productRestored ? "true" : "false",
        leshy1::services::security::deviceLockStateName(audit.state),
        leshy1::services::security::deviceLockFailureName(audit.lastFailure),
        static_cast<unsigned>(audit.failedAttempts),
        static_cast<unsigned long>(audit.credentialGeneration),
        resetResult ? "true" : "false",
        static_cast<unsigned long>(deviceLockFixtureEraser.calls),
        deviceLockFixtureEraser.credentialPresentDuringErase
            ? "true" : "false",
        deviceLockFixtureEraser.fixtureProtectedDataErased
            ? "true" : "false",
        resetResult && deviceLockFixtureEraser.calls == 1U &&
                deviceLockFixtureEraser.credentialPresentDuringErase &&
                deviceLockFixtureEraser.fixtureProtectedDataErased
            ? "true" : "false");
    reply.println(line);
}

