anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void runDeviceLockProtectedUiFixture(Stream& reply, const char* command) {
    constexpr const char* beginCommand =
        "device-lock.protected-ui-fixture begin";
    constexpr const char* cleanupCommand =
        "device-lock.protected-ui-fixture cleanup";
    const bool begin = std::strcmp(command, beginCommand) == 0;
    const bool cleanup = std::strcmp(command, cleanupCommand) == 0;
    const char* operation = begin ? "begin" : cleanup ? "cleanup" : "invalid";
    const char* status = "invalid_operation";

    if (!hilSession.active()) {
        status = "hil_session_required";
    } else if (!begin && !cleanup) {
        status = "invalid_operation";
    } else if (begin && deviceLockPersistenceHilActive) {
        status = "credential_fixture_active";
    } else if (begin && deviceLockProtectedUiHilActive) {
        status = "already_active";
    } else if (begin && !deviceLock.audit(
                    static_cast<std::uint64_t>(esp_timer_get_time()))
                    .dataKeyAvailable) {
        // Do not create an apparently open UI whose protected product store
        // cannot authenticate.  A configured/locked owner must unlock through
        // the product flow; HIL never reads or substitutes that credential.
        status = "product_key_unavailable";
    } else if (begin) {
        deviceLockProtectedUiHilActive = true;
        status = "begun";
    } else {
        deviceLockProtectedUiHilActive = false;
        status = "cleaned";
    }

    char line[512] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.device_lock.protected_ui_fixture.v1\","
        "\"kind\":\"protected_ui_fixture\",\"operation\":\"%s\","
        "\"status\":\"%s\",\"active\":%s,"
        "\"ram_only_admission\":true,\"protected_ui_only\":true,"
        "\"credential_written\":false,\"data_key_replaced\":false,"
        "\"product_namespace_written_or_erased\":false,"
        "\"whole_nvs_read_or_copied\":false,\"radio_touched\":false}",
        operation, status,
        deviceLockProtectedUiHilActive ? "true" : "false");
    reply.println(line);
}

void runDeviceLockProtectedReadFixture(Stream& reply, const char* command) {
    constexpr const char* beginCommand =
        "device-lock.protected-read-fixture begin";
    constexpr const char* cleanupCommand =
        "device-lock.protected-read-fixture cleanup";
    const bool begin = std::strcmp(command, beginCommand) == 0;
    const bool cleanup = std::strcmp(command, cleanupCommand) == 0;
    const char* operation = begin ? "begin" : cleanup ? "cleanup" : "invalid";
    const char* status = "invalid_operation";

    if (!hilSession.active()) {
        status = "hil_session_required";
    } else if (!begin && !cleanup) {
        status = "invalid_operation";
    } else if (begin && deviceLockPersistenceHilActive) {
        status = "credential_fixture_active";
    } else if (begin && deviceLockProtectedReadHilActive) {
        status = "already_active";
    } else if (begin && !deviceLock.audit(
                    static_cast<std::uint64_t>(esp_timer_get_time()))
                    .dataKeyAvailable) {
        status = "product_key_unavailable";
    } else if (begin) {
        deviceLockProtectedReadHilActive = true;
        status = "begun";
    } else {
        deviceLockProtectedReadHilActive = false;
        status = "cleaned";
    }

    char line[640] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.device_lock.protected_read_fixture.v1\","
        "\"kind\":\"protected_read_fixture\",\"operation\":\"%s\","
        "\"status\":\"%s\",\"active\":%s,"
        "\"ram_only_admission\":true,\"protected_ui_allowed\":true,"
        "\"companion_read_only\":true,\"mutation_scope_allowed\":false,"
        "\"credential_written\":false,\"data_key_replaced\":false,"
        "\"product_namespace_written_or_erased\":false,"
        "\"whole_nvs_read_or_copied\":false,\"radio_touched\":false}",
        operation, status,
        deviceLockProtectedReadHilActive ? "true" : "false");
    reply.println(line);
}

void triggerDeviceLockKdfBenchmark(Stream& reply) {
    const char* status = "accepted";
    bool accepted = false;
    if (!hilSession.active()) {
        status = "hil_session_required";
    } else if (deviceLockWorkerTaskHandle != nullptr) {
        status = "worker_busy";
    } else if (!requestDeviceLockKdfBenchmark()) {
        status = "worker_unavailable";
    } else {
        accepted = true;
    }
    char line[256] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.device_lock.v1\",\"kind\":\"benchmark\","
        "\"status\":\"%s\",\"accepted\":%s,"
        "\"iterations\":%lu,\"persistence_touched\":false,"
        "\"radio_touched\":false}",
        status, accepted ? "true" : "false",
        static_cast<unsigned long>(
            leshy1::services::security::kDeviceLockPbkdf2Iterations));
    reply.println(line);
}

void renderAboutPage(bool clearContent) {
    renderHeader(tr(UiTextId::AboutTitle), clearContent);
    char line[96] = {};
    display.setTextColor(Palette::TextSecondary, Palette::Canvas);
    std::snprintf(line, sizeof(line), tr(UiTextId::AboutVersionFormat),
                  LESHY1_VERSION);
    setUiCursor(UiTextRole::Body, 14, 82);
    display.print(line);
    std::snprintf(line, sizeof(line), tr(UiTextId::AboutProfileFormat),
                  BoardProfile::kId);
    setUiCursor(UiTextRole::Body, 14, 116);
    display.print(line);
    display.setTextColor(Palette::Positive, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 168);
    display.print(tr(UiTextId::AboutOpenSource));
}

void clearSerialConsoleLivePreview() {
    volatile char* bytes = serialConsoleLiveLine.data();
    for (std::size_t index = 0; index < serialConsoleLiveLine.size(); ++index) {
        bytes[index] = '\0';
    }
    serialConsoleLiveLineLength = 0U;
    serialConsoleLiveDirty = false;
}

void refreshSerialConsoleUiConfig() {
    serialConsoleLastConfig = {};
    serialConsoleLastConfig.mode = serialConsoleUiMode;
    serialConsoleLastConfig.baud =
        kSerialConsoleUiBauds[serialConsoleBaudIndex];
    serialConsoleLastConfig.durationMs =
        kSerialConsoleUiDurationsMs[serialConsoleDurationIndex];
    leshy1::services::serial::setSerialConsoleTarget(
        &serialConsoleLastConfig, "wired-device", 12U);
    serialConsoleLastPreflight =
        leshy1::services::serial::validateSerialConsoleConfig(
            serialConsoleLastConfig, serialConsoleHardware());
}

void enterSerialConsoleUi() {
    serialConsoleUiSelection = 0U;
    serialConsoleNextUiRefreshMs = 0U;
    clearSerialConsoleLivePreview();
    if (serialConsoleActionDispatcher.running()) {
        serialConsoleUiView = SerialConsoleUiView::Running;
        serialConsoleUiActionStatus =
            serialConsoleActionDispatcher.status();
        return;
    }
    serialConsoleUiView = SerialConsoleUiView::Setup;
    serialConsoleUiActionStatus =
        leshy1::services::actions::ActionStatus::Ready;
    refreshSerialConsoleUiConfig();
}

void renderSerialConsoleMetric(std::uint8_t index, const char* text,
                               Tone tone = Tone::Neutral) {
    const Rect bounds = Components::metricRow(index);
    display.fillRect(bounds.x, bounds.y - 2, bounds.width, bounds.height,
                     Palette::Canvas);
    renderMetric(index, text, tone);
}

void renderSerialConsolePage(bool clearContent) {
    renderHeader(tr(UiTextId::SerialConsoleTitle), clearContent);
    char line[96] = {};
    if (serialConsoleUiView == SerialConsoleUiView::Setup) {
        refreshSerialConsoleUiConfig();
        if (serialConsoleLastPreflight !=
            leshy1::services::serial::SerialConsolePreflightStatus::Ready) {
            renderSerialConsoleMetric(
                0, tr(UiTextId::SerialConsoleConflict), Tone::Warning);
            renderSerialConsoleMetric(
                1, tr(UiTextId::SerialConsoleConflictPins), Tone::Muted);
            renderSerialConsoleMetric(
                2, tr(UiTextId::SerialConsoleConflictSafe), Tone::Positive);
            renderSerialConsoleMetric(
                4, tr(UiTextId::SerialConsoleProfileNote), Tone::Muted);
            return;
        }
        renderMenuRow(
            Components::homeRow(0), tr(UiTextId::SerialConsoleMode),
            tr(serialConsoleUiMode ==
                       leshy1::services::serial::SerialConsoleMode::Monitor
                   ? UiTextId::SerialConsoleModeMonitor
                   : UiTextId::SerialConsoleModeBridge),
            serialConsoleUiSelection == 0U, true, Tone::Positive);
        std::snprintf(line, sizeof(line), "%lu BIT/S",
                      static_cast<unsigned long>(serialConsoleLastConfig.baud));
        renderMenuRow(Components::homeRow(1),
                      tr(UiTextId::SerialConsoleBaud), line,
                      serialConsoleUiSelection == 1U, true, Tone::Positive);
        std::snprintf(
            line, sizeof(line), "%lu S / VOLATILE",
            static_cast<unsigned long>(serialConsoleLastConfig.durationMs /
                                       1000U));
        renderMenuRow(Components::homeRow(2),
                      tr(UiTextId::SerialConsoleDuration), line,
                      serialConsoleUiSelection == 2U, true, Tone::Positive);
        renderMenuRow(Components::homeRow(3),
                      tr(UiTextId::SerialConsoleStart),
                      tr(deviceLock.state() ==
                                 leshy1::services::security::
                                     DeviceLockState::Unlocked
                             ? UiTextId::SerialConsoleStartReady
                             : UiTextId::SerialConsoleStartLocked),
                      serialConsoleUiSelection == 3U,
                      deviceLock.state() ==
                          leshy1::services::security::
                              DeviceLockState::Unlocked,
                      deviceLock.state() ==
                              leshy1::services::security::
                                  DeviceLockState::Unlocked
                          ? Tone::Positive : Tone::Warning);
        return;
    }

    if (serialConsoleUiView == SerialConsoleUiView::Confirm) {
        renderSerialConsoleMetric(
            0, tr(UiTextId::SerialConsoleConfirm), Tone::Warning);
        renderSerialConsoleMetric(
            1, tr(UiTextId::SerialConsoleConfirmRx), Tone::Neutral);
        renderSerialConsoleMetric(
            2,
            tr(serialConsoleLastConfig.mode ==
                       leshy1::services::serial::SerialConsoleMode::Bridge
                   ? UiTextId::SerialConsoleConfirmTx
                   : UiTextId::SerialConsoleModeMonitor),
            Tone::Neutral);
        renderSerialConsoleMetric(
            3, tr(UiTextId::SerialConsoleConfirmVolatile), Tone::Positive);
        renderMenuRow(Components::homeRow(3),
                      tr(UiTextId::SerialConsoleConfirmAction),
                      tr(UiTextId::SerialConsoleProfileNote), true, true,
                      Tone::Warning);
        return;
    }

