anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void renderOverview(bool clearContent) {
    char line[80] = {};
    renderHeader(tr(UiTextId::DiagnosticsTitle), clearContent);
    display.setTextColor(Palette::Positive, Palette::Canvas);
    setUiCursor(UiTextRole::Body, 14, 82);
    display.print(tr(UiTextId::ProfileN16));

    display.setTextColor(Palette::TextSecondary, Palette::Canvas);
    std::snprintf(line, sizeof(line), tr(UiTextId::FlashFormat),
                  static_cast<unsigned long>(bootMetrics.flashBytes / 1024U));
    setUiCursor(UiTextRole::Body, 14, 120);
    display.print(line);
    std::snprintf(line, sizeof(line), tr(UiTextId::HeapFreeFormat),
                  static_cast<unsigned long>(ESP.getFreeHeap() / 1024U));
    setUiCursor(UiTextRole::Body, 14, 144);
    display.print(line);
    std::snprintf(line, sizeof(line), tr(UiTextId::UiReadyFormat),
                  static_cast<unsigned long long>(bootMetrics.interactiveReadyUs));
    setUiCursor(UiTextRole::Body, 14, 168);
    display.print(line);

}

UiTextId safetyReasonTextId() {
    switch (safetySupervisor.reason()) {
        case SafetyReason::RuntimeWatchdog:
            return UiTextId::SafetyWatchdogReason;
        case SafetyReason::SupervisorUnavailable:
            return UiTextId::SafetySupervisorReason;
        case SafetyReason::OutputInvariant:
            return UiTextId::SafetyOutputReason;
        case SafetyReason::WorkerDeadline:
            return UiTextId::SafetyWorkerReason;
        default:
            return UiTextId::SafetyOutputReason;
    }
}

void renderSafetyStop(bool clearContent) {
    renderHeader(tr(UiTextId::SafetyStopTitle), clearContent);
    display.setTextColor(Palette::Danger, Palette::Canvas);
    setUiCursor(UiTextRole::Body, 14, 52);
    display.print(tr(safetyReasonTextId()));

    display.fillRoundRect(Layout::Edge, 88, Layout::ContentWidth, 82,
                          Layout::Radius, Palette::Surface);
    display.setTextColor(Palette::Positive, Palette::Surface);
    setUiCursor(UiTextRole::Body, 20, 101);
    display.print(tr(UiTextId::SafetyOutputsStopped));
    display.setTextColor(Palette::Warning, Palette::Surface);
    setUiCursor(UiTextRole::Meta, 20, 137);
    display.print(tr(UiTextId::SafetyPowerWarning));

    display.setTextColor(Palette::TextPrimary, Palette::Canvas);
    setUiCursor(UiTextRole::Body, 14, 202);
    display.print(tr(safetySupervisor.clearPending()
                         ? UiTextId::SafetyClearConfirm
                         : UiTextId::SafetyClearPrompt));
    if (safetySupervisor.clearPending()) {
        display.setTextColor(Palette::TextSecondary, Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 14, 240);
        display.print(tr(UiTextId::SafetyClearCancel));
    }
}

constexpr std::size_t kVisibleSurveyRows = 2;
constexpr std::int16_t kSurveyFilterY = 101;
constexpr std::int16_t kSurveyRowsY = 132;
constexpr std::size_t kVisibleWifiNetworkRows = 4;

std::size_t surveyFirstVisible(std::size_t selection) {
    return selection < kVisibleSurveyRows
        ? 0
        : selection - kVisibleSurveyRows + 1;
}

void renderSurveyListRow(std::size_t index, std::size_t firstVisible) {
    const Observation* observation = surveyController.visibleAt(index);
    if (observation == nullptr) return;
    const std::int32_t y =
        kSurveyRowsY + static_cast<std::int32_t>(index - firstVisible) * 40;
    const bool selected = !surveyController.filterFocused() &&
                          surveyController.selection() == index;
    const std::uint16_t background = selected ? Palette::SurfaceFocus
                                               : Palette::Surface;
    display.fillRoundRect(Layout::Edge, y, Layout::ContentWidth, 36,
                          Layout::Radius, background);
    renderFocusCue({Layout::Edge, static_cast<std::int16_t>(y),
                    Layout::ContentWidth, 36}, selected);
    display.setTextColor(selected ? Palette::Focus : Palette::TextSecondary,
                         background);
    setUiCursor(UiTextRole::Body,
                Layout::Edge + kInteractiveRowTextInset, y - 2);
    char visibleLabel[24] = {};
    const std::size_t visibleLength = observation->labelLength < 15U
        ? observation->labelLength : 15U;
    if (visibleLength == 0) {
        std::strcpy(visibleLabel, tr(UiTextId::Hidden));
    } else {
        std::memcpy(visibleLabel, observation->label.data(), visibleLength);
        if (observation->labelLength > visibleLength) {
            visibleLabel[visibleLength - 1U] = '~';
        }
    }
    display.print(visibleLabel);
    char line[96] = {};
    display.setTextColor(Palette::Positive, background);
    if (observation->radio == RadioKind::Ble) {
        std::snprintf(line, sizeof(line), tr(UiTextId::BleRssiFormat),
                      static_cast<int>(observation->rssiDbm));
    } else {
        std::snprintf(line, sizeof(line), tr(UiTextId::ChannelRssiFormat),
                      static_cast<unsigned>(observation->channel),
                      static_cast<int>(observation->rssiDbm));
    }
    setUiCursor(UiTextRole::Meta, 146, y + 13);
    display.print(line);
}

std::size_t wifiNetworkFirstVisible(std::size_t selection) {
    return selection < kVisibleWifiNetworkRows
        ? 0
        : selection - kVisibleWifiNetworkRows + 1U;
}

std::uint8_t wifiSignalLevel(std::int16_t rssiDbm) {
    if (rssiDbm >= -55) return 4;
    if (rssiDbm >= -67) return 3;
    if (rssiDbm >= -78) return 2;
    return 1;
}

void renderWifiSignalBars(Rect bounds, std::int16_t rssiDbm,
                          std::uint16_t background) {
    constexpr std::int16_t kBarWidth = 4;
    constexpr std::int16_t kBarGap = 2;
    constexpr std::int16_t kBarCount = 4;
    const std::int16_t x = bounds.x + bounds.width - 30;
    const std::int16_t baseline = bounds.y + bounds.height - 12;
    const std::uint8_t level = wifiSignalLevel(rssiDbm);
    for (std::int16_t index = 0; index < kBarCount; ++index) {
        const std::int16_t height = 4 + index * 3;
        display.fillRect(x + index * (kBarWidth + kBarGap), baseline - height,
                         kBarWidth, height,
                         index < level ? Palette::Positive
                                       : Palette::TextMuted);
        display.drawFastHLine(
            x + index * (kBarWidth + kBarGap), baseline, kBarWidth,
            background);
    }
}

UiTextId radioSignalQualityText(std::int16_t rssiDbm) {
    switch (wifiSignalLevel(rssiDbm)) {
        case 4: return UiTextId::RadioSignalExcellent;
        case 3: return UiTextId::RadioSignalGood;
        case 2: return UiTextId::RadioSignalWeak;
        default: return UiTextId::RadioSignalVeryWeak;
    }
}

std::uint16_t radioSignalTone(std::int16_t rssiDbm) {
    const std::uint8_t level = wifiSignalLevel(rssiDbm);
    return level >= 3U
        ? Palette::Positive : (level == 2U ? Palette::Warning
                                           : Palette::Danger);
}

std::int16_t radioSignalTrackFillWidth(std::int16_t rssiDbm,
                                      std::int16_t trackWidth) {
    const std::int16_t clamped = rssiDbm < -100
        ? -100 : (rssiDbm > -40 ? -40 : rssiDbm);
    return static_cast<std::int16_t>(
        (static_cast<std::int32_t>(clamped + 100) * (trackWidth - 2)) / 60);
}

void renderRadioSignalTextRow(std::int16_t rssiDbm, const Rect& bounds) {
    const std::uint16_t tone = radioSignalTone(rssiDbm);
    char value[24] = {};
    std::snprintf(value, sizeof(value), tr(UiTextId::RadioSignalDbmFormat),
                  static_cast<int>(rssiDbm));
    if (beginLiveTextRow(UiTextRole::Body, tone, Palette::Surface)) {
        setLiveTextRowCursor(UiTextRole::Body, 10, 4);
        liveTextRowSprite.print(tr(radioSignalQualityText(rssiDbm)));
        const std::int16_t valueX = bounds.width - 10 -
            liveTextRowSprite.textWidth(value);
        setLiveTextRowCursor(UiTextRole::Body, valueX, 4);
        liveTextRowSprite.print(value);
        pushLiveTextRow(bounds.x, bounds.y + 25);
        return;
    }

    // Fail visibly but safely if even the 648-byte compositor cannot be
    // allocated. Product HIL requires this counter to remain zero.
    ++bleDeviceDirectTextRowFallbacks;
    display.fillRect(bounds.x, bounds.y + 25, bounds.width, 24,
                     Palette::Surface);
    display.setTextColor(tone, Palette::Surface);
    setUiCursor(UiTextRole::Body, bounds.x + 10, bounds.y + 29);
    display.print(tr(radioSignalQualityText(rssiDbm)));
    const std::int16_t valueX = bounds.x + bounds.width - 10 -
        display.textWidth(value);
    setUiCursor(UiTextRole::Body, valueX, bounds.y + 29);
    display.print(value);
}

void renderRadioSignalCard(
        std::int16_t rssiDbm,
        const Rect& bounds = {
            Layout::Edge, 128, Layout::ContentWidth, 104},
        bool force = true) {
    constexpr std::int16_t kTrackInset = 10;
    const bool compact = bounds.height < 100;
    const std::int16_t kTrackY = bounds.y + (compact ? 50 : 59);
    const std::int16_t kTrackWidth = bounds.width - 2 * kTrackInset;
    constexpr std::int16_t kTrackHeight = 14;
    const std::uint16_t tone = radioSignalTone(rssiDbm);
    if (force) {
        display.fillRoundRect(bounds.x, bounds.y, bounds.width, bounds.height,
                              Layout::Radius, Palette::Surface);
        display.setTextColor(Palette::TextSecondary, Palette::Surface);
        setUiCursor(UiTextRole::Meta, bounds.x + 10, bounds.y + 9);
        display.print(tr(UiTextId::RadioSignalLabel));
    }
    renderRadioSignalTextRow(rssiDbm, bounds);
    display.fillRect(bounds.x + kTrackInset, kTrackY, kTrackWidth,
                     kTrackHeight, Palette::Canvas);
    display.drawRect(bounds.x + kTrackInset, kTrackY, kTrackWidth,
                     kTrackHeight, Palette::Divider);
    const std::int16_t fillWidth =
        radioSignalTrackFillWidth(rssiDbm, kTrackWidth);
    if (fillWidth > 0) {
        display.fillRect(bounds.x + kTrackInset + 1, kTrackY + 1,
                         fillWidth, kTrackHeight - 2, tone);
    }
    if (!compact && force) {
        display.setTextColor(Palette::TextMuted, Palette::Surface);
        const std::int16_t scaleY = bounds.y + 79;
        setUiCursor(UiTextRole::Meta, bounds.x + kTrackInset, scaleY);
        display.print(tr(UiTextId::RadioSignalScaleWeak));
        const char* strong = tr(UiTextId::RadioSignalScaleStrong);
        const std::int16_t strongX = bounds.x + bounds.width - kTrackInset -
                                     display.textWidth(strong);
        setUiCursor(UiTextRole::Meta, strongX, scaleY);
        display.print(strong);
    }
}

