anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void renderRadioSignalCardDelta(
        std::int16_t previousRssiDbm, std::int16_t rssiDbm,
        const Rect& bounds) {
    if (previousRssiDbm == rssiDbm) return;
    constexpr std::int16_t kTrackInset = 10;
    constexpr std::int16_t kTrackHeight = 14;
    const bool compact = bounds.height < 100;
    const std::int16_t trackY = bounds.y + (compact ? 50 : 59);
    const std::int16_t trackWidth = bounds.width - 2 * kTrackInset;
    const std::uint16_t previousTone = radioSignalTone(previousRssiDbm);
    const std::uint16_t tone = radioSignalTone(rssiDbm);

    // Compose quality and dBm together, then replace the complete row in one
    // transfer. Direct erase-before-redraw is visible on the ILI9341.
    renderRadioSignalTextRow(rssiDbm, bounds);

    const std::int16_t previousWidth =
        radioSignalTrackFillWidth(previousRssiDbm, trackWidth);
    const std::int16_t fillWidth =
        radioSignalTrackFillWidth(rssiDbm, trackWidth);
    const std::int16_t innerX = bounds.x + kTrackInset + 1;
    const std::int16_t innerY = trackY + 1;
    const std::int16_t innerHeight = kTrackHeight - 2;
    if (previousTone != tone) {
        if (fillWidth > 0) {
            display.fillRect(innerX, innerY, fillWidth, innerHeight, tone);
        }
        if (previousWidth > fillWidth) {
            display.fillRect(innerX + fillWidth, innerY,
                             previousWidth - fillWidth, innerHeight,
                             Palette::Canvas);
        }
    } else if (fillWidth > previousWidth) {
        display.fillRect(innerX + previousWidth, innerY,
                         fillWidth - previousWidth, innerHeight, tone);
    } else if (fillWidth < previousWidth) {
        display.fillRect(innerX + fillWidth, innerY,
                         previousWidth - fillWidth, innerHeight,
                         Palette::Canvas);
    }
}

void renderWifiNetworkRow(std::size_t index, std::size_t firstVisible) {
    const Observation* observation = wifiNetworkAt(index);
    if (observation == nullptr || index < firstVisible ||
        index >= firstVisible + kVisibleWifiNetworkRows) {
        return;
    }
    const Rect bounds = Components::homeRow(
        static_cast<std::uint8_t>(index - firstVisible));
    const bool selected = wifiNetworkSelection == index;
    const std::uint16_t background = selected ? Palette::SurfaceFocus
                                               : Palette::Surface;
    display.fillRoundRect(bounds.x, bounds.y, bounds.width, bounds.height,
                          Layout::Radius, background);
    renderFocusCue(bounds, selected);
    char label[24] = {};
    const std::size_t visibleLength = observation->labelLength < 18U
        ? observation->labelLength : 18U;
    if (visibleLength == 0) {
        std::snprintf(label, sizeof(label), "%s", tr(UiTextId::Hidden));
    } else {
        std::memcpy(label, observation->label.data(), visibleLength);
        if (observation->labelLength > visibleLength) {
            label[visibleLength - 1U] = '~';
        }
    }
    const std::int16_t labelTop = menuRowTextTop(bounds);
    display.setTextColor(selected ? Palette::Focus : Palette::TextSecondary,
                         background);
    setUiCursor(UiTextRole::Body,
                bounds.x + kInteractiveRowTextInset, labelTop);
    display.print(label);
    char note[48] = {};
    std::snprintf(note, sizeof(note), tr(UiTextId::ChannelRssiFormat),
                  static_cast<unsigned>(observation->channel),
                  static_cast<int>(observation->rssiDbm));
    display.setTextColor(Palette::Positive, background);
    setUiCursor(UiTextRole::Meta,
                bounds.x + kInteractiveRowTextInset,
                labelTop + kRobotoCondensedBodyAscent +
                    kRobotoCondensedBodyDescent + 1);
    display.print(note);
    renderWifiSignalBars(bounds, observation->rssiDbm, background);
}

void renderWifiNetworksData() {
    const std::size_t visibleSize = wifiNetworkVisibleSize();
    if (visibleSize == 0) {
        display.setTextColor(Palette::Positive, Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 14, 70);
        display.print(tr(UiTextId::WifiNetworksSearching));
        return;
    }
    const std::size_t first = wifiNetworkFirstVisible(wifiNetworkSelection);
    const std::size_t end = visibleSize <
            first + kVisibleWifiNetworkRows
        ? visibleSize : first + kVisibleWifiNetworkRows;
    for (std::size_t index = first; index < end; ++index) {
        renderWifiNetworkRow(index, first);
    }
}

void renderWifiNetworks(bool clearContent) {
    renderHeader(tr(UiTextId::WifiMenuNetworks), clearContent);
    renderWifiNetworksData();
}

bool wifiNetworkDetailStaticFieldsDiffer(const Observation& left,
                                         const Observation& right) {
    return left.channel != right.channel ||
        left.frequencyKhz != right.frequencyKhz ||
        left.labelLength != right.labelLength ||
        std::memcmp(left.label.data(), right.label.data(),
                    left.labelLength) != 0 ||
        !leshy1::domain::observations::wifiNetworkFactsEqual(
            left.wifiNetwork, right.wifiNetwork);
}

UiTextId wifiNetworkTrendText(std::int16_t trendDb) {
    if (trendDb >= 4) return UiTextId::WifiNetworkTrendStronger;
    if (trendDb <= -4) return UiTextId::WifiNetworkTrendWeaker;
    return UiTextId::WifiNetworkTrendStable;
}

void renderWifiNetworkRadar(const Observation& network,
                            const WifiNetworkSignalStats& signal,
                            bool force = true) {
    constexpr Rect kRadar = {
        Layout::Edge, 222, Layout::ContentWidth, 67};
    constexpr std::int16_t kInset = 10;
    constexpr std::int16_t kTrackY = 258;
    constexpr std::int16_t kTrackHeight = 12;
    const std::int16_t trackWidth = kRadar.width - 2 * kInset;
    const std::uint8_t level = wifiSignalLevel(network.rssiDbm);
    const std::uint16_t tone = level >= 3U
        ? Palette::Positive : (level == 2U ? Palette::Warning
                                           : Palette::Danger);
    if (force) {
        display.fillRect(kRadar.x, kRadar.y, kRadar.width, kRadar.height,
                         Palette::Canvas);
        display.fillRoundRect(kRadar.x, kRadar.y, kRadar.width, kRadar.height,
                              Layout::Radius, Palette::Surface);
        display.setTextColor(Palette::TextSecondary, Palette::Surface);
        setUiCursor(UiTextRole::Meta, kRadar.x + kInset, 228);
        display.print(tr(UiTextId::RadioSignalLabel));
    }
    display.fillRect(kRadar.x + 108, 226, kRadar.width - 118, 16,
                     Palette::Surface);
    char line[32] = {};
    std::snprintf(line, sizeof(line), tr(UiTextId::RadioSignalDbmFormat),
                  static_cast<int>(network.rssiDbm));
    display.setTextColor(tone, Palette::Surface);
    const std::int16_t valueX = kRadar.x + kRadar.width - kInset -
                                display.textWidth(line);
    setUiCursor(UiTextRole::Meta, valueX, 228);
    display.print(line);
    display.fillRect(kRadar.x + kInset, 243, trackWidth, 15,
                     Palette::Surface);
    setUiCursor(UiTextRole::Body, kRadar.x + kInset, 243);
    display.print(tr(radioSignalQualityText(network.rssiDbm)));

    display.fillRect(kRadar.x + kInset, kTrackY, trackWidth,
                     kTrackHeight, Palette::Canvas);
    display.drawRect(kRadar.x + kInset, kTrackY, trackWidth,
                     kTrackHeight, Palette::Divider);
    const std::int16_t clamped = network.rssiDbm < -100
        ? -100 : (network.rssiDbm > -40 ? -40 : network.rssiDbm);
    const std::int16_t fillWidth = static_cast<std::int16_t>(
        (static_cast<std::int32_t>(clamped + 100) * (trackWidth - 2)) / 60);
    if (fillWidth > 0) {
        display.fillRect(kRadar.x + kInset + 1, kTrackY + 1,
                         fillWidth, kTrackHeight - 2, tone);
    }
    display.fillRect(kRadar.x + kInset, 273, trackWidth, 14,
                     Palette::Surface);
    std::snprintf(line, sizeof(line), tr(UiTextId::WifiNetworkRangeFormat),
                  static_cast<int>(signal.minimumRssiDbm),
                  static_cast<int>(signal.maximumRssiDbm));
    display.setTextColor(Palette::TextMuted, Palette::Surface);
    setUiCursor(UiTextRole::Meta, kRadar.x + kInset, 274);
    display.print(line);
    const char* trend = tr(wifiNetworkTrendText(signal.rssiTrendDb));
    const std::int16_t trendX = kRadar.x + kRadar.width - kInset -
                                display.textWidth(trend);
    const std::uint16_t trendTone = signal.rssiTrendDb >= 4
        ? Palette::Positive : (signal.rssiTrendDb <= -4
            ? Palette::Danger : Palette::TextMuted);
    display.setTextColor(trendTone, Palette::Surface);
    setUiCursor(UiTextRole::Meta, trendX, 274);
    display.print(trend);
}

