anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
std::size_t bleDeviceFirstVisible(std::size_t selection) {
    return selection < kVisibleWifiNetworkRows
        ? 0 : selection - kVisibleWifiNetworkRows + 1U;
}

void formatBleAddress(const Observation& device, char* output,
                      std::size_t capacity) {
    if (output == nullptr || capacity == 0U) return;
    std::snprintf(output, capacity, tr(UiTextId::BleAddressFormat),
                  static_cast<unsigned>(device.identity[0]),
                  static_cast<unsigned>(device.identity[1]),
                  static_cast<unsigned>(device.identity[2]),
                  static_cast<unsigned>(device.identity[3]),
                  static_cast<unsigned>(device.identity[4]),
                  static_cast<unsigned>(device.identity[5]));
}

UiTextId wifiDeviceTrendText(std::int16_t trendDb);

UiTextId bleDeviceKindText(BleDeviceKind kind) {
    switch (kind) {
        case BleDeviceKind::Phone: return UiTextId::BleKindPhone;
        case BleDeviceKind::Computer: return UiTextId::BleKindComputer;
        case BleDeviceKind::Watch: return UiTextId::BleKindWatch;
        case BleDeviceKind::Audio: return UiTextId::BleKindAudio;
        case BleDeviceKind::Keyboard: return UiTextId::BleKindKeyboard;
        case BleDeviceKind::Mouse: return UiTextId::BleKindMouse;
        case BleDeviceKind::Input: return UiTextId::BleKindInput;
        case BleDeviceKind::Heart: return UiTextId::BleKindHeart;
        case BleDeviceKind::Thermometer: return UiTextId::BleKindThermometer;
        case BleDeviceKind::Tag: return UiTextId::BleKindTag;
        case BleDeviceKind::Display: return UiTextId::BleKindDisplay;
        case BleDeviceKind::Fitness: return UiTextId::BleKindFitness;
        case BleDeviceKind::Unknown:
        default: return UiTextId::BleKindUnknown;
    }
}

UiTextId bleAddressTypeText(std::uint8_t type) {
    switch (type) {
        case 0U: return UiTextId::BleAddressPublic;
        case 2U: return UiTextId::BleAddressPublicIdentity;
        case 3U: return UiTextId::BleAddressRandomIdentity;
        case 1U:
        default: return UiTextId::BleAddressRandom;
    }
}

UiTextId bleAdvertisementModeText(
        const leshy1::domain::observations::BleAdvertisementFacts& facts) {
    if (facts.connectable) return UiTextId::BleAdvertisementConnectable;
    if (facts.scannable) return UiTextId::BleAdvertisementScannable;
    return UiTextId::BleAdvertisementBroadcast;
}

bool bleDeviceVendor(const Observation& device, char* output,
                     std::size_t capacity) {
    if (output == nullptr || capacity == 0U) return false;
    output[0] = '\0';
    const auto& facts = device.bleAdvertisement;
    if (facts.companyKnown &&
        bleCompanyDatabase.lookup(facts.companyId, output, capacity)) {
        return true;
    }
    if ((facts.knownServiceMask &
         leshy1::domain::observations::BleAdvertisementFacts::kServiceXiaomi)
        != 0U) {
        std::snprintf(output, capacity, "Xiaomi");
        return true;
    }
    return false;
}

void compactBlePrimary(const Observation& device, char* output,
                       std::size_t capacity) {
    if (output == nullptr || capacity == 0U) return;
    output[0] = '\0';
    const char* source = nullptr;
    if (device.labelLength != 0U) {
        source = device.label.data();
    } else {
        const char* subtype = leshy1::apps::ble::bleSubtypeName(
            leshy1::apps::ble::classifyBleSubtype(device));
        if (subtype[0] != '\0') source = subtype;
    }
    char vendor[BleCompanyDatabase::kNameSize + 1U] = {};
    if (source == nullptr && bleDeviceVendor(device, vendor, sizeof(vendor))) {
        source = vendor;
    }
    if (source == nullptr) {
        source = tr(bleDeviceKindText(
            leshy1::apps::ble::classifyBleDevice(device)));
    }
    std::snprintf(output, capacity, "%s", source);
    if (std::strlen(source) >= capacity && capacity > 2U) {
        output[capacity - 2U] = '~';
    }
}

const char* bleDeviceDescriptor(const Observation& device, char* vendor,
                                std::size_t vendorCapacity) {
    const BleSubtype subtype =
        leshy1::apps::ble::classifyBleSubtype(device);
    const char* subtypeName = leshy1::apps::ble::bleSubtypeName(subtype);
    if (subtypeName[0] != '\0') return subtypeName;
    const BleDeviceKind kind =
        leshy1::apps::ble::classifyBleDevice(device);
    if (kind != BleDeviceKind::Unknown) return tr(bleDeviceKindText(kind));
    if (bleDeviceVendor(device, vendor, vendorCapacity)) return vendor;
    return tr(UiTextId::BleKindUnknown);
}

const char* compactBleService(const Observation& device, char* output,
                              std::size_t capacity) {
    if (output == nullptr || capacity == 0U) return "";
    output[0] = '\0';
    const auto& facts = device.bleAdvertisement;
    const char* friendly =
        leshy1::apps::ble::bleServiceName(facts.knownServiceMask);
    if (friendly[0] != '\0') {
        std::snprintf(output, capacity, "%s", friendly);
        return output;
    }
    if (facts.firstServiceUuidLength == 0U) return output;
    std::snprintf(output, capacity, "%s", facts.firstServiceUuid.data());
    return output;
}

static_assert(kVisibleBleDeviceRows == kVisibleWifiNetworkRows,
              "Bluetooth and Wi-Fi lists share the four-row layout");

void resetBleDeviceListRenderCache() {
    bleDeviceRenderedRows = {};
    bleDeviceRenderedRowValid = {};
    bleDeviceListRenderState = BleDeviceListRenderState::Unknown;
}

BleDeviceRowVisual composeBleDeviceRowVisual(
        std::size_t index, std::size_t firstVisible) {
    BleDeviceRowVisual visual{};
    const Observation* device = bleDeviceAt(index);
    if (device == nullptr || index < firstVisible ||
        index >= firstVisible + kVisibleBleDeviceRows) {
        return visual;
    }
    visual.present = true;
    visual.selected = bleDeviceSelection == index;
    visual.tracker = leshy1::apps::ble::classifyBleTracker(*device) !=
        BleTrackerKind::None;
    visual.rssiDbm = device->rssiDbm;
    compactBlePrimary(*device, visual.label.data(), visual.label.size());
    char vendor[BleCompanyDatabase::kNameSize + 1U] = {};
    const char* descriptor =
        bleDeviceDescriptor(*device, vendor, sizeof(vendor));
    if (std::strcmp(visual.label.data(), descriptor) == 0) {
        const bool hasDifferentVendor =
            bleDeviceVendor(*device, vendor, sizeof(vendor)) &&
            std::strcmp(visual.label.data(), vendor) != 0;
        descriptor = hasDifferentVendor
            ? vendor
            : tr(bleAdvertisementModeText(device->bleAdvertisement));
    }
    std::snprintf(visual.note.data(), visual.note.size(),
                  tr(UiTextId::BleDeviceRowFormat), descriptor,
                  static_cast<int>(device->rssiDbm));
    return visual;
}

