anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
bool renderBleDeviceRow(std::size_t index, std::size_t firstVisible,
                        bool force = false) {
    if (index < firstVisible ||
        index >= firstVisible + kVisibleBleDeviceRows) {
        return false;
    }
    const std::size_t slot = index - firstVisible;
    const BleDeviceRowVisual visual =
        composeBleDeviceRowVisual(index, firstVisible);
    if (!force && bleDeviceRenderedRowValid[slot] &&
        bleDeviceRenderedRows[slot] == visual) {
        return false;
    }
    ++bleDeviceListRowRepaints;
    const Rect bounds = Components::homeRow(
        static_cast<std::uint8_t>(slot));
    if (!visual.present) {
        if (force || (bleDeviceRenderedRowValid[slot] &&
                      bleDeviceRenderedRows[slot].present)) {
            display.fillRect(bounds.x, bounds.y, bounds.width, bounds.height,
                             Palette::Canvas);
        }
        bleDeviceRenderedRows[slot] = visual;
        bleDeviceRenderedRowValid[slot] = true;
        return true;
    }
    const std::uint16_t background = visual.selected
        ? Palette::SurfaceFocus : Palette::Surface;
    display.fillRoundRect(bounds.x, bounds.y, bounds.width, bounds.height,
                          Layout::Radius, background);
    renderFocusCue(bounds, visual.selected);
    const std::int16_t labelTop = menuRowTextTop(bounds);
    display.setTextColor(visual.selected ? Palette::Focus
                                         : Palette::TextSecondary,
                         background);
    setUiCursor(UiTextRole::Body,
                bounds.x + kInteractiveRowTextInset, labelTop);
    display.print(visual.label.data());
    display.setTextColor(visual.tracker ? Palette::Warning
                                        : Palette::Positive,
        background);
    setUiCursor(UiTextRole::Meta,
                bounds.x + kInteractiveRowTextInset,
                labelTop + kRobotoCondensedBodyAscent +
                    kRobotoCondensedBodyDescent + 1);
    display.print(visual.note.data());
    renderWifiSignalBars(bounds, visual.rssiDbm, background);
    bleDeviceRenderedRows[slot] = visual;
    bleDeviceRenderedRowValid[slot] = true;
    return true;
}

bool renderBleDevicesData(bool force = false) {
    const std::size_t visibleSize = bleDeviceVisibleSize();
    if (visibleSize == 0U) {
        const bool unavailable = productSurveySourceUnavailableVisible();
        const BleDeviceListRenderState nextState = unavailable
            ? BleDeviceListRenderState::Unavailable
            : BleDeviceListRenderState::Searching;
        if (!force && bleDeviceListRenderState == nextState) return false;
        display.fillRect(
            Layout::Edge, Layout::ContentTop, Layout::ContentWidth,
            Layout::FooterDividerY - Layout::ContentTop, Palette::Canvas);
        ++bleDeviceListContentClears;
        bleDeviceRenderedRows = {};
        bleDeviceRenderedRowValid = {};
        display.setTextColor(unavailable ? Palette::Danger : Palette::Positive,
                             Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 14, 70);
        display.print(tr(unavailable ? UiTextId::BleReceiverUnavailable
                                     : UiTextId::BleDevicesSearching));
        bleDeviceListRenderState = nextState;
        return true;
    }
    if (bleDeviceListRenderState != BleDeviceListRenderState::Rows) {
        if (!force) {
            display.fillRect(
                Layout::Edge, Layout::ContentTop, Layout::ContentWidth,
                Layout::FooterDividerY - Layout::ContentTop, Palette::Canvas);
            ++bleDeviceListContentClears;
        }
        bleDeviceRenderedRows = {};
        bleDeviceRenderedRowValid = {};
    }
    const std::size_t first = bleDeviceFirstVisible(bleDeviceSelection);
    bool changed = false;
    for (std::size_t slot = 0U; slot < kVisibleBleDeviceRows; ++slot) {
        changed = renderBleDeviceRow(first + slot, first, force) || changed;
    }
    bleDeviceListRenderState = BleDeviceListRenderState::Rows;
    return changed;
}

void renderBleDevices(bool clearContent) {
    if (clearContent) resetBleDeviceListRenderCache();
    renderHeader(tr(UiTextId::BleDevicesTitle), clearContent);
    renderBleDevicesData(clearContent);
}

bool bleDeviceDetailStaticFieldsDiffer(const Observation& left,
                                       const Observation& right) {
    return left.identity != right.identity ||
        left.labelLength != right.labelLength ||
        std::memcmp(left.label.data(), right.label.data(), left.labelLength) != 0 ||
        !leshy1::domain::observations::bleAdvertisementFactsEqual(
            left.bleAdvertisement, right.bleAdvertisement);
}

BleDeviceRadarVisual bleDeviceRadarVisual(
        const Observation& device, const BleDeviceSignalStats& signal) {
    return {
        true,
        device.rssiDbm,
        signal.minimumRssiDbm,
        signal.maximumRssiDbm,
        signal.rssiTrendDb,
    };
}

void renderBleDeviceRange(const BleDeviceRadarVisual& visual) {
    char line[64] = {};
    std::snprintf(line, sizeof(line),
                  tr(UiTextId::WifiDeviceRssiRangeFormat),
                  static_cast<int>(visual.minimumRssiDbm),
                  static_cast<int>(visual.maximumRssiDbm));
    if (beginLiveTextRow(
            UiTextRole::Meta, Palette::TextMuted, Palette::Canvas)) {
        setLiveTextRowCursor(UiTextRole::Meta, 2, 4);
        liveTextRowSprite.print(line);
        pushLiveTextRow(Layout::Edge, 242);
        return;
    }
    ++bleDeviceDirectTextRowFallbacks;
    display.fillRect(Layout::Edge, 242, Layout::ContentWidth, 22,
                     Palette::Canvas);
    display.setTextColor(Palette::TextMuted, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 246);
    display.print(line);
}

void renderBleDeviceTrend(const BleDeviceRadarVisual& visual) {
    const std::uint16_t tone = visual.rssiTrendDb >= 4
        ? Palette::Positive
        : (visual.rssiTrendDb <= -4 ? Palette::Danger : Palette::TextMuted);
    if (beginLiveTextRow(UiTextRole::Meta, tone, Palette::Canvas)) {
        setLiveTextRowCursor(UiTextRole::Meta, 2, 5);
        liveTextRowSprite.print(tr(wifiDeviceTrendText(visual.rssiTrendDb)));
        pushLiveTextRow(Layout::Edge, 264);
        return;
    }
    ++bleDeviceDirectTextRowFallbacks;
    display.fillRect(Layout::Edge, 264, Layout::ContentWidth,
                     Layout::FooterDividerY - 264, Palette::Canvas);
    display.setTextColor(tone, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 269);
    display.print(tr(wifiDeviceTrendText(visual.rssiTrendDb)));
}

void renderBleDeviceRadar(const Observation& device,
                          const BleDeviceSignalStats& signal,
                          bool force = true) {
    constexpr std::int16_t kRadarTop = 170;
    const BleDeviceRadarVisual next = bleDeviceRadarVisual(device, signal);
    if (!force && bleDeviceRenderedRadar.valid &&
        bleDeviceRenderedRadar == next) {
        return;
    }
    if (force) {
        ++bleDeviceRadarFullRepaints;
        display.fillRect(Layout::Edge, kRadarTop, Layout::ContentWidth,
                         Layout::FooterDividerY - kRadarTop, Palette::Canvas);
        renderRadioSignalCard(
            device.rssiDbm,
            {Layout::Edge, kRadarTop, Layout::ContentWidth, 68}, true);
        renderBleDeviceRange(next);
        renderBleDeviceTrend(next);
    } else {
        ++bleDeviceRadarDeltaRepaints;
        if (!bleDeviceRenderedRadar.valid ||
            bleDeviceRenderedRadar.rssiDbm != next.rssiDbm) {
            if (bleDeviceRenderedRadar.valid) {
                renderRadioSignalCardDelta(
                    bleDeviceRenderedRadar.rssiDbm, next.rssiDbm,
                    {Layout::Edge, kRadarTop, Layout::ContentWidth, 68});
            } else {
                renderRadioSignalCard(
                    device.rssiDbm,
                    {Layout::Edge, kRadarTop, Layout::ContentWidth, 68}, true);
            }
        }
        if (!bleDeviceRenderedRadar.valid ||
            bleDeviceRenderedRadar.minimumRssiDbm != next.minimumRssiDbm ||
            bleDeviceRenderedRadar.maximumRssiDbm != next.maximumRssiDbm) {
            renderBleDeviceRange(next);
        }
        if (!bleDeviceRenderedRadar.valid ||
            bleDeviceRenderedRadar.rssiTrendDb != next.rssiTrendDb) {
            renderBleDeviceTrend(next);
        }
    }
    bleDeviceRenderedRadar = next;
}

void renderBleDevicePrimaryTextRow(const char* text, bool atomic) {
    constexpr std::int16_t kRowY = 30;
    constexpr std::int16_t kTextTop = 34;
    if (atomic && beginLiveTextRow(
            UiTextRole::Body, Palette::Focus, Palette::Canvas)) {
        setLiveTextRowCursor(UiTextRole::Body, 2, 4);
        liveTextRowSprite.print(text);
        pushLiveTextRow(Layout::Edge, kRowY);
        return;
    }
    if (atomic) {
        ++bleDeviceDirectTextRowFallbacks;
        display.fillRect(Layout::Edge, kRowY, Layout::ContentWidth,
                         kLiveTextRowHeight, Palette::Canvas);
    }
    display.setTextColor(Palette::Focus, Palette::Canvas);
    setUiCursor(UiTextRole::Body, 14, kTextTop);
    display.print(text);
}

void renderBleDeviceMetaTextRow(const char* text, std::uint16_t tone,
                                std::int16_t top, bool atomic) {
    if (atomic) {
        pushLiveMetaTextRow(text, tone, top);
        return;
    }
    display.setTextColor(tone, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, top);
    display.print(text);
}

void renderBleDeviceStaticFields(const Observation& device, bool atomic) {
    char primary[24] = {};
    compactBlePrimary(device, primary, sizeof(primary));
    renderBleDevicePrimaryTextRow(primary, atomic);

    char line[96] = {};
    char vendor[BleCompanyDatabase::kNameSize + 1U] = {};
    const BleTrackerKind tracker =
        leshy1::apps::ble::classifyBleTracker(device);
    const char* descriptor =
        bleDeviceDescriptor(device, vendor, sizeof(vendor));
    if (tracker != BleTrackerKind::None) {
        std::snprintf(line, sizeof(line), tr(UiTextId::BleTrackerFormat),
                      descriptor);
    } else {
        std::snprintf(line, sizeof(line), "%s", descriptor);
    }
    renderBleDeviceMetaTextRow(
        line, tracker != BleTrackerKind::None
            ? Palette::Warning : Palette::TextSecondary,
        57, atomic);

