anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    formatBleAddress(device, line, sizeof(line));
    renderBleDeviceMetaTextRow(line, Palette::TextSecondary, 76, atomic);

    const auto& facts = device.bleAdvertisement;
    std::snprintf(line, sizeof(line), tr(UiTextId::BleAddressModeFormat),
                  tr(bleAddressTypeText(facts.addressType)),
                  tr(bleAdvertisementModeText(facts)));
    renderBleDeviceMetaTextRow(line, Palette::TextMuted, 95, atomic);

    const bool vendorKnown = bleDeviceVendor(device, vendor, sizeof(vendor));
    if (vendorKnown) {
        std::snprintf(line, sizeof(line), tr(UiTextId::BleVendorFormat), vendor);
    } else if (facts.companyKnown) {
        std::snprintf(line, sizeof(line), tr(UiTextId::BleCompanyFormat),
                      static_cast<unsigned>(facts.companyId));
    } else {
        std::snprintf(line, sizeof(line), "%s",
                      tr(UiTextId::BleVendorUnknown));
    }
    renderBleDeviceMetaTextRow(
        line, vendorKnown ? Palette::TextSecondary : Palette::TextMuted,
        114, atomic);

    char serviceText[24] = {};
    const char* service =
        compactBleService(device, serviceText, sizeof(serviceText));
    if (service[0] != '\0') {
        std::snprintf(line, sizeof(line), tr(UiTextId::BleServiceFormat),
                      service);
    } else {
        std::snprintf(line, sizeof(line), "%s",
                      tr(UiTextId::BleServiceUnknown));
    }
    renderBleDeviceMetaTextRow(
        line, service[0] == '\0' ? Palette::TextMuted : Palette::Positive,
        133, atomic);

    if (facts.txPowerKnown && facts.appearanceKnown) {
        std::snprintf(line, sizeof(line),
                      tr(UiTextId::BleTxAppearanceFormat),
                      static_cast<int>(facts.txPowerDbm),
                      static_cast<unsigned>(facts.appearance));
    } else if (facts.txPowerKnown) {
        std::snprintf(line, sizeof(line), tr(UiTextId::BleTxFormat),
                      static_cast<int>(facts.txPowerDbm));
    } else if (facts.appearanceKnown) {
        std::snprintf(line, sizeof(line), tr(UiTextId::BleAppearanceFormat),
                      static_cast<unsigned>(facts.appearance));
    } else {
        std::snprintf(line, sizeof(line), "%s", tr(UiTextId::BlePassiveOnly));
    }
    renderBleDeviceMetaTextRow(line, Palette::TextMuted, 152, atomic);
}

void renderBleDeviceDetailData() {
    const Observation& device = *liveBleDeviceDetail();
    const BleDeviceSignalStats& signal = *liveBleDeviceSignal();
    bleDeviceDetail = device;
    bleDeviceDetailSignal = signal;
    display.fillRect(0, Layout::ContentTop, Layout::ScreenWidth,
                     Layout::FooterDividerY - Layout::ContentTop,
                     Palette::Canvas);
    ++bleDeviceDetailContentClears;
    renderBleDeviceStaticFields(device, false);
    renderBleDeviceRadar(device, signal);
    bleDeviceRenderedDetail = device;
}

void renderBleDeviceDetail(bool clearContent) {
    renderHeader(tr(UiTextId::BleDeviceDetailTitle), clearContent);
    renderBleDeviceDetailData();
}

void renderBleInspectorBodyRow(const char* text, std::uint16_t tone,
                               std::int16_t rowY, bool atomic);
void renderBleInspectorMetaRow(const char* text, std::uint16_t tone,
                               std::int16_t textTop, bool atomic);

void renderBleInspectorModeMenu(bool clearContent) {
    renderHeader(tr(UiTextId::BleInspectorModesTitle), clearContent);
    if (clearContent) {
        display.fillRect(0, Layout::ContentTop, Layout::ScreenWidth,
                         Layout::FooterDividerY - Layout::ContentTop,
                         Palette::Canvas);
    }
    renderMenuRow(
        Components::choiceRow(0U), tr(UiTextId::BleInspectorRawMode),
        tr(UiTextId::BleInspectorRawModeNote),
        bleInspectorModeSelection == 0U, true, Tone::Positive);
    const bool connectable = bleSelectedDeviceConnectable();
    renderMenuRow(
        Components::choiceRow(1U), tr(UiTextId::BleInspectorGattMode),
        tr(connectable ? UiTextId::BleInspectorGattModeNote
                       : UiTextId::BleInspectorGattUnavailable),
        bleInspectorModeSelection == 1U, connectable,
        connectable ? Tone::Warning : Tone::Muted);
}

void formatBleGattUuid(const leshy1::services::ble::BleGattUuid& uuid,
                       char* output, std::size_t capacity) {
    if (output == nullptr || capacity == 0U) return;
    if (uuid.widthBytes == 2U) {
        const std::uint16_t value = static_cast<std::uint16_t>(
            uuid.bytes[0] | (static_cast<std::uint16_t>(uuid.bytes[1]) << 8U));
        std::snprintf(output, capacity, "%04X", value);
    } else if (uuid.widthBytes == 4U) {
        const std::uint32_t value =
            static_cast<std::uint32_t>(uuid.bytes[0]) |
            (static_cast<std::uint32_t>(uuid.bytes[1]) << 8U) |
            (static_cast<std::uint32_t>(uuid.bytes[2]) << 16U) |
            (static_cast<std::uint32_t>(uuid.bytes[3]) << 24U);
        std::snprintf(output, capacity, "%08lX",
                      static_cast<unsigned long>(value));
    } else if (uuid.widthBytes == 16U) {
        std::snprintf(output, capacity, "%02X%02X%02X%02X..%02X%02X",
                      uuid.bytes[15], uuid.bytes[14], uuid.bytes[13],
                      uuid.bytes[12], uuid.bytes[1], uuid.bytes[0]);
    } else {
        std::snprintf(output, capacity, "INVALID");
    }
}

UiTextId bleGattStateHeadline(BleGattInspectorState state) {
    if (bleGattWaitingForSurveyStop) return UiTextId::BleGattStoppingPassive;
    switch (state) {
        case BleGattInspectorState::PermissionReview:
            return UiTextId::BleGattPermission;
        case BleGattInspectorState::AwaitingConfirmation:
            return UiTextId::BleGattConfirm;
        case BleGattInspectorState::Connecting:
            return UiTextId::BleGattConnecting;
        case BleGattInspectorState::Discovering:
            return UiTextId::BleGattDiscovering;
        case BleGattInspectorState::Ready:
            return UiTextId::BleGattReady;
        case BleGattInspectorState::CleanupPending:
            return UiTextId::BleGattCleanup;
        case BleGattInspectorState::Failed:
            return UiTextId::BleGattFailed;
        case BleGattInspectorState::Idle:
        case BleGattInspectorState::Complete:
        default:
            return UiTextId::BleGattCleanup;
    }
}

