anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void renderBleGattInspectorData(bool force) {
    const BleGattInspectorState state = bleGattTransport.state();
    const std::size_t services = bleGattTransport.serviceCount();
    const std::size_t characteristics =
        bleGattTransport.characteristicCount();
    if (!force && state == bleGattRenderedState &&
        services == bleGattRenderedServices &&
        characteristics == bleGattRenderedCharacteristics &&
        bleGattFactSelection == bleGattRenderedSelection &&
        !bleGattWaitingForSurveyStop) {
        return;
    }
    if (force) {
        display.fillRect(0, Layout::ContentTop, Layout::ScreenWidth,
                         Layout::FooterDividerY - Layout::ContentTop,
                         Palette::Canvas);
        ++bleGattContentClears;
    }
    const bool atomic = !force;
    ++bleGattRowRepaints;
    const bool failed = state == BleGattInspectorState::Failed;
    const bool ready = state == BleGattInspectorState::Ready;
    renderBleInspectorBodyRow(
        tr(bleGattStateHeadline(state)),
        failed ? Palette::Warning : (ready ? Palette::Positive
                                            : Palette::Focus),
        30, atomic);

    char line[96] = {};
    formatBleAddress(bleDeviceDetail, line, sizeof(line));
    renderBleInspectorMetaRow(line, Palette::TextSecondary, 58, atomic);
    std::snprintf(line, sizeof(line), tr(UiTextId::BleGattCountFormat),
                  static_cast<unsigned>(services),
                  static_cast<unsigned>(characteristics));
    renderBleInspectorMetaRow(line, Palette::TextMuted, 78, atomic);

    std::array<std::array<char, 96>, 4> rows{};
    if (state == BleGattInspectorState::PermissionReview) {
        std::snprintf(rows[0].data(), rows[0].size(), "%s",
                      tr(UiTextId::BleGattPermissionScope));
        std::snprintf(rows[1].data(), rows[1].size(), "%s",
                      tr(UiTextId::BleGattPermissionNoData));
        std::snprintf(rows[2].data(), rows[2].size(), "%s",
                      tr(UiTextId::BleGattPermissionDisconnect));
    } else if (state == BleGattInspectorState::AwaitingConfirmation &&
               !bleGattWaitingForSurveyStop) {
        std::snprintf(rows[0].data(), rows[0].size(), "%s",
                      tr(UiTextId::BleGattConfirmAgain));
        std::snprintf(rows[1].data(), rows[1].size(), "%s",
                      tr(UiTextId::BleGattPermissionScope));
        std::snprintf(rows[2].data(), rows[2].size(), "%s",
                      tr(UiTextId::BleGattPermissionNoData));
    } else if (ready) {
        const std::size_t total = services + characteristics;
        const std::size_t first = bleGattFactSelection < 4U
            ? 0U : bleGattFactSelection - 3U;
        for (std::size_t row = 0U; row < rows.size(); ++row) {
            const std::size_t index = first + row;
            if (index >= total) break;
            char uuid[24] = {};
            if (index < services) {
                BleGattServiceFact service{};
                if (bleGattTransport.copyService(index, &service)) {
                    formatBleGattUuid(service.uuid, uuid, sizeof(uuid));
                    std::snprintf(
                        rows[row].data(), rows[row].size(),
                        tr(UiTextId::BleGattServiceRowFormat),
                        static_cast<unsigned>(service.startHandle),
                        static_cast<unsigned>(service.endHandle), uuid);
                }
            } else {
                BleGattCharacteristicFact characteristic{};
                if (bleGattTransport.copyCharacteristic(
                        index - services, &characteristic)) {
                    formatBleGattUuid(
                        characteristic.uuid, uuid, sizeof(uuid));
                    std::snprintf(
                        rows[row].data(), rows[row].size(),
                        tr(UiTextId::BleGattCharacteristicRowFormat),
                        static_cast<unsigned>(
                            characteristic.declarationHandle),
                        static_cast<unsigned>(characteristic.properties),
                        uuid);
                }
            }
        }
    } else if (failed) {
        std::snprintf(
            rows[0].data(), rows[0].size(),
            tr(UiTextId::BleGattFailureFormat),
            leshy1::services::ble::bleGattInspectorFailureName(
                bleGattTransport.failure()));
        std::snprintf(rows[1].data(), rows[1].size(), "%s",
                      bleGattTransport.cleanupComplete()
                          ? tr(UiTextId::BleGattCleanupComplete)
                          : tr(UiTextId::BleGattCleanupIncomplete));
    }
    constexpr std::array<std::int16_t, 4> kRowTops{108, 136, 164, 192};
    for (std::size_t row = 0U; row < rows.size(); ++row) {
        const bool selected = ready &&
            (bleGattFactSelection ==
             (bleGattFactSelection < 4U ? row
                                        : bleGattFactSelection - 3U + row));
        renderBleInspectorMetaRow(
            rows[row].data(), selected ? Palette::Focus
                                       : Palette::TextSecondary,
            kRowTops[row], atomic);
    }
    renderBleInspectorMetaRow(tr(UiTextId::BleGattActiveSafety),
                              Palette::TextMuted, 260, atomic);
    bleGattRenderedState = state;
    bleGattRenderedServices = services;
    bleGattRenderedCharacteristics = characteristics;
    bleGattRenderedSelection = bleGattFactSelection;
}

void renderBleGattInspector(bool clearContent) {
    renderHeader(tr(UiTextId::BleGattTitle), clearContent);
    renderBleGattInspectorData(clearContent);
}

void renderBleInspectorBodyRow(const char* text, std::uint16_t tone,
                               std::int16_t rowY, bool atomic) {
    if (atomic && beginLiveTextRow(UiTextRole::Body, tone, Palette::Canvas)) {
        setLiveTextRowCursor(UiTextRole::Body, 2, 4);
        liveTextRowSprite.print(text);
        pushLiveTextRow(Layout::Edge, rowY);
        ++bleInspectorAtomicRowPushes;
        return;
    }
    if (atomic) {
        display.fillRect(Layout::Edge, rowY, Layout::ContentWidth,
                         kLiveTextRowHeight, Palette::Canvas);
    }
    display.setTextColor(tone, Palette::Canvas);
    setUiCursor(UiTextRole::Body, 14, rowY + 4);
    display.print(text);
}

void renderBleInspectorMetaRow(const char* text, std::uint16_t tone,
                               std::int16_t textTop, bool atomic) {
    if (atomic) {
        if (pushLiveMetaTextRow(text, tone, textTop)) {
            ++bleInspectorAtomicRowPushes;
        }
        return;
    }
    display.setTextColor(tone, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, textTop);
    display.print(text);
}

void renderBleInspectorRawData(bool force) {
    const BleInspectorCaptureSummary summary = bleInspectorCaptureSnapshot();
    if (!force && bleInspectorRenderedRevision == summary.revision) return;
    if (force) {
        display.fillRect(0, Layout::ContentTop, Layout::ScreenWidth,
                         Layout::FooterDividerY - Layout::ContentTop,
                         Palette::Canvas);
        ++bleInspectorContentClears;
    }
    const bool atomic = !force;
    char line[96] = {};
    renderBleInspectorBodyRow(
        tr(summary.state == BleInspectorCaptureState::Frozen
               ? UiTextId::BleInspectorFrozen
               : UiTextId::BleInspectorReceiving),
        summary.state == BleInspectorCaptureState::Frozen
            ? Palette::Warning : Palette::Positive,
        30, atomic);
    std::snprintf(line, sizeof(line),
                  tr(UiTextId::BleInspectorAddressFormat),
                  summary.target.address[0], summary.target.address[1],
                  summary.target.address[2], summary.target.address[3],
                  summary.target.address[4], summary.target.address[5],
                  static_cast<unsigned>(summary.target.addressType));
    renderBleInspectorMetaRow(line, Palette::TextSecondary, 58, atomic);
    std::snprintf(line, sizeof(line), tr(UiTextId::BleInspectorCountFormat),
                  static_cast<unsigned>(summary.records),
                  static_cast<unsigned>(BleInspectorCapture::kRecordCapacity));
    renderBleInspectorBodyRow(line, Palette::Focus, 74, atomic);
    std::snprintf(
        line, sizeof(line), tr(UiTextId::BleInspectorAccountingFormat),
        static_cast<unsigned long>(summary.counters.differentTarget),
        static_cast<unsigned long>(summary.counters.invalid),
        static_cast<unsigned long>(summary.counters.dropped));
    renderBleInspectorMetaRow(
        line, summary.counters.dropped == 0U
            ? Palette::TextMuted : Palette::Warning,
        104, atomic);
    if (summary.latestPresent) {
        std::snprintf(line, sizeof(line),
                      tr(UiTextId::BleInspectorLatestFormat),
                      static_cast<int>(summary.latest.rssiDbm),
                      static_cast<unsigned>(summary.latest.eventType),
                      static_cast<unsigned>(summary.latest.payloadLength));
    } else {
        std::snprintf(line, sizeof(line), "%s",
                      tr(UiTextId::BleInspectorEmpty));
    }
    renderBleInspectorMetaRow(line, Palette::TextSecondary, 126, atomic);
    renderBleInspectorMetaRow(tr(UiTextId::BleInspectorPayload),
                              Palette::TextMuted, 150, atomic);
    constexpr char kHex[] = "0123456789ABCDEF";
    for (std::size_t row = 0U; row < 4U; ++row) {
        char payload[17] = {};
        std::size_t chars = 0U;
        const std::size_t firstByte = row * 8U;
        if (summary.latestPresent) {
            for (std::size_t byte = firstByte;
                 byte < summary.latest.payloadLength &&
                 byte < firstByte + 8U; ++byte) {
                payload[chars++] = kHex[summary.latest.payload[byte] >> 4U];
                payload[chars++] =
                    kHex[summary.latest.payload[byte] & 0x0fU];
            }
        }
        std::snprintf(line, sizeof(line), "%02u  %s",
                      static_cast<unsigned>(firstByte), payload);
        renderBleInspectorMetaRow(
            line, chars == 0U ? Palette::TextMuted : Palette::Positive,
            static_cast<std::int16_t>(172 + row * 20U), atomic);
    }
    renderBleInspectorMetaRow(tr(UiTextId::BleInspectorExportHint),
                              Palette::TextMuted, 260, atomic);
    bleInspectorRenderedRevision = summary.revision;
}

void renderBleInspectorRaw(bool clearContent) {
    renderHeader(tr(UiTextId::BleInspectorTitle), clearContent);
    renderBleInspectorRawData(clearContent);
}

std::size_t wifiDeviceFirstVisible(std::size_t selection) {
    return selection < kVisibleWifiNetworkRows
        ? 0 : selection - kVisibleWifiNetworkRows + 1U;
}

UiTextId wifiDeviceGenerationText(WifiDeviceGeneration generation) {
    switch (generation) {
        case WifiDeviceGeneration::Legacy:
            return UiTextId::WifiDeviceWifiLegacy;
        case WifiDeviceGeneration::Wifi4:
            return UiTextId::WifiDeviceWifi4;
        case WifiDeviceGeneration::Wifi5:
            return UiTextId::WifiDeviceWifi5;
        case WifiDeviceGeneration::Wifi6:
            return UiTextId::WifiDeviceWifi6;
        case WifiDeviceGeneration::Unknown:
        default:
            return UiTextId::WifiDeviceUnknown;
    }
}

const char* wifiDeviceMaker(const WifiDeviceRecord& device) {
    if (device.wpsManufacturerLength != 0U) {
        return device.wpsManufacturer.data();
    }
    return device.ouiVendorLength != 0U ? device.ouiVendor.data() : nullptr;
}

const char* wifiDevicePrimaryLabel(const WifiDeviceRecord& device) {
    if (device.wpsDeviceNameLength != 0U) {
        return device.wpsDeviceName.data();
    }
    if (device.wpsModelLength != 0U) return device.wpsModel.data();
    const char* maker = wifiDeviceMaker(device);
    return maker == nullptr ? "" : maker;
}

void formatWifiAddress(const std::array<std::uint8_t, 6>& address,
                       char* output, std::size_t capacity);

