anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void compactWifiDeviceLabel(const WifiDeviceRecord& device, char* output,
                            std::size_t capacity) {
    if (output == nullptr || capacity == 0U) return;
    const char* source = wifiDevicePrimaryLabel(device);
    if (source[0] == '\0') {
        formatWifiAddress(device.address, output, capacity);
        return;
    }
    const std::size_t sourceLength = std::strlen(source);
    const std::size_t visible = sourceLength < capacity
        ? sourceLength : capacity - 1U;
    std::memcpy(output, source, visible);
    output[visible] = '\0';
    if (visible < sourceLength && visible > 1U) output[visible - 1U] = '~';
}

UiTextId wifiDeviceStateText(WifiDeviceState state) {
    switch (state) {
        case WifiDeviceState::Searching: return UiTextId::WifiDeviceSearching;
        case WifiDeviceState::Connecting: return UiTextId::WifiDeviceConnecting;
        case WifiDeviceState::Connected: return UiTextId::WifiDeviceConnected;
    }
    return UiTextId::WifiDeviceSearching;
}

void formatWifiAddress(const std::array<std::uint8_t, 6>& address,
                       char* output, std::size_t capacity) {
    if (output == nullptr || capacity == 0U) return;
    std::snprintf(output, capacity, tr(UiTextId::WifiDeviceAddressFormat),
                  static_cast<unsigned>(address[0]),
                  static_cast<unsigned>(address[1]),
                  static_cast<unsigned>(address[2]),
                  static_cast<unsigned>(address[3]),
                  static_cast<unsigned>(address[4]),
                  static_cast<unsigned>(address[5]));
}

void renderWifiDeviceRow(std::size_t index, std::size_t firstVisible) {
    const WifiDeviceRecord* device = wifiDeviceAt(index);
    if (device == nullptr || index < firstVisible ||
        index >= firstVisible + kVisibleWifiNetworkRows) {
        return;
    }
    const Rect bounds = Components::homeRow(
        static_cast<std::uint8_t>(index - firstVisible));
    const bool selected = wifiDeviceSelection == index;
    const std::uint16_t background = selected ? Palette::SurfaceFocus
                                               : Palette::Surface;
    display.fillRoundRect(bounds.x, bounds.y, bounds.width, bounds.height,
                          Layout::Radius, background);
    renderFocusCue(bounds, selected);
    char primary[23] = {};
    compactWifiDeviceLabel(*device, primary, sizeof(primary));
    const std::int16_t labelTop = menuRowTextTop(bounds);
    display.setTextColor(selected ? Palette::Focus : Palette::TextSecondary,
                         background);
    setUiCursor(UiTextRole::Body,
                bounds.x + kInteractiveRowTextInset, labelTop);
    display.print(primary);
    char note[64] = {};
    std::snprintf(note, sizeof(note), tr(UiTextId::WifiDeviceRowFormat),
                  tr(wifiDeviceStateText(device->state)),
                  static_cast<unsigned>(device->channel),
                  static_cast<int>(device->rssiDbm));
    display.setTextColor(Palette::Positive, background);
    setUiCursor(UiTextRole::Meta,
                bounds.x + kInteractiveRowTextInset,
                labelTop + kRobotoCondensedBodyAscent +
                    kRobotoCondensedBodyDescent + 1);
    display.print(note);
}

void renderWifiDevicesData() {
    if (wifiDeviceCatalog.size() == 0U) {
        const auto stats = wifiFrameCapture.deviceMonitorStats();
        display.setTextColor(stats.active ? Palette::Positive : Palette::Danger,
                             Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 14, 70);
        display.print(tr(stats.active ? UiTextId::WifiDevicesListening
                                      : UiTextId::WifiDevicesFailed));
        return;
    }
    const std::size_t first = wifiDeviceFirstVisible(wifiDeviceSelection);
    const std::size_t end = wifiDeviceVisibleSize() <
            first + kVisibleWifiNetworkRows
        ? wifiDeviceVisibleSize() : first + kVisibleWifiNetworkRows;
    for (std::size_t index = first; index < end; ++index) {
        renderWifiDeviceRow(index, first);
    }
}

void renderWifiDevices(bool clearContent) {
    renderHeader(tr(UiTextId::WifiMenuDevices), clearContent);
    renderWifiDevicesData();
}

void renderWifiDeviceDetailLiveData(bool force = true);

void renderWifiDeviceDetail(bool clearContent) {
    renderHeader(tr(UiTextId::WifiDeviceDetailTitle), clearContent);
    char line[96] = {};
    char primary[23] = {};
    const char* primarySource = wifiDevicePrimaryLabel(wifiDeviceDetail);
    const bool primaryIsAddress = primarySource[0] == '\0';
    compactWifiDeviceLabel(wifiDeviceDetail, primary, sizeof(primary));
    display.setTextColor(Palette::Focus, Palette::Canvas);
    setUiCursor(UiTextRole::Body, 14, 42);
    display.print(primary);
    display.setTextColor(primaryIsAddress ? Palette::TextMuted
                                          : Palette::TextSecondary,
                         Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 65);
    if (primaryIsAddress) {
        std::snprintf(line, sizeof(line), "%s",
                      tr(wifiDeviceDetail.locallyAdministered
                             ? UiTextId::WifiDevicePrivateAddress
                             : UiTextId::WifiDeviceFactoryAddress));
    } else {
        formatWifiAddress(wifiDeviceDetail.address, line, sizeof(line));
    }
    display.print(line);
    const char* maker = wifiDeviceMaker(wifiDeviceDetail);
    bool secondaryIdentity = false;
    if (wifiDeviceDetail.wpsDeviceNameLength != 0U && maker != nullptr &&
        wifiDeviceDetail.wpsModelLength != 0U) {
        std::snprintf(line, sizeof(line), "%s · %s", maker,
                      wifiDeviceDetail.wpsModel.data());
        secondaryIdentity = true;
    } else if ((wifiDeviceDetail.wpsDeviceNameLength != 0U ||
                wifiDeviceDetail.wpsModelLength != 0U) && maker != nullptr) {
        std::snprintf(line, sizeof(line), tr(UiTextId::WifiDeviceMakerFormat),
                      maker);
        secondaryIdentity = true;
    } else if (wifiDeviceDetail.wpsDeviceNameLength != 0U &&
               wifiDeviceDetail.wpsModelLength != 0U) {
        std::snprintf(line, sizeof(line), tr(UiTextId::WifiDeviceModelFormat),
                      wifiDeviceDetail.wpsModel.data());
        secondaryIdentity = true;
    } else if (!primaryIsAddress) {
        std::snprintf(line, sizeof(line), "%s",
                      tr(wifiDeviceDetail.locallyAdministered
                             ? UiTextId::WifiDevicePrivateAddress
                             : UiTextId::WifiDeviceFactoryAddress));
        secondaryIdentity = true;
    } else {
        std::snprintf(line, sizeof(line), "%s",
                      tr(UiTextId::WifiDevicePassiveOnly));
        secondaryIdentity = true;
    }
    if (secondaryIdentity) {
        display.setTextColor(
            maker == nullptr ? Palette::TextMuted : Palette::TextSecondary,
            Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 14, 88);
        display.print(line);
    }
    renderWifiDeviceDetailLiveData();
}

