anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void renderWifiDeviceDetailLiveData(bool force) {
    constexpr std::int16_t kLiveTop = 101;
    if (force) {
        display.fillRect(Layout::Edge, kLiveTop, Layout::ContentWidth,
                         Layout::FooterDividerY - kLiveTop, Palette::Canvas);
    } else {
        display.fillRect(Layout::Edge, kLiveTop, Layout::ContentWidth, 47,
                         Palette::Canvas);
    }
    char line[96] = {};
    std::snprintf(
        line, sizeof(line), tr(UiTextId::WifiDeviceRadioFormat),
        tr(wifiDeviceGenerationText(wifiDeviceDetail.generation)),
        static_cast<unsigned>(wifiDeviceDetail.channel));
    display.setTextColor(Palette::Positive, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 108);
    display.print(line);
    if (wifiDeviceDetail.ssidLength != 0U) {
        std::snprintf(line, sizeof(line),
                      tr(UiTextId::WifiDeviceNetworkFormat),
                      wifiDeviceDetail.ssid.data());
        display.setTextColor(Palette::TextSecondary, Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 14, 130);
        display.print(line);
    } else if (wifiDeviceDetail.bssidKnown) {
        std::snprintf(
            line, sizeof(line), tr(UiTextId::WifiNetworkBssidFormat),
            static_cast<unsigned>(wifiDeviceDetail.bssid[0]),
            static_cast<unsigned>(wifiDeviceDetail.bssid[1]),
            static_cast<unsigned>(wifiDeviceDetail.bssid[2]),
            static_cast<unsigned>(wifiDeviceDetail.bssid[3]),
            static_cast<unsigned>(wifiDeviceDetail.bssid[4]),
            static_cast<unsigned>(wifiDeviceDetail.bssid[5]));
        display.setTextColor(Palette::TextSecondary, Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 14, 130);
        display.print(line);
    } else {
        const std::uint64_t observedUs = wifiDeviceDetail.monotonicUs >=
                wifiDeviceDetail.firstSeenUs
            ? wifiDeviceDetail.monotonicUs - wifiDeviceDetail.firstSeenUs : 0U;
        std::snprintf(line, sizeof(line), tr(UiTextId::WifiDeviceSeenFormat),
                      static_cast<unsigned long>(observedUs / 1000000ULL),
                      tr(wifiDeviceStateText(wifiDeviceDetail.state)));
        display.setTextColor(Palette::TextMuted, Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 14, 130);
        display.print(line);
    }
    renderRadioSignalCard(
        wifiDeviceDetail.rssiDbm,
        {Layout::Edge, 150, Layout::ContentWidth, 88}, force);
    display.fillRect(Layout::Edge, 242, Layout::ContentWidth,
                     Layout::FooterDividerY - 242, Palette::Canvas);
    std::snprintf(line, sizeof(line), tr(UiTextId::WifiDeviceRssiRangeFormat),
                  static_cast<int>(wifiDeviceDetail.minimumRssiDbm),
                  static_cast<int>(wifiDeviceDetail.maximumRssiDbm));
    display.setTextColor(Palette::TextMuted, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 246);
    display.print(line);
    display.setTextColor(Palette::Positive, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 269);
    display.print(tr(wifiDeviceTrendText(wifiDeviceDetail.rssiTrendDb)));
    if (wifiDeviceDetail.ssidLength != 0U || wifiDeviceDetail.bssidKnown) {
        const char* state = tr(wifiDeviceStateText(wifiDeviceDetail.state));
        display.setTextColor(Palette::TextSecondary, Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 0, 269);
        const std::int16_t stateX = Layout::ScreenWidth - Layout::Edge -
                                    display.textWidth(state);
        setUiCursor(UiTextRole::Meta, stateX, 269);
        display.print(state);
    }
}

UiTextId wifiDeviceTrendText(std::int16_t trendDb) {
    if (trendDb >= 4) return UiTextId::WifiDeviceTrendCloser;
    if (trendDb <= -4) return UiTextId::WifiDeviceTrendFarther;
    return UiTextId::WifiDeviceTrendStable;
}

constexpr std::int16_t kWifiChannelInfoY = Layout::ContentTop;
constexpr std::int16_t kWifiChannelInfoHeight = 26;
constexpr std::int16_t kWifiChannelGraphY =
    kWifiChannelInfoY + kWifiChannelInfoHeight;
constexpr std::int16_t kWifiChannelGraphHeight = 194;
constexpr std::int16_t kWifiChannelGraphBottom =
    kWifiChannelGraphY + kWifiChannelGraphHeight;
constexpr std::int16_t kWifiChannelAxisY = kWifiChannelGraphBottom + 5;
constexpr std::int16_t kWifiChannelBarX = 4;
constexpr std::int16_t kWifiChannelBarWidth = 13;
constexpr std::int16_t kWifiChannelCurrentBarWidth = 7;
constexpr std::int16_t kWifiChannelBarStep = 18;
constexpr std::uint16_t kWifiChannelDisplayFullScalePermille = 80;
constexpr std::uint16_t kWifiChannelGraphBackground =
    leshy1::ui::visual::rgb565(0, 0, 0);
constexpr std::uint16_t kWifiChannelAverageTone =
    leshy1::ui::visual::rgb565(104, 108, 108);
static_assert(kWifiChannelAxisY + 18 <= Layout::FooterDividerY,
              "Wi-Fi channel axis must stay above the footer");

std::uint16_t wifiChannelBarTone(std::uint16_t busyPermille) {
    if (busyPermille >= 80U) return Palette::Danger;
    if (busyPermille >= 40U) return Palette::Warning;
    return Palette::Positive;
}

std::int16_t wifiChannelBarHeight(std::uint16_t busyPermille) {
    const std::uint32_t scaled =
        static_cast<std::uint32_t>(busyPermille) *
        kWifiChannelGraphHeight / kWifiChannelDisplayFullScalePermille;
    return static_cast<std::int16_t>(
        scaled > static_cast<std::uint32_t>(kWifiChannelGraphHeight)
            ? kWifiChannelGraphHeight : scaled);
}

void renderWifiChannelAxisLabel(std::uint8_t channel, std::uint16_t tone) {
    if (channel < 1U || channel > 13U) return;
    char label[4] = {};
    std::snprintf(label, sizeof(label), "%u", static_cast<unsigned>(channel));
    selectUiFont(UiTextRole::Meta);
    const std::int16_t center = kWifiChannelBarX +
        static_cast<std::int16_t>(channel - 1U) * kWifiChannelBarStep +
        kWifiChannelBarWidth / 2;
    display.fillRect(center - kWifiChannelBarStep / 2, kWifiChannelAxisY,
                     kWifiChannelBarStep, 17, Palette::Canvas);
    display.setTextColor(tone, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, center - display.textWidth(label) / 2,
                kWifiChannelAxisY);
    display.print(label);
}

void renderWifiChannelInfo(const WifiChannelLoadSnapshot& snapshot,
                           bool force) {
    const std::uint8_t best = wifiFrameCapture.bestPrimaryChannel();
    if (force) {
        display.setTextColor(Palette::TextMuted, Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 4, kWifiChannelInfoY + 5);
        display.print(tr(UiTextId::WifiChannelsScale));
        display.fillRect(50, kWifiChannelInfoY + 9, 7, 7,
                         kWifiChannelAverageTone);
        setUiCursor(UiTextRole::Meta, 61, kWifiChannelInfoY + 5);
        display.print(tr(UiTextId::WifiChannelsAverageLegend));
    }
    if (!force && best == wifiChannelRenderedBest) return;
    if (wifiChannelRenderedBest >= 1U && wifiChannelRenderedBest <= 13U) {
        renderWifiChannelAxisLabel(wifiChannelRenderedBest,
                                   Palette::TextMuted);
    }
    if (best >= 1U && best <= 13U) {
        renderWifiChannelAxisLabel(best, Palette::Focus);
    }
    constexpr std::int16_t rightX = 116;
    display.fillRect(rightX, kWifiChannelInfoY,
                     Layout::ScreenWidth - rightX,
                     kWifiChannelInfoHeight, Palette::Canvas);
    char line[40] = {};
    if (best == 0U) {
        std::snprintf(line, sizeof(line), "%s",
                      tr(UiTextId::WifiChannelsMeasuring));
    } else {
        std::snprintf(line, sizeof(line),
                      tr(UiTextId::WifiChannelsBestFormat),
                      static_cast<unsigned>(best));
    }
    selectUiFont(UiTextRole::Meta);
    const std::int16_t x = Layout::ScreenWidth - 4 - display.textWidth(line);
    display.setTextColor(best == 0U ? Palette::TextMuted : Palette::Focus,
                         Palette::Canvas);
    setUiCursor(UiTextRole::Meta, x < rightX ? rightX : x,
                kWifiChannelInfoY + 5);
    display.print(line);
    wifiChannelRenderedBest = best;
    (void)snapshot;
}

void renderWifiChannelBar(std::uint8_t channel,
                          const WifiChannelLoadSnapshot& snapshot,
                          bool force) {
    if (channel < 1U || channel > 13U) return;
    const std::size_t at = static_cast<std::size_t>(channel - 1U);
    const auto& bin = snapshot.channels[at];
    const std::uint16_t next = bin.measured ? bin.busyPermille : 0U;
    const std::uint16_t nextAverage =
        bin.measured ? bin.averageBusyPermille : 0U;
    const std::uint16_t previous = wifiChannelRenderedLoads[at];
    const std::uint16_t previousAverage = wifiChannelRenderedAverages[at];
    if (!force && previous == next && previousAverage == nextAverage) return;
    const std::int16_t x = kWifiChannelBarX +
        static_cast<std::int16_t>(at) * kWifiChannelBarStep;
    const std::int16_t nextHeight = wifiChannelBarHeight(next);
    const std::int16_t nextAverageHeight = wifiChannelBarHeight(nextAverage);
    const std::int16_t previousHeight = previous == 0xffffU
        ? 0 : wifiChannelBarHeight(previous);
    const std::int16_t previousAverageHeight = previousAverage == 0xffffU
        ? 0 : wifiChannelBarHeight(previousAverage);
    const std::int16_t clearHeight = force ? kWifiChannelGraphHeight
        : std::max(std::max(previousHeight, previousAverageHeight),
                   std::max(nextHeight, nextAverageHeight));
    if (clearHeight > 0) {
        display.fillRect(x, kWifiChannelGraphBottom - clearHeight,
                         kWifiChannelBarWidth, clearHeight,
                         kWifiChannelGraphBackground);
    }
    if (nextAverageHeight > 0) {
        display.fillRect(x, kWifiChannelGraphBottom - nextAverageHeight,
                         kWifiChannelBarWidth, nextAverageHeight,
                         kWifiChannelAverageTone);
    }
    if (nextHeight > 0) {
        const std::int16_t currentX = x +
            (kWifiChannelBarWidth - kWifiChannelCurrentBarWidth) / 2;
        display.fillRect(currentX, kWifiChannelGraphBottom - nextHeight,
                         kWifiChannelCurrentBarWidth, nextHeight,
                         wifiChannelBarTone(next));
    }
    wifiChannelRenderedLoads[at] = next;
    wifiChannelRenderedAverages[at] = nextAverage;
}

void renderWifiChannelsData(bool full) {
    const auto stats = wifiFrameCapture.channelMonitorStats();
    const WifiChannelLoadSnapshot snapshot =
        wifiFrameCapture.channelLoadSnapshot();
    if (full) {
        display.fillRect(0, kWifiChannelGraphY, Layout::ScreenWidth,
                         kWifiChannelGraphHeight,
                         kWifiChannelGraphBackground);
        const std::uint16_t grid =
            leshy1::ui::visual::rgb565(22, 36, 32);
        for (std::uint8_t division = 1U; division < 4U; ++division) {
            const std::int16_t y = kWifiChannelGraphY +
                kWifiChannelGraphHeight * division / 4;
            display.drawFastHLine(0, y, Layout::ScreenWidth, grid);
        }
        for (std::uint8_t channel = 1U; channel <= 13U; ++channel) {
            renderWifiChannelAxisLabel(channel, Palette::TextMuted);
        }
    }
    renderWifiChannelInfo(snapshot, full);
    for (std::uint8_t channel = 1U; channel <= 13U; ++channel) {
        renderWifiChannelBar(channel, snapshot, full);
    }
    if (full && !stats.active) {
        display.fillRect(4, kWifiChannelGraphY + 70,
                         Layout::ScreenWidth - 8, 24,
                         kWifiChannelGraphBackground);
        display.setTextColor(Palette::Danger,
                             kWifiChannelGraphBackground);
        setUiCursor(UiTextRole::Meta, 14, kWifiChannelGraphY + 75);
        display.print(tr(UiTextId::WifiChannelsFailed));
    }
}

