anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void renderWifiChannels(bool clearContent) {
    renderHeader(tr(UiTextId::WifiChannelsTitle), clearContent);
    renderWifiChannelsData(true);
}

UiTextId surveyFilterLabel(SurveyFilter filter) {
    switch (filter) {
        case SurveyFilter::Wifi: return UiTextId::FilterWifi;
        case SurveyFilter::Ble: return UiTextId::FilterBle;
        case SurveyFilter::All:
        default: return UiTextId::FilterAll;
    }
}

UiTextId surveyFilterBarFormat(SurveyFilter filter) {
    switch (filter) {
        case SurveyFilter::Wifi: return UiTextId::FilterBarWifiFormat;
        case SurveyFilter::Ble: return UiTextId::FilterBarBleFormat;
        case SurveyFilter::All:
        default: return UiTextId::FilterBarAllFormat;
    }
}

void renderSurveyFilterBar() {
    const bool selected = surveyController.filterFocused();
    const std::uint16_t background = selected ? Palette::SurfaceFocus
                                               : Palette::Surface;
    display.fillRoundRect(Layout::Edge, kSurveyFilterY, Layout::ContentWidth, 26,
                          Layout::Radius, background);
    renderFocusCue({Layout::Edge, kSurveyFilterY, Layout::ContentWidth, 26},
                   selected);
    display.setTextColor(selected ? Palette::Focus : Palette::TextSecondary,
                         background);
    char line[64] = {};
    std::snprintf(line, sizeof(line), tr(surveyFilterBarFormat(
                      surveyController.filter())),
                  static_cast<unsigned>(surveyController.visibleSize()));
    setUiCursor(UiTextRole::Body,
                Layout::Edge + kInteractiveRowTextInset,
                kSurveyFilterY + 3);
    display.print(line);
}

void renderSurveyFilterOption(std::uint8_t index) {
    if (index > static_cast<std::uint8_t>(SurveyFilter::Ble)) return;
    const SurveyFilter filter = static_cast<SurveyFilter>(index);
    char note[48] = {};
    std::snprintf(note, sizeof(note), tr(UiTextId::FilterCountFormat),
                  static_cast<unsigned>(surveyController.filterCount(filter)));
    renderMenuRow(Components::choiceRow(index), tr(surveyFilterLabel(filter)),
                  note, surveyController.draftFilter() == filter, true,
                  filter == surveyController.filter() ? Tone::Positive
                                                       : Tone::Neutral);
}

void renderRssiHistory(const ObservationHistory& history) {
    if (!history.valid || history.retainedSamples == 0) return;
    char line[64] = {};
    std::snprintf(line, sizeof(line), tr(UiTextId::SignalRangeFormat),
                  static_cast<int>(history.minimumRssiDbm),
                  static_cast<int>(history.maximumRssiDbm));
    display.setTextColor(Palette::Positive, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 199);
    display.print(line);

    constexpr std::int16_t x = 136;
    constexpr std::int16_t y = 187;
    constexpr std::int16_t width = 90;
    constexpr std::int16_t height = 35;
    display.drawRoundRect(x, y, width, height, Layout::Radius, Palette::Divider);
    const auto pointY = [&](std::int16_t rssi) {
        const std::int16_t bounded = rssi < -100 ? -100 : (rssi > -20 ? -20 : rssi);
        return static_cast<std::int16_t>(
            y + height - 3 - ((bounded + 100) * (height - 6)) / 80);
    };
    if (history.retainedSamples == 1) {
        display.fillCircle(x + width / 2, pointY(history.samples[0]), 2,
                           Palette::Focus);
        return;
    }
    for (std::uint8_t index = 1; index < history.retainedSamples; ++index) {
        const std::int16_t previousX = static_cast<std::int16_t>(
            x + 3 + ((index - 1U) * (width - 6)) /
                        (history.retainedSamples - 1U));
        const std::int16_t currentX = static_cast<std::int16_t>(
            x + 3 + (index * (width - 6)) /
                        (history.retainedSamples - 1U));
        display.drawLine(previousX, pointY(history.samples[index - 1U]),
                         currentX, pointY(history.samples[index]),
                         Palette::Focus);
    }
}

UiTextId surveySourceLabel(const SurveySourceOption& source) {
    return source.kind == SurveySourceKind::Wifi
        ? UiTextId::SourceWifiRow : UiTextId::SourceBleRow;
}

UiTextId surveySourceNote(const SurveySourceOption& source) {
    if (source.state == SurveySourceState::Available) {
        return source.selected ? UiTextId::SourceOnReady
                               : UiTextId::SourceOffReady;
    }
    if (source.state == SurveySourceState::Conflicted) {
        return UiTextId::SourceConflicted;
    }
    if (source.state == SurveySourceState::Fault) {
        return UiTextId::SourceFault;
    }
    return UiTextId::SourceDriverPending;
}

Rect surveyPlanRowBounds(std::uint8_t index) {
    return Components::choiceRow(index);
}

void renderSurveyPlanRow(std::uint8_t index) {
    if (index >= surveySourceController.planItemCount()) return;
    char note[48] = {};
    const bool selected = surveySourceController.selection() == index;
    if (surveySourceController.scope() != SurveySourceScope::All) {
        const bool wifi = surveySourceController.scope() ==
                          SurveySourceScope::WifiOnly;
        const bool ready = surveySourceController.canStart();
        renderMenuRow(surveyPlanRowBounds(index),
                      tr(wifi ? UiTextId::WifiScanStart
                              : UiTextId::BleScanStart),
                      tr(ready ? UiTextId::StartReady
                               : UiTextId::StartNeedsSource),
                      selected, ready,
                      ready ? Tone::Positive : Tone::Warning);
        return;
    }
    if (index == 0) {
        if (surveySourceController.simulatedPreview() &&
            surveySourceController.selectedCount() == 0) {
            std::snprintf(note, sizeof(note), "%s", tr(UiTextId::SourcesPreview));
        } else {
            std::snprintf(note, sizeof(note), tr(UiTextId::SourcesCountFormat),
                          static_cast<unsigned>(
                              surveySourceController.selectedCount()),
                          static_cast<unsigned>(
                              SurveySourceController::kSourceCount));
        }
        renderMenuRow(surveyPlanRowBounds(index), tr(UiTextId::PlanSources),
                      note, selected, true, Tone::Positive);
        return;
    }
    if (index == 1) {
        if (wifiProductView == WifiProductView::Visit) {
            const bool previous = fieldSurveyTracker.comparePrevious();
            const bool available = fieldSurveyTracker.previousAvailable();
            renderMenuRow(
                surveyPlanRowBounds(index), tr(UiTextId::FieldSurveyCompare),
                tr(previous ? UiTextId::FieldSurveyPrevious
                            : UiTextId::FieldSurveyFirst),
                selected, available,
                previous ? Tone::Positive : Tone::Muted);
            return;
        }
        const bool available = BoardProfile::kRfShieldDeclared &&
            !BoardProfile::kGpsDeclared && !BoardProfile::kPn532Declared;
        renderMenuRow(surveyPlanRowBounds(index), tr(UiTextId::PlanSpectrum),
                      tr(available ? UiTextId::SpectrumReady
                                   : UiTextId::SpectrumUnavailable),
                      selected, available,
                      available ? Tone::Positive : Tone::Warning);
        return;
    }
    const bool preparing =
        std::strcmp(productSurveyRuntime.status, "preparing") == 0;
    const bool cancelling =
        std::strcmp(productSurveyRuntime.status, "cancelling") == 0;
    const bool ready = surveySourceController.canStart() &&
                       !preparing && !cancelling;
    const UiTextId startNote = preparing
        ? UiTextId::StartPreparing
        : (cancelling
               ? UiTextId::StartCancelling
               : (!ready
                      ? UiTextId::StartNeedsSource
                      : (surveySourceController.simulatedPreview()
                             ? UiTextId::StartPreview
                             : UiTextId::StartReady)));
    renderMenuRow(surveyPlanRowBounds(index), tr(UiTextId::PlanStart),
                  tr(startNote), selected, ready,
                  ready ? Tone::Positive : Tone::Warning);
}

void renderSurveySourceRow(std::uint8_t index) {
    const SurveySourceOption* source = surveySourceController.get(index);
    if (source == nullptr) return;
    const bool selected = surveySourceController.selection() == index;
    renderMenuRow(Components::choiceRow(index), tr(surveySourceLabel(*source)),
                  tr(surveySourceNote(*source)), selected,
                  source->available(),
                  source->selected ? Tone::Positive : Tone::Muted);
}

