anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
constexpr std::uint8_t kWifiProductTaskCount = 5;

UiTextId wifiProductLabel(std::uint8_t index) {
    constexpr UiTextId labels[kWifiProductTaskCount] = {
        UiTextId::WifiMenuNetworks,
        UiTextId::WifiMenuDevices,
        UiTextId::WifiMenuChannels,
        UiTextId::WifiMenuVisit,
        UiTextId::WifiMenuAirspaceGuard,
    };
    return labels[index < kWifiProductTaskCount ? index : 0];
}

UiTextId wifiProductNote(std::uint8_t index) {
    constexpr UiTextId notes[kWifiProductTaskCount] = {
        UiTextId::WifiMenuNetworksNote,
        UiTextId::WifiMenuDevicesNote,
        UiTextId::WifiMenuChannelsNote,
        UiTextId::WifiMenuVisitNote,
        UiTextId::WifiMenuAirspaceGuardNote,
    };
    return notes[index < kWifiProductTaskCount ? index : 0];
}

bool wifiProductTaskReady(std::uint8_t index) {
    // Functions are admitted one at a time. The menu stays truthful while the
    // remaining radio workflows are being implemented and measured.
    return index < kWifiProductTaskCount;
}

std::uint8_t wifiProductFirstVisible(std::uint8_t selection) {
    return homeFirstVisible(selection);
}

void renderWifiProductRow(std::uint8_t index, std::uint8_t firstVisible) {
    if (index >= kWifiProductTaskCount || index < firstVisible ||
        index >= firstVisible + kVisibleHomeRows) return;
    const bool ready = wifiProductTaskReady(index);
    renderMenuRow(Components::homeRow(index - firstVisible),
                  tr(wifiProductLabel(index)),
                  tr(ready ? wifiProductNote(index) : UiTextId::WifiMenuNext),
                  wifiProductSelection == index, ready,
                  ready ? Tone::Positive : Tone::Muted);
}

void renderWifiProductMenu(bool clearContent) {
    renderHeader(tr(UiTextId::WifiMenuTitle), clearContent);
    const std::uint8_t first = wifiProductFirstVisible(wifiProductSelection);
    const std::uint8_t end = static_cast<std::uint8_t>(
        std::min<std::size_t>(kWifiProductTaskCount,
                              first + kVisibleHomeRows));
    for (std::uint8_t index = first; index < end; ++index) {
        renderWifiProductRow(index, first);
    }
}

Tone airspaceGuardTone(AirspaceGuardUiTone tone) {
    switch (tone) {
        case AirspaceGuardUiTone::Healthy: return Tone::Positive;
        case AirspaceGuardUiTone::Caution: return Tone::Warning;
        case AirspaceGuardUiTone::Finding:
        case AirspaceGuardUiTone::Error: return Tone::Danger;
        case AirspaceGuardUiTone::Neutral:
        default: return Tone::Neutral;
    }
}

Rect airspaceGuardRowBounds(std::uint8_t row) {
    constexpr std::int16_t kTop = 88;
    constexpr std::int16_t kHeight = 44;
    constexpr std::int16_t kGap = 5;
    return {Layout::Edge,
            static_cast<std::int16_t>(kTop + row * (kHeight + kGap)),
            Layout::ContentWidth, kHeight};
}

void renderAirspaceGuardRow(const AirspaceGuardUiModel& model,
                            std::uint8_t row) {
    const Rect bounds = airspaceGuardRowBounds(row);
    const bool visible = row < model.rowCount;
    if (!visible) {
        display.fillRect(bounds.x, bounds.y, bounds.width, bounds.height,
                         Palette::Canvas);
        return;
    }
    const bool selected = visible && model.rows[row].selected;
    const std::uint16_t background = selected ? Palette::SurfaceFocus
                                              : Palette::Surface;
    display.fillRoundRect(bounds.x, bounds.y, bounds.width, bounds.height,
                          Layout::Radius, background);
    renderFocusCue(bounds, selected);
    display.setTextColor(selected ? Palette::Focus : Palette::TextSecondary,
                         background);
    const std::int16_t top = static_cast<std::int16_t>(
        bounds.y + (bounds.height - kRobotoCondensedBodyAscent -
                    kRobotoCondensedBodyDescent) / 2);
    setUiCursor(UiTextRole::Body, bounds.x + kInteractiveRowTextInset, top);
    display.print(model.rows[row].text.data());
}

void renderAirspaceGuardPage(bool clearContent, bool liveDataOnly = false) {
    AirspaceGuardUiModel model{};
    if (airspaceGuardCaptureState ==
        AirspaceGuardCaptureState::WifiRunning) {
        model.headline = UiTextId::AirspaceGuardListening;
        model.note = UiTextId::AirspaceGuardPassiveOnly;
        model.tone = AirspaceGuardUiTone::Neutral;
        const auto capture = wifiFrameCapture.stats();
        const auto monitor = wifiFrameCapture.airspaceGuardMonitorStats();
        const std::uint64_t nowUs = static_cast<std::uint64_t>(
            esp_timer_get_time());
        const std::uint64_t deadlineUs = capture.startedUs +
            static_cast<std::uint64_t>(kAirspaceGuardCaptureDurationMs) *
                1000ULL;
        const std::uint64_t remainingTenths = nowUs < deadlineUs
            ? (deadlineUs - nowUs + 99999ULL) / 100000ULL : 0U;
        std::snprintf(model.context.data(), model.context.size(),
                      tr(UiTextId::AirspaceGuardChannelFormat),
                      static_cast<unsigned>(wifiFrameCapture.currentChannel()));
        std::snprintf(model.rows[0].text.data(), model.rows[0].text.size(),
                      tr(UiTextId::AirspaceGuardTimeFormat),
                      static_cast<unsigned>(remainingTenths / 10U),
                      static_cast<unsigned>(remainingTenths % 10U));
        std::snprintf(model.rows[1].text.data(), model.rows[1].text.size(),
                      tr(UiTextId::AirspaceGuardSeenFormat),
                      static_cast<unsigned long>(monitor.framesReported));
        std::snprintf(
            model.rows[2].text.data(), model.rows[2].text.size(),
            tr(UiTextId::AirspaceGuardEvidenceKindsFormat),
            static_cast<unsigned long>(monitor.disconnectFramesRetained),
            static_cast<unsigned long>(monitor.identityProfilesRetained));
        std::snprintf(model.rows[3].text.data(), model.rows[3].text.size(),
                      tr(UiTextId::AirspaceGuardRetainedFormat),
                      static_cast<unsigned long>(monitor.framesRetained));
        model.rowCount = model.rows.size();
    } else if (airspaceGuardCaptureState ==
               AirspaceGuardCaptureState::BleRunning) {
        model.headline = UiTextId::AirspaceGuardBleListening;
        model.note = UiTextId::AirspaceGuardPassiveOnly;
        model.tone = AirspaceGuardUiTone::Neutral;
        const std::uint64_t nowUs = static_cast<std::uint64_t>(
            esp_timer_get_time());
        const std::uint64_t deadlineUs = airspaceGuardBleStartedUs +
            static_cast<std::uint64_t>(kAirspaceGuardCaptureDurationMs) *
                1000ULL;
        const std::uint64_t remainingTenths = nowUs < deadlineUs
            ? (deadlineUs - nowUs + 99999ULL) / 100000ULL : 0U;
        std::snprintf(model.context.data(), model.context.size(),
                      tr(UiTextId::AirspaceGuardStageFormat), 2U);
        std::snprintf(model.rows[0].text.data(), model.rows[0].text.size(),
                      tr(UiTextId::AirspaceGuardTimeFormat),
                      static_cast<unsigned>(remainingTenths / 10U),
                      static_cast<unsigned>(remainingTenths % 10U));
        std::snprintf(model.rows[1].text.data(), model.rows[1].text.size(),
                      "%s", tr(UiTextId::AirspaceGuardBlePurpose));
        std::snprintf(model.rows[2].text.data(), model.rows[2].text.size(),
                      "%s", tr(UiTextId::AirspaceGuardBleNoConnection));
        std::snprintf(model.rows[3].text.data(), model.rows[3].text.size(),
                      "%s", tr(UiTextId::AirspaceGuardResultAfterCleanup));
        model.rowCount = model.rows.size();
    } else {
        model = leshy1::ui::presentAirspaceGuard(
            airspaceGuardController, languageController.active());
        if (airspaceGuardCaptureState == AirspaceGuardCaptureState::Failed) {
            std::snprintf(model.context.data(), model.context.size(), "%s",
                          tr(UiTextId::AirspaceGuardCaptureFailed));
        }
    }
    if (airspaceGuardResultNeedsContentClear) {
        display.fillRect(Layout::Edge, Layout::ContentTop,
                         Layout::ContentWidth,
                         Layout::FooterDividerY - Layout::ContentTop,
                         Palette::Canvas);
        airspaceGuardResultNeedsContentClear = false;
    }
    if (!liveDataOnly) {
        renderHeader(tr(model.title), clearContent);
        display.fillRect(Layout::Edge, 28, Layout::ContentWidth, 56,
                         Palette::Canvas);
        display.setTextColor(toneColor(airspaceGuardTone(model.tone)),
                             Palette::Canvas);
        setUiCursor(UiTextRole::Body, Layout::Edge, 32);
        display.print(tr(model.headline));
        display.setTextColor(model.evidenceIncomplete ? Palette::Warning
                                                      : Palette::TextMuted,
                             Palette::Canvas);
        setUiCursor(UiTextRole::Meta, Layout::Edge, 54);
        display.print(tr(model.note));
    } else if (airspaceGuardCaptureState !=
               AirspaceGuardCaptureState::BleRunning) {
        // Live cadence repaints only the changing channel/counters. Header,
        // headline, passive note and footer remain untouched and cannot flash.
        display.fillRect(Layout::Edge, 67, Layout::ContentWidth, 17,
                         Palette::Canvas);
    }
    if (!liveDataOnly || airspaceGuardCaptureState !=
            AirspaceGuardCaptureState::BleRunning) {
        display.setTextColor(Palette::TextSecondary, Palette::Canvas);
        setUiCursor(UiTextRole::Meta, Layout::Edge, 70);
        display.print(model.context.data());
    }
    const std::uint8_t rowsToRender =
        liveDataOnly && airspaceGuardCaptureState ==
                            AirspaceGuardCaptureState::BleRunning
            ? 1U
            : AirspaceGuardUiModel::kVisibleRowCapacity;
    for (std::uint8_t row = 0; row < rowsToRender; ++row) {
        renderAirspaceGuardRow(model, row);
    }
}

void renderRfSpectrumSourceRow(std::uint8_t index) {
    if (index >= 2) return;
    const bool selected = rfSpectrumSelection == index;
    const bool available = BoardProfile::kRfShieldDeclared &&
        !BoardProfile::kGpsDeclared && !BoardProfile::kPn532Declared;
    renderMenuRow(Components::choiceRow(index),
                  tr(index == 0 ? UiTextId::SpectrumNrf24
                                : UiTextId::SpectrumCc1101),
                  tr(available ? UiTextId::SpectrumRxReady
                               : UiTextId::SpectrumUnavailable),
                  selected, available,
                  available ? Tone::Positive : Tone::Muted);
}

void renderRfSpectrumSourceMenu(bool clearContent) {
    renderHeader(tr(UiTextId::SpectrumSources), clearContent);
    renderRfSpectrumSourceRow(0);
    renderRfSpectrumSourceRow(1);
}

void renderNrf24ModeRow(std::uint8_t index, bool selected) {
    if (index >= 2U) return;
    renderMenuRow(
        Components::choiceRow(index),
        tr(index == 0U ? UiTextId::Nrf24Overview : UiTextId::Nrf24Finder),
        tr(index == 0U ? UiTextId::Nrf24OverviewNote
                       : UiTextId::Nrf24FinderNote),
        selected, true, Tone::Positive);
}

void renderNrf24ModeMenu(bool clearContent) {
    renderHeader(tr(UiTextId::Nrf24Modes), clearContent);
    renderNrf24ModeRow(0, nrf24ModeSelection == 0U);
    renderNrf24ModeRow(1, nrf24ModeSelection == 1U);
}

