anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void prepareWaterfallScanline(std::size_t row) {
    for (std::int16_t x = 0; x < Layout::ScreenWidth; ++x) {
        const std::uint8_t intensity = spectrumViewport.intensity(
            row, static_cast<std::size_t>(x));
        spectrumScanline[static_cast<std::size_t>(x)] =
            rfSpectrumKind == RfSpectrumKind::Nrf24
                ? wifiChannelGridTone(x, intensity)
                : spectrumTone(intensity);
    }
}

void renderWaterfallSlot(std::size_t row) {
    if (!spectrumViewport.rowValid(row)) return;
    prepareWaterfallScanline(row);
    const std::int16_t firstY = kSpectrumGraphY +
        static_cast<std::int32_t>(row) * kSpectrumGraphHeight /
            SpectrumViewport::kHistoryRows;
    const std::int16_t nextY = kSpectrumGraphY +
        static_cast<std::int32_t>(row + 1U) * kSpectrumGraphHeight /
            SpectrumViewport::kHistoryRows;
    for (std::int16_t y = firstY; y < nextY; ++y) {
        display.pushImage(0, y, Layout::ScreenWidth, 1,
                          spectrumScanline.data());
    }
}

void renderSpectrumWaterfall() {
    display.fillRect(0, kSpectrumGraphY, Layout::ScreenWidth,
                     kSpectrumGraphHeight, kSpectrumNoSignal);
    for (std::size_t row = 0; row < SpectrumViewport::kHistoryRows; ++row) {
        renderWaterfallSlot(row);
    }
}

void renderLatestWaterfallRow() {
    renderWaterfallSlot(spectrumViewport.latestRow());
}

void renderSpectrumBars(bool force = false) {
    const bool fullRender = force ||
        spectrumRenderedIntensity[0] == kSpectrumRenderedIntensityInvalid;
    if (fullRender) {
        display.fillRect(0, kSpectrumGraphY, Layout::ScreenWidth,
                         kSpectrumGraphHeight, Palette::Surface);
        spectrumRenderedIntensity.fill(kSpectrumRenderedIntensityInvalid);
    }
    const std::size_t bins = activeSpectrumBins();
    for (std::size_t bin = 0; bin < bins; ++bin) {
        spectrumIntensity[bin] = activeSpectrumIntensity(bin);
    }
    for (std::int16_t x = 0; x < Layout::ScreenWidth; ++x) {
        const std::uint8_t intensity = SpectrumViewport::resample(
            spectrumIntensity.data(), bins, static_cast<std::size_t>(x));
        const std::size_t column = static_cast<std::size_t>(x);
        const std::uint16_t previous = spectrumRenderedIntensity[column];
        if (previous == intensity) continue;

        const std::int16_t height = intensity == 0
            ? 1
            : static_cast<std::int16_t>(1 +
                  static_cast<std::uint32_t>(intensity) *
                      (kSpectrumGraphHeight - 1) / 255U);
        if (previous != kSpectrumRenderedIntensityInvalid) {
            const std::int16_t previousHeight = previous == 0
                ? 1
                : static_cast<std::int16_t>(1 +
                      static_cast<std::uint32_t>(previous) *
                          (kSpectrumGraphHeight - 1) / 255U);
            if (previousHeight > height) {
                display.drawFastVLine(
                    x, kSpectrumAxisY - previousHeight,
                    previousHeight - height, Palette::Surface);
            }
        }
        display.drawFastVLine(x, kSpectrumAxisY - height, height,
                              spectrumTone(intensity));
        spectrumRenderedIntensity[column] = intensity;
    }
}

void renderActiveSpectrumData() {
    if (spectrumViewport.mode() == SpectrumDisplayMode::Waterfall) {
        renderSpectrumWaterfall();
    } else {
        renderSpectrumBars(true);
    }
}

void renderSpectrumModeAtRight() {
    const char* mode = spectrumDisplayModeText();
    selectUiFont(UiTextRole::Meta);
    const std::int16_t width = display.textWidth(mode);
    display.setTextColor(Palette::Focus, Palette::Surface);
    setUiCursor(UiTextRole::Meta, Layout::ScreenWidth - 4 - width,
                kSpectrumOverlayY);
    display.print(mode);
}

void renderSpectrumLegend(UiTextId receiverState, Tone tone,
                          UiTextId quietId = UiTextId::SpectrumLegendQuiet,
                          UiTextId strongId = UiTextId::SpectrumLegendStrong,
                          UiTextId metricId = UiTextId::Count) {
    display.fillRect(0, kSpectrumOverlayY, Layout::ScreenWidth,
                     kSpectrumOverlayHeight, Palette::Surface);
    display.setTextColor(tone == Tone::Danger ? Palette::Danger
                                              : Palette::Positive,
                         Palette::Surface);
    setUiCursor(UiTextRole::Meta, 4, kSpectrumOverlayY);
    display.print(tr(receiverState));
    if (metricId != UiTextId::Count) {
        display.print(tr(UiTextId::SpectrumModeSeparator));
        display.print(tr(metricId));
    }
    renderSpectrumModeAtRight();

    constexpr std::int16_t kLegendGap = 5;
    constexpr std::int16_t kLegendTop = kSpectrumOverlayY + 14;
    constexpr std::int16_t kLegendBarTop = kLegendTop + 3;
    constexpr std::int16_t kLegendBarHeight = 7;
    const char* quiet = tr(quietId);
    const char* strong = tr(strongId);
    selectUiFont(UiTextRole::Meta);
    const std::int16_t quietWidth = display.textWidth(quiet);
    const std::int16_t strongWidth = display.textWidth(strong);
    const std::int16_t strongX = Layout::ScreenWidth - 4 - strongWidth;
    const std::int16_t barX = 4 + quietWidth + kLegendGap;
    const std::int16_t barWidth = strongX - kLegendGap - barX;
    display.setTextColor(Palette::TextSecondary, Palette::Surface);
    setUiCursor(UiTextRole::Meta, 4, kLegendTop);
    display.print(quiet);
    setUiCursor(UiTextRole::Meta, strongX, kLegendTop);
    display.print(strong);
    for (std::int16_t x = 0; x < barWidth; ++x) {
        const std::uint8_t intensity = static_cast<std::uint8_t>(
            static_cast<std::uint32_t>(x) * 255U /
            static_cast<std::uint32_t>(barWidth - 1));
        display.drawFastVLine(barX + x, kLegendBarTop, kLegendBarHeight,
                              spectrumTone(intensity));
    }
}

void renderNrf24SpectrumLegend() {
    const Nrf24SpectrumViewState state = nrf24SpectrumController.state();
    const bool traffic = nrf24SpectrumController.metric() ==
        Nrf24SpectrumMetric::Traffic;
    renderSpectrumLegend(
        state == Nrf24SpectrumViewState::Running
            ? UiTextId::SpectrumOverlayRunning
            : (state == Nrf24SpectrumViewState::Paused
                   ? UiTextId::SpectrumOverlayPaused : UiTextId::SpectrumFault),
        state == Nrf24SpectrumViewState::Fault ? Tone::Danger : Tone::Positive,
        traffic ? UiTextId::SpectrumLegendBaseline
                : UiTextId::SpectrumLegendQuiet,
        traffic ? UiTextId::SpectrumLegendBurst
                : UiTextId::SpectrumLegendStrong,
        traffic ? UiTextId::SpectrumMetricTraffic
                : UiTextId::SpectrumMetricSignal);
}

void renderNrf24SpectrumAxis() {
    display.fillRect(0, kSpectrumAxisY, Layout::ScreenWidth,
                     kSpectrumAxisHeight, Palette::Canvas);
    selectUiFont(UiTextRole::Meta);
    for (std::uint8_t channel = 1; channel <= 13; ++channel) {
        const std::int16_t centerX = wifiChannelCenterX(channel);
        const bool primary = channel == 1 || channel == 6 || channel == 11;
        display.drawFastVLine(centerX, kSpectrumAxisY, 2,
            primary ? kWifiPrimaryChannelDivider : kWifiChannelDivider);
        char label[3] = {};
        std::snprintf(label, sizeof(label), "%u",
                      static_cast<unsigned>(channel));
        const std::int16_t width = display.textWidth(label);
        display.setTextColor(primary ? Palette::Warning : Palette::TextMuted,
                             Palette::Canvas);
        setUiCursor(UiTextRole::Meta, centerX - width / 2,
                    kSpectrumAxisY + 2);
        display.print(label);
    }
}

void renderNrf24SpectrumPage(bool clearContent) {
    renderHeader(tr(UiTextId::SpectrumTitle), clearContent);
    renderActiveSpectrumData();
    renderNrf24SpectrumLegend();
    renderNrf24SpectrumAxis();
}

constexpr std::int16_t kNrfFinderInfoY = Layout::HeaderHeight;
constexpr std::int16_t kNrfFinderInfoHeight = 58;
constexpr std::int16_t kNrfFinderLegendY =
    kNrfFinderInfoY + kNrfFinderInfoHeight;
constexpr std::int16_t kNrfFinderLegendHeight = 15;
constexpr std::int16_t kNrfFinderAxisHeight = 15;
constexpr std::int16_t kNrfFinderAxisY =
    Layout::FooterDividerY - kNrfFinderAxisHeight;
constexpr std::int16_t kNrfFinderGraphY =
    kNrfFinderLegendY + kNrfFinderLegendHeight;
constexpr std::int16_t kNrfFinderGraphHeight =
    kNrfFinderAxisY - kNrfFinderGraphY;
static_assert(kNrfFinderGraphHeight > 160,
              "the signal finder graph must remain the dominant content");

void renderNrf24FinderResult(bool force) {
    const Nrf24SignalFinderState state = nrf24SignalFinder.state();
    const bool found = nrf24SignalFinder.found();
    const std::uint8_t channel = nrf24SignalFinder.strongestChannel();
    if (!force && state == nrf24FinderRenderedState &&
        found == nrf24FinderRenderedFound &&
        (!found || channel == nrf24FinderRenderedChannel)) {
        return;
    }
    display.fillRect(0, kNrfFinderInfoY, Layout::ScreenWidth,
                     kNrfFinderInfoHeight, Palette::Canvas);
    char line[48] = {};
    if (state == Nrf24SignalFinderState::Fault) {
        display.setTextColor(Palette::Danger, Palette::Canvas);
        setUiCursor(UiTextRole::Body, 8, kNrfFinderInfoY + 12);
        display.print(tr(UiTextId::Nrf24FinderFault));
    } else if (state == Nrf24SignalFinderState::Calibrating) {
        display.setTextColor(Palette::TextPrimary, Palette::Canvas);
        setUiCursor(UiTextRole::Body, 8, kNrfFinderInfoY + 6);
        display.print(tr(UiTextId::Nrf24FinderCalibrating));
        display.setTextColor(Palette::TextSecondary, Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 8, kNrfFinderInfoY + 32);
        display.print(tr(UiTextId::Nrf24FinderCalibratingNote));
    } else if (!found) {
        display.setTextColor(Palette::TextPrimary, Palette::Canvas);
        setUiCursor(UiTextRole::Body, 8, kNrfFinderInfoY + 6);
        display.print(tr(UiTextId::Nrf24FinderWaiting));
        display.setTextColor(Palette::TextSecondary, Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 8, kNrfFinderInfoY + 32);
        display.print(tr(UiTextId::Nrf24FinderWaitingNote));
    } else {
        display.setTextColor(Palette::Positive, Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 8, kNrfFinderInfoY + 1);
        display.print(tr(UiTextId::Nrf24FinderFound));
        std::snprintf(line, sizeof(line),
                      tr(UiTextId::Nrf24FinderFrequencyFormat),
                      static_cast<unsigned>(
                          nrf24SignalFinder.strongestFrequencyMhz()));
        display.setTextColor(Palette::TextPrimary, Palette::Canvas);
        setUiCursor(UiTextRole::Body, 8, kNrfFinderInfoY + 19);
        display.print(line);
        const std::uint8_t wifi = nrf24SignalFinder.nearestWifiChannel();
        if (wifi != 0U) {
            std::snprintf(line, sizeof(line),
                          tr(UiTextId::Nrf24FinderWifiFormat),
                          static_cast<unsigned>(wifi));
            display.setTextColor(Palette::TextSecondary, Palette::Canvas);
            setUiCursor(UiTextRole::Meta, 112, kNrfFinderInfoY + 23);
            display.print(line);
        }
    }
    nrf24FinderRenderedState = state;
    nrf24FinderRenderedFound = found;
    nrf24FinderRenderedChannel = channel;
}

void renderNrf24FinderGraph(bool force) {
    if (force) {
        display.fillRect(0, kNrfFinderGraphY, Layout::ScreenWidth,
                         kNrfFinderGraphHeight, kSpectrumNoSignal);
        nrf24FinderRenderedHeights.fill(0);
    }
    for (std::int16_t x = 0; x < Layout::ScreenWidth; ++x) {
        const std::size_t source =
            static_cast<std::size_t>(x) * Nrf24SignalFinder::kChannelCount /
            Layout::ScreenWidth;
        const std::uint8_t strength = nrf24SignalFinder.strength(source);
        const std::int16_t height = static_cast<std::int16_t>(
            (strength < Nrf24SignalFinder::kGraphFullScale
                 ? strength : Nrf24SignalFinder::kGraphFullScale) *
            kNrfFinderGraphHeight /
            Nrf24SignalFinder::kGraphFullScale);
        const std::int16_t previous =
            nrf24FinderRenderedHeights[static_cast<std::size_t>(x)];
        if (height < previous) {
            display.drawFastVLine(
                x, kNrfFinderAxisY - previous, previous - height,
                kSpectrumNoSignal);
        } else if (height > previous) {
            display.drawFastVLine(
                x, kNrfFinderAxisY - height, height - previous,
                strength >= Nrf24SignalFinder::kDetectionRise
                    ? Palette::Positive : Palette::TextMuted);
        }
        nrf24FinderRenderedHeights[static_cast<std::size_t>(x)] = height;
    }
    nrf24FinderRenderedRevision = nrf24SignalFinder.revision();
}

void renderNrf24FinderAxis() {
    display.fillRect(0, kNrfFinderLegendY, Layout::ScreenWidth,
                     kNrfFinderLegendHeight, Palette::Surface);
    display.setTextColor(Palette::TextSecondary, Palette::Surface);
    setUiCursor(UiTextRole::Meta, 4, kNrfFinderLegendY + 1);
    display.print(tr(UiTextId::Nrf24FinderResponse));

    display.fillRect(0, kNrfFinderAxisY, Layout::ScreenWidth,
                     kNrfFinderAxisHeight, Palette::Canvas);
    constexpr const char* first = "2402";
    constexpr const char* middle = "2442";
    constexpr const char* last = "2484";
    selectUiFont(UiTextRole::Meta);
    display.setTextColor(Palette::TextMuted, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 2, kNrfFinderAxisY + 1);
    display.print(first);
    setUiCursor(UiTextRole::Meta,
                Layout::ScreenWidth / 2 - display.textWidth(middle) / 2,
                kNrfFinderAxisY + 1);
    display.print(middle);
    setUiCursor(UiTextRole::Meta,
                Layout::ScreenWidth - 2 - display.textWidth(last),
                kNrfFinderAxisY + 1);
    display.print(last);
}

