anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void renderCc1101SpectrumLegend() {
    const Cc1101SpectrumViewState state = cc1101SpectrumController.state();
    renderSpectrumLegend(
        state == Cc1101SpectrumViewState::Running
            ? UiTextId::CcSpectrumOverlayRunning
            : (state == Cc1101SpectrumViewState::Paused
                   ? UiTextId::CcSpectrumOverlayPaused : UiTextId::SpectrumFault),
        state == Cc1101SpectrumViewState::Fault ? Tone::Danger : Tone::Positive);
}

void renderCc1101SpectrumPage(bool clearContent) {
    renderHeader(tr(UiTextId::CcSpectrumTitle), clearContent);
    renderActiveSpectrumData();
    renderCc1101SpectrumLegend();
    renderCc1101SpectrumAxis();
}

WifiAuthenticationCaptureUiInput wifiAuthenticationCaptureUiInput() {
    WifiAuthenticationCaptureUiInput input{};
    input.synthetic = wifiAuthenticationSynthetic;
    const auto capture = activeWifiAuthenticationFrameCaptureStats();
    const auto ingress = activeWifiAuthenticationIngressStats();
    if (wifiAuthenticationProductState ==
        WifiAuthenticationProductState::WaitingForSurveyStop) {
        input.phase = wifiAuthenticationReturnAfterSurveyStop
            ? WifiAuthenticationCaptureUiPhase::Cancelling
            : WifiAuthenticationCaptureUiPhase::Preparing;
        input.cleanupComplete = false;
    } else if (wifiAuthenticationProductState ==
               WifiAuthenticationProductState::Running) {
        input.phase = WifiAuthenticationCaptureUiPhase::Running;
        input.progress.durationMs = kWifiAuthenticationCaptureDurationMs;
        input.progress.channel = wifiAuthenticationTarget.channel;
        if (capture.startedUs != 0U) {
            const std::uint64_t nowUs =
                static_cast<std::uint64_t>(esp_timer_get_time());
            const std::uint64_t elapsedMs = nowUs > capture.startedUs
                ? (nowUs - capture.startedUs) / 1000ULL : 0U;
            input.progress.elapsedMs = static_cast<std::uint32_t>(
                std::min<std::uint64_t>(
                    elapsedMs, kWifiAuthenticationCaptureDurationMs));
        }
        const std::uint64_t reported =
            static_cast<std::uint64_t>(ingress.candidates) +
            ingress.framesInvalid;
        input.progress.framesReported = reported <= UINT32_MAX
            ? static_cast<std::uint32_t>(reported) : UINT32_MAX;
        input.progress.candidateFrames = ingress.candidates;
        input.progress.framesAccepted = ingress.candidatesAccepted;
        input.progress.framesDroppedCapacity = ingress.candidatesDropped;
        input.progress.framesDroppedInvalid = ingress.framesInvalid;
        input.cleanupComplete = false;
    } else if (wifiAuthenticationProductState ==
               WifiAuthenticationProductState::Result) {
        input.phase = WifiAuthenticationCaptureUiPhase::Report;
        input.report = &activeWifiAuthenticationCaptureReport();
        input.controller = &activeWifiAuthenticationCaptureController();
        input.cleanupComplete =
            activeWifiAuthenticationCaptureCleanupComplete();
        if (!wifiAuthenticationSynthetic ||
            wifiAuthenticationPersistenceHil) {
            switch (wifiAuthenticationPersistState) {
                case CapturePersistState::Result:
                    input.persistence =
                        WifiAuthenticationCapturePersistence::Volatile;
                    break;
                case CapturePersistState::Confirm:
                    input.persistence =
                        WifiAuthenticationCapturePersistence::Confirm;
                    break;
                case CapturePersistState::Saving:
                    input.persistence =
                        WifiAuthenticationCapturePersistence::Saving;
                    break;
                case CapturePersistState::Saved:
                    input.persistence =
                        WifiAuthenticationCapturePersistence::Saved;
                    break;
                case CapturePersistState::Failed:
                    input.persistence =
                        WifiAuthenticationCapturePersistence::Failed;
                    break;
            }
            input.persistedGeneration = wifiAuthenticationPersistGeneration;
            input.persistedPcapReady = wifiAuthenticationPcapReady;
            input.persistedStandardReady =
                wifiAuthenticationStandardReady;
        }
    } else {
        input.phase = WifiAuthenticationCaptureUiPhase::Failed;
        input.failure = wifiAuthenticationFailure ==
                WifiAuthenticationCaptureUiFailure::None
            ? WifiAuthenticationCaptureUiFailure::InvalidPresentationInput
            : wifiAuthenticationFailure;
        input.cleanupComplete = wifiFrameCapture.cleanupComplete() &&
            ingress.cleanupComplete && !ingress.active;
    }
    return input;
}

Tone wifiAuthenticationUiTone(WifiAuthenticationCaptureUiTone tone) {
    switch (tone) {
        case WifiAuthenticationCaptureUiTone::Positive:
            return Tone::Positive;
        case WifiAuthenticationCaptureUiTone::Caution:
            return Tone::Warning;
        case WifiAuthenticationCaptureUiTone::Error:
            return Tone::Danger;
        case WifiAuthenticationCaptureUiTone::Neutral:
            return Tone::Neutral;
    }
    return Tone::Neutral;
}

const char* wifiAuthenticationUiViewName(
    leshy1::ui::WifiAuthenticationCaptureUiView view) {
    using View = leshy1::ui::WifiAuthenticationCaptureUiView;
    switch (view) {
        case View::Preparing: return "preparing";
        case View::Cancelling: return "cancelling";
        case View::Running: return "running";
        case View::Result: return "result";
        case View::Inconclusive: return "inconclusive";
        case View::Actions: return "actions";
        case View::PeerDetail: return "peer_detail";
        case View::EvidenceList: return "evidence_list";
        case View::EvidenceDetail: return "evidence_detail";
        case View::Failed: return "failed";
    }
    return "failed";
}

const char* wifiAuthenticationUiToneName(
    WifiAuthenticationCaptureUiTone tone) {
    switch (tone) {
        case WifiAuthenticationCaptureUiTone::Neutral: return "neutral";
        case WifiAuthenticationCaptureUiTone::Positive: return "positive";
        case WifiAuthenticationCaptureUiTone::Caution: return "caution";
        case WifiAuthenticationCaptureUiTone::Error: return "error";
    }
    return "error";
}

const char* wifiAuthenticationPresenterTitleSemantic(UiTextId title) {
    switch (title) {
        case UiTextId::CaptureResult: return "capture_result";
        case UiTextId::CaptureSaveConfirm: return "save_confirm";
        case UiTextId::CaptureSaving: return "saving";
        case UiTextId::CaptureSaved: return "saved";
        case UiTextId::CaptureSaveFailed: return "save_failed";
        case UiTextId::WifiAuthActionsHeadline:
            return "authentication_actions";
        case UiTextId::WifiAuthPeerTitle: return "authentication_peer";
        case UiTextId::WifiAuthEvidenceTitle:
            return "authentication_evidence";
        case UiTextId::WifiAuthEvidenceDetailTitle:
            return "authentication_evidence_detail";
        default: return "unknown";
    }
}

