anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
const char* wifiAuthenticationPresenterHeadlineSemantic(UiTextId headline) {
    switch (headline) {
        case UiTextId::WifiAuthFullHandshakeHeadline:
            return "full_handshake";
        case UiTextId::WifiAuthActionsHeadline:
            return "authentication_actions";
        case UiTextId::WifiAuthPeerHeadline:
            return "authentication_peer";
        case UiTextId::WifiAuthEvidenceHeadline:
            return "authentication_evidence";
        case UiTextId::WifiAuthEvidenceDetailHeadline:
            return "authentication_evidence_detail";
        default: return "unknown";
    }
}

const char* wifiAuthenticationPresenterNoteSemantic(UiTextId note) {
    switch (note) {
        case UiTextId::SimulatedData: return "simulated_data";
        case UiTextId::WifiAuthVolatileNote: return "volatile";
        case UiTextId::CaptureConfirmNote: return "save_confirmation";
        case UiTextId::CaptureSavingNote: return "saving";
        case UiTextId::WifiAuthSavedStandardNote:
            return "saved_pcap_hc22000";
        case UiTextId::WifiAuthSavedPcapNote: return "saved_pcap_only";
        case UiTextId::CaptureSaveFailedNote: return "save_failed";
        default: return "unknown";
    }
}

const char* wifiAuthenticationUiFailureName(
    WifiAuthenticationCaptureUiFailure failure) {
    switch (failure) {
        case WifiAuthenticationCaptureUiFailure::None: return "none";
        case WifiAuthenticationCaptureUiFailure::InvalidPresentationInput:
            return "invalid_presentation_input";
        case WifiAuthenticationCaptureUiFailure::StartFailed:
            return "start_failed";
        case WifiAuthenticationCaptureUiFailure::RuntimeFailed:
            return "runtime_failed";
        case WifiAuthenticationCaptureUiFailure::ResultBeforeCleanup:
            return "result_before_cleanup";
        case WifiAuthenticationCaptureUiFailure::ReportRejected:
            return "report_rejected";
    }
    return "invalid_presentation_input";
}

void formatWifiAuthenticationUiRow(
    const leshy1::ui::WifiAuthenticationCaptureUiRow& row,
    char* output, std::size_t capacity) {
    if (output == nullptr || capacity == 0U) return;
    switch (row.metric) {
        case WifiAuthenticationCaptureUiMetric::ChannelAndCandidateFrames:
        case WifiAuthenticationCaptureUiMetric::RetainedAndDroppedFrames:
        case WifiAuthenticationCaptureUiMetric::CompleteAndPartialPeers:
        case WifiAuthenticationCaptureUiMetric::PmkidsAndEapolFrames:
        case WifiAuthenticationCaptureUiMetric::EvidenceAndSourceFrames:
        case WifiAuthenticationCaptureUiMetric::LossAndRejectedFrames:
        case WifiAuthenticationCaptureUiMetric::PeerPosition:
            std::snprintf(output, capacity, tr(row.text),
                          static_cast<unsigned long>(row.primary),
                          static_cast<unsigned long>(row.secondary));
            return;
        case WifiAuthenticationCaptureUiMetric::TimeRemainingSeconds:
        case WifiAuthenticationCaptureUiMetric::PeerEvidenceCount:
            std::snprintf(output, capacity, tr(row.text),
                          static_cast<unsigned long>(row.primary));
            return;
        case WifiAuthenticationCaptureUiMetric::SelectedPeerMask:
        case WifiAuthenticationCaptureUiMetric::PeerMessageMask:
            std::snprintf(
                output, capacity, tr(row.text),
                (row.primary & 0x01U) != 0U ? '+' : '-',
                (row.primary & 0x02U) != 0U ? '+' : '-',
                (row.primary & 0x04U) != 0U ? '+' : '-',
                (row.primary & 0x08U) != 0U ? '+' : '-');
            return;
        case WifiAuthenticationCaptureUiMetric::EvidenceListRow: {
            const std::uint8_t channel = static_cast<std::uint8_t>(
                row.secondary & 0xffU);
            const std::int8_t signal = static_cast<std::int8_t>(
                (row.secondary >> 8U) & 0xffU);
            const auto message = static_cast<
                leshy1::services::auth::WifiEapolKeyMessage>(
                    (row.secondary >> 16U) & 0xffU);
            const bool pmkid = (row.secondary & (1UL << 24U)) != 0U;
            std::snprintf(
                output, capacity, tr(row.text),
                pmkid ? "PMKID" :
                    leshy1::services::auth::wifiEapolKeyMessageName(message),
                static_cast<unsigned long>(row.primary),
                static_cast<unsigned>(channel), static_cast<int>(signal));
            return;
        }
        case WifiAuthenticationCaptureUiMetric::EvidenceMessageAndFrame:
            std::snprintf(
                output, capacity, tr(row.text),
                row.exact != 0U ? "PMKID" :
                    leshy1::services::auth::wifiEapolKeyMessageName(
                        static_cast<
                            leshy1::services::auth::WifiEapolKeyMessage>(
                                row.secondary)),
                static_cast<unsigned long>(row.primary));
            return;
        case WifiAuthenticationCaptureUiMetric::EvidenceChannelAndSignal:
            std::snprintf(
                output, capacity, tr(row.text),
                static_cast<unsigned long>(row.primary),
                static_cast<long>(static_cast<std::int32_t>(row.secondary)));
            return;
        case WifiAuthenticationCaptureUiMetric::EvidenceReplayCounter:
            std::snprintf(output, capacity, tr(row.text),
                          static_cast<unsigned long long>(row.exact));
            return;
        case WifiAuthenticationCaptureUiMetric::EvidenceDescriptor:
            std::snprintf(output, capacity, tr(row.text),
                          static_cast<unsigned long>(row.primary),
                          static_cast<unsigned long>(row.secondary),
                          static_cast<unsigned long long>(row.exact));
            return;
        case WifiAuthenticationCaptureUiMetric::TerminalAnalysisPending:
        case WifiAuthenticationCaptureUiMetric::ActionDetails:
        case WifiAuthenticationCaptureUiMetric::ActionSave:
        case WifiAuthenticationCaptureUiMetric::ActionRepeat:
        case WifiAuthenticationCaptureUiMetric::PeerState:
        case WifiAuthenticationCaptureUiMetric::UncertaintyMask:
        case WifiAuthenticationCaptureUiMetric::FailureCode:
        case WifiAuthenticationCaptureUiMetric::None:
            std::snprintf(output, capacity, "%s", tr(row.text));
            return;
    }
}

