anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void renderWifiAuthenticationHeaderRegions(
    const WifiAuthenticationCaptureUiModel& model) {
    const Rect title = Components::title();
    display.fillRect(title.x, title.y, title.width, title.height,
                     Palette::Header);
    display.setTextColor(toneColor(wifiAuthenticationUiTone(model.tone)),
                         Palette::Header);
    setUiCursor(UiTextRole::Meta, title.x, title.y);
    display.print(tr(model.title));

    const Rect header = Components::header();
    const std::int16_t statusX = title.x + title.width;
    display.fillRect(statusX, header.y,
                     header.width - statusX, header.height,
                     Palette::Header);
    renderHeaderStatus();
}

void renderWifiAuthenticationTarget() {
    constexpr Rect target{Layout::Edge, Layout::HeaderHeight + 3,
                          Layout::ContentWidth, 16};
    display.fillRect(target.x, target.y, target.width, target.height,
                     Palette::Canvas);
    char line[48] = {};
    std::snprintf(line, sizeof(line),
                  tr(UiTextId::WifiAuthSelectedTargetFormat),
                  static_cast<unsigned>(wifiAuthenticationTarget.channel));
    display.setTextColor(Palette::TextMuted, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, target.x + 2, target.y);
    display.print(line);
}

void renderWifiAuthenticationFixedRow(std::uint8_t index,
                                      const char* text, Tone tone,
                                      UiTextRole role,
                                      bool selected = false) {
    const Rect bounds = Components::metricRow(index);
    const std::uint16_t background = selected ? Palette::SurfaceFocus
                                               : Palette::Canvas;
    display.fillRect(bounds.x, bounds.y, bounds.width, bounds.height,
                     background);
    renderFocusCue(bounds, selected);
    const std::int16_t textHeight = role == UiTextRole::Body
        ? kRobotoCondensedBodyAscent + kRobotoCondensedBodyDescent
        : kRobotoCondensedMetaAscent + kRobotoCondensedMetaDescent;
    display.setTextColor(selected ? Palette::Focus : toneColor(tone),
                         background);
    setUiCursor(role,
                bounds.x + (selected ? kInteractiveRowTextInset : 2),
                bounds.y + (bounds.height - textHeight) / 2);
    display.print(text);
}

void renderWifiAuthenticationCapture(bool clearContent) {
    const WifiAuthenticationCaptureUiModel model =
        leshy1::ui::presentWifiAuthenticationCapture(
            wifiAuthenticationCaptureUiInput());
    const auto delta = wifiAuthenticationRenderedModelValid && !clearContent
        ? leshy1::ui::diffWifiAuthenticationCaptureUi(
              wifiAuthenticationRenderedModel, model)
        : leshy1::ui::WifiAuthenticationCaptureUiDelta{
              static_cast<std::uint8_t>(
                  leshy1::ui::kWifiAuthenticationTitleRegion |
                  leshy1::ui::kWifiAuthenticationHeadlineRegion |
                  leshy1::ui::kWifiAuthenticationNoteRegion),
              0x0fU, false};
    if (clearContent) {
        renderHeader("", clearContent);
        renderWifiAuthenticationTarget();
        ++wifiAuthenticationFullRepaints;
    }
    if (clearContent ||
        (delta.fixedRegionMask &
         leshy1::ui::kWifiAuthenticationTitleRegion) != 0U) {
        renderWifiAuthenticationHeaderRegions(model);
        ++wifiAuthenticationChromeRepaints;
    }
    const std::uint8_t contentFixedRegions = static_cast<std::uint8_t>(
        leshy1::ui::kWifiAuthenticationHeadlineRegion |
        leshy1::ui::kWifiAuthenticationNoteRegion);
    if (clearContent || delta.rowMask != 0U ||
        (delta.fixedRegionMask & contentFixedRegions) != 0U) {
        ++wifiAuthenticationContentRepaints;
    }
    const Tone modelTone = wifiAuthenticationUiTone(model.tone);
    if (clearContent ||
        (delta.fixedRegionMask &
         leshy1::ui::kWifiAuthenticationHeadlineRegion) != 0U) {
        renderWifiAuthenticationFixedRow(
            0U, tr(model.headline), modelTone,
            uiTextSpec(model.headline).role);
    }
    for (std::size_t index = 0; index < model.rows.size(); ++index) {
        if (!clearContent &&
            (delta.rowMask & (1U << index)) == 0U) {
            continue;
        }
        const std::uint8_t displayRow =
            static_cast<std::uint8_t>(index + 1U);
        const Rect bounds = Components::metricRow(displayRow);
        if (index >= model.rowCount) {
            display.fillRect(bounds.x, bounds.y, bounds.width, bounds.height,
                             Palette::Canvas);
            continue;
        }
        char line[80] = {};
        formatWifiAuthenticationUiRow(model.rows[index], line,
                                      sizeof(line));
        renderWifiAuthenticationFixedRow(
            displayRow, line,
            model.rows[index].warning ? Tone::Warning : modelTone,
            uiTextSpec(model.rows[index].text).role,
            model.rows[index].selected);
    }
    if (clearContent ||
        (delta.fixedRegionMask &
         leshy1::ui::kWifiAuthenticationNoteRegion) != 0U) {
        renderWifiAuthenticationFixedRow(
            5U, tr(model.note),
            model.evidenceIncomplete ? Tone::Warning : Tone::Muted,
            uiTextSpec(model.note).role);
    }
    wifiAuthenticationRenderedModel = model;
    wifiAuthenticationRenderedModelValid = true;
}

void renderInventoryPage(bool clearContent) {
    char line[96] = {};
    if (bleProductView == BleProductView::InspectorGatt) {
        renderBleGattInspector(clearContent);
        return;
    }
    if (bleProductView == BleProductView::InspectorMenu) {
        renderBleInspectorModeMenu(clearContent);
        return;
    }
    if (bleProductView == BleProductView::InspectorRaw) {
        renderBleInspectorRaw(clearContent);
        return;
    }
    if (bleProductView == BleProductView::DeviceDetail) {
        renderBleDeviceDetail(clearContent);
        return;
    }
    if (bleProductView == BleProductView::Devices) {
        renderBleDevices(clearContent);
        return;
    }
    if (wifiProductView == WifiProductView::Menu) {
        renderWifiProductMenu(clearContent);
        return;
    }
    if (wifiProductView == WifiProductView::AirspaceGuard) {
        renderAirspaceGuardPage(clearContent);
        return;
    }
    if (wifiProductView == WifiProductView::AuthenticationCapture) {
        renderWifiAuthenticationCapture(clearContent);
        return;
    }
    if (wifiProductView == WifiProductView::NetworkDetail) {
        renderWifiNetworkDetail(clearContent);
        return;
    }
    if (wifiProductView == WifiProductView::DeviceDetail) {
        renderWifiDeviceDetail(clearContent);
        return;
    }
    if (wifiProductView == WifiProductView::Channels) {
        renderWifiChannels(clearContent);
        return;
    }
    if (wifiProductView == WifiProductView::Devices) {
        renderWifiDevices(clearContent);
        return;
    }
    if (rfSpectrumView == RfSpectrumView::SourceMenu) {
        renderRfSpectrumSourceMenu(clearContent);
        return;
    }
    if (rfSpectrumView == RfSpectrumView::Nrf24Menu) {
        renderNrf24ModeMenu(clearContent);
        return;
    }
    if (rfSpectrumView == RfSpectrumView::Nrf24Finder) {
        renderNrf24FinderPage(clearContent);
        return;
    }
    if (rfSpectrumView == RfSpectrumView::SubGhzMenu) {
        renderSubGhzModeMenu(clearContent);
        return;
    }
    if (rfSpectrumView == RfSpectrumView::CcFinder) {
        renderCcFinderPage(clearContent);
        return;
    }
    if (rfSpectrumView == RfSpectrumView::CcBandMenu) {
        renderRfCcBandMenu(clearContent);
        return;
    }
    if (rfSpectrumView == RfSpectrumView::SubGhzCaptureModeMenu) {
        renderSubGhzCaptureModeMenu(clearContent);
        return;
    }
    if (rfSpectrumView == RfSpectrumView::SubGhzCaptureBandMenu) {
        renderSubGhzCaptureBandMenu(clearContent);
        return;
    }
    if (rfSpectrumView == RfSpectrumView::SubGhzCaptureLive) {
        renderSubGhzRawCapturePage(clearContent);
        return;
    }
    if (rfSpectrumView == RfSpectrumView::Live) {
        if (rfSpectrumKind == RfSpectrumKind::Cc1101) {
            renderCc1101SpectrumPage(clearContent);
        } else {
            renderNrf24SpectrumPage(clearContent);
        }
        return;
    }
    if (wifiProductView == WifiProductView::Networks &&
        surveyWorkflow.state() == SurveyWorkflowState::Setup &&
        std::strcmp(productSurveyRuntime.status, "preparing") == 0) {
        renderHeader(tr(UiTextId::WifiMenuNetworks), clearContent);
        renderMetric(0, tr(UiTextId::SurveySearchWifi), Tone::Positive);
        return;
    }
    if (wifiProductView == WifiProductView::Networks &&
        surveyWorkflow.state() == SurveyWorkflowState::Running) {
        renderWifiNetworks(clearContent);
        return;
    }
    if (productSurveySourceUnavailableVisible()) {
        renderHeader(tr(UiTextId::SurveyUnavailable), clearContent);
        display.setTextColor(Palette::Danger, Palette::Canvas);
        setUiCursor(UiTextRole::Body, 14, 82);
        display.print(tr(UiTextId::SourceUnavailableReason));
        display.setTextColor(Palette::TextSecondary, Palette::Canvas);
        setUiCursor(UiTextRole::Body, 14, 116);
        display.print(tr(UiTextId::NoSessionCreated));
        setUiCursor(UiTextRole::Body, 14, 150);
        display.print(tr(UiTextId::PriorLibraryPreserved));
        display.setTextColor(Palette::Positive, Palette::Canvas);
        setUiCursor(UiTextRole::Meta, 14, 207);
        display.print(tr(UiTextId::BackNoRetry));
        return;
    }
    if (surveyWorkflow.state() == SurveyWorkflowState::Setup) {
        if (surveySourceController.view() == SurveySetupView::Sources) {
            renderHeader(tr(UiTextId::SurveySources), clearContent);
            for (std::uint8_t index = 0;
                 index < SurveySourceController::kSourceCount; ++index) {
                renderSurveySourceRow(index);
            }
        } else {
            const UiTextId title = wifiProductView == WifiProductView::Visit
                ? UiTextId::FieldSurveyTitle
                : surveySourceController.scope() ==
                    SurveySourceScope::WifiOnly
                ? UiTextId::WifiScanSetup
                : (surveySourceController.scope() ==
                           SurveySourceScope::BleOnly
                       ? UiTextId::BleScanSetup
                       : UiTextId::SurveySetup);
            renderHeader(tr(title), clearContent);
            for (std::uint8_t index = 0;
                 index < surveySourceController.planItemCount(); ++index) {
                renderSurveyPlanRow(index);
            }
        }
        if (surveySourceController.view() == SurveySetupView::Sources) {
            display.setTextColor(Palette::Positive, Palette::Canvas);
            setUiCursor(UiTextRole::Meta, 14, 207);
            display.print(tr(UiTextId::SurveyChooseSources));
        }
        return;
    }
    if (surveyWorkflow.state() == SurveyWorkflowState::Result) {
        if (wifiProductView == WifiProductView::Visit) {
            const auto& result = fieldSurveyTracker.result();
            renderHeader(tr(UiTextId::FieldSurveyResult), clearContent);
            if (result.status == FieldSurveyVisitStatus::Incomplete ||
                result.status == FieldSurveyVisitStatus::Empty) {
                renderMetric(0, tr(UiTextId::FieldSurveyIncomplete),
                             Tone::Danger);
                renderMetric(1, tr(UiTextId::FieldSurveyNoComparison),
                             Tone::Warning);
                renderMetric(2, tr(UiTextId::SurveyResultsSaved),
                             Tone::Positive);
                return;
            }
            if (result.status == FieldSurveyVisitStatus::Compared) {
                std::snprintf(
                    line, sizeof(line),
                    tr(UiTextId::FieldSurveyNewSeenFormat),
                    static_cast<unsigned>(result.newThisVisit),
                    static_cast<unsigned>(result.seenAgain));
                renderMetric(0, line, Tone::Positive);
                std::snprintf(
                    line, sizeof(line),
                    tr(UiTextId::FieldSurveyMissingFormat),
                    static_cast<unsigned>(result.missingThisVisit));
                renderMetric(1, line,
                             result.missingThisVisit == 0U
                                 ? Tone::Neutral : Tone::Warning);
            } else {
                std::snprintf(
                    line, sizeof(line),
                    tr(UiTextId::FieldSurveyUniqueFormat),
                    static_cast<unsigned>(result.currentUnique));
                renderMetric(0, line, Tone::Positive);
                renderMetric(1, tr(UiTextId::FieldSurveyBaselineSaved));
            }
            std::snprintf(
                line, sizeof(line), tr(UiTextId::FieldSurveyRadioFormat),
                static_cast<unsigned>(result.wifiAccessPoints +
                                      result.wifiStations),
                static_cast<unsigned>(result.bleDevices));
            renderMetric(2, line);
            renderMetric(3, tr(UiTextId::SurveyResultsSaved),
                         Tone::Positive);
            return;
        }
        renderHeader(tr(UiTextId::SurveyCommitted), clearContent);
        std::snprintf(line, sizeof(line), tr(UiTextId::SurveyFoundFormat),
                      static_cast<unsigned>(surveySession.size()));
        renderMetric(0, line, Tone::Positive);
        renderMetric(1, tr(surveyWorkflow.persistent()
                               ? UiTextId::SurveyResultsSaved
                               : UiTextId::SurveyResultsTemporary),
                     surveyWorkflow.persistent() ? Tone::Positive
                                                 : Tone::Warning);
        return;
    }
    if (surveyWorkflow.state() == SurveyWorkflowState::Error) {
        renderHeader(tr(UiTextId::SurveyError), clearContent);
        renderMetric(0, tr(UiTextId::SurveyCouldNotStart), Tone::Danger);
        renderMetric(1, tr(UiTextId::SurveyPreviousSafe));
        renderMetric(2, tr(UiTextId::CaptureTryAgainUser));
        return;
    }
    if (surveyController.view() == SurveyView::Filter) {
        renderHeader(tr(UiTextId::SurveyFilter), clearContent);
        for (std::uint8_t index = 0;
             index <= static_cast<std::uint8_t>(SurveyFilter::Ble); ++index) {
            renderSurveyFilterOption(index);
        }
        return;
    }
    if (surveyController.view() == SurveyView::Detail) {
        renderHeader(tr(UiTextId::SurveyDetail), clearContent);
        const Observation* observation = surveyController.selected();
        if (observation == nullptr) return;
        display.setTextFont(4);
        activeDisplayFont = ActiveDisplayFont::None;
        display.setTextColor(Palette::Focus, Palette::Canvas);
        display.setCursor(14, 88);
        display.print(observation->label.data());
        display.setTextColor(Palette::TextSecondary, Palette::Canvas);
        if (observation->radio == RadioKind::Ble) {
            setUiCursor(UiTextRole::Body, 14, 122);
            display.print(tr(UiTextId::BluetoothDevice));
            std::snprintf(
                line, sizeof(line), tr(UiTextId::BleAddressFormat),
                static_cast<unsigned>(observation->identity[0]),
                static_cast<unsigned>(observation->identity[1]),
                static_cast<unsigned>(observation->identity[2]),
                static_cast<unsigned>(observation->identity[3]),
                static_cast<unsigned>(observation->identity[4]),
                static_cast<unsigned>(observation->identity[5]));
            setUiCursor(UiTextRole::Meta, 14, 151);
            display.print(line);
        } else {
            std::snprintf(line, sizeof(line), tr(UiTextId::ChannelFormat),
                          static_cast<unsigned>(observation->channel));
            setUiCursor(UiTextRole::Body, 14, 122);
            display.print(line);
        }
        std::snprintf(line, sizeof(line), tr(UiTextId::RssiFormat),
                      static_cast<int>(observation->rssiDbm));
        setUiCursor(UiTextRole::Body, 14,
                    observation->radio == RadioKind::Ble ? 174 : 148);
        display.print(line);
        const ObservationHistory history = surveyController.selectedHistory();
        if (history.valid) {
            renderRssiHistory(history);
        } else {
            display.setTextColor(Palette::Positive, Palette::Canvas);
            setUiCursor(UiTextRole::Meta, 14, 203);
            display.print(tr(UiTextId::NoSignalHistory));
        }
        return;
    }

