anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    renderHeader(tr(UiTextId::SurveyRunning), clearContent);
    display.setTextColor(Palette::Positive, Palette::Canvas);
    setUiCursor(UiTextRole::Meta, 14, 70);
    if (std::strcmp(productSurveyRuntime.status, "paused") == 0) {
        display.print(tr(UiTextId::SurveyPaused));
    } else if (std::strcmp(productSurveyRuntime.status, "pausing") == 0) {
        display.print(tr(UiTextId::SurveyPausing));
    } else if (std::strcmp(productSurveyRuntime.status, "stopping") == 0) {
        display.print(tr(UiTextId::SurveyStopping));
    } else if (std::strcmp(productSurveyRuntime.status, "cancelling") == 0) {
        display.print(tr(UiTextId::SurveyCancelling));
    } else {
        const std::uint8_t selectedMask = productSurveyTimeline.selectedMask();
        display.print(tr(selectedMask == 1U
                             ? UiTextId::SurveySearchWifi
                             : selectedMask == 2U
                                   ? UiTextId::SurveySearchBle
                                   : UiTextId::SurveySearchBoth));
    }
    if (productSurveyTimeline.state() == SourceTimelineState::Running) {
        const auto* wifi = productSurveyTimeline.source(RadioKind::Wifi);
        const auto* ble = productSurveyTimeline.source(RadioKind::Ble);
        const bool wifiUnavailable =
            wifi != nullptr && wifi->selected &&
            (wifi->state == SourceWindowState::Unavailable ||
             wifi->state == SourceWindowState::Fault);
        const bool bleUnavailable =
            ble != nullptr && ble->selected &&
            (ble->state == SourceWindowState::Unavailable ||
             ble->state == SourceWindowState::Fault);
        if (wifiUnavailable || bleUnavailable) {
            display.setTextColor(Palette::Warning, Palette::Canvas);
            setUiCursor(UiTextRole::Meta, 14, 84);
            const char* unavailable = wifiUnavailable
                ? tr(UiTextId::TimelineWifiUnavailable)
                : tr(UiTextId::TimelineBleUnavailable);
            display.print(unavailable);
        }
    }
    renderSurveyFilterBar();
    const std::size_t selection = surveyController.selection();
    const std::size_t firstVisible = surveyFirstVisible(selection);
    const std::size_t endVisible =
        surveyController.visibleSize() < firstVisible + kVisibleSurveyRows
            ? surveyController.visibleSize()
            : firstVisible + kVisibleSurveyRows;
    for (std::size_t index = firstVisible; index < endVisible; ++index) {
        renderSurveyListRow(index, firstVisible);
    }
}

UiTextId libraryEntryTitle(const LibraryEntry& entry) {
    if (entry.session == nullptr) return UiTextId::LibraryRecord;
    if (std::strcmp(entry.session->id(), FieldSurveyTracker::kSessionId) == 0) {
        return UiTextId::FieldSurveyTitle;
    }
    const auto& capture = entry.session->captureMetadata();
    if (capture.infraredRawCaptured) return UiTextId::LibraryInfraredCapture;
    if (capture.subGhzRawCaptured) return UiTextId::LibrarySubGhzCapture;
    if (capture.framePayloadCaptured) return UiTextId::LibraryWifiCapture;
    if (capture.selectedSourceMask == 1U) return UiTextId::LibraryWifiScan;
    if (capture.selectedSourceMask == 2U) return UiTextId::LibraryBleScan;
    if (capture.selectedSourceMask == 3U) return UiTextId::LibraryCombinedScan;
    return UiTextId::LibraryRecord;
}

UiTextId libraryEntryState(const LibraryEntry& entry) {
    if (entry.integrity ==
        leshy1::apps::library::SessionIntegrity::RecoveredFallback) {
        return UiTextId::LibraryRecovered;
    }
    return entry.persistent ? UiTextId::LibrarySaved
                            : UiTextId::LibraryTemporary;
}

void libraryObservationCounts(const LibraryEntry& entry,
                              std::size_t* wifiCount,
                              std::size_t* bleCount) {
    if (wifiCount != nullptr) *wifiCount = 0;
    if (bleCount != nullptr) *bleCount = 0;
    if (entry.session == nullptr) return;
    for (std::size_t index = 0; index < entry.session->size(); ++index) {
        const Observation* observation = entry.session->get(index);
        if (observation == nullptr) continue;
        if (observation->radio == RadioKind::Wifi) {
            if (wifiCount != nullptr) ++(*wifiCount);
        } else if (bleCount != nullptr) {
            ++(*bleCount);
        }
    }
}

void renderLibraryListRow(std::size_t index) {
    const LibraryEntry* entry = libraryController.get(index);
    if (entry == nullptr || entry->session == nullptr) return;
    const std::int32_t y = 94 + static_cast<std::int32_t>(index) * 48;
    const bool selected = libraryController.selection() == index;
    const std::uint16_t background = selected ? Palette::SurfaceFocus
                                               : Palette::Surface;
    display.fillRoundRect(Layout::Edge, y, Layout::ContentWidth,
                          Layout::RowHeight, Layout::Radius, background);
    renderFocusCue({Layout::Edge, static_cast<std::int16_t>(y),
                    Layout::ContentWidth, Layout::RowHeight}, selected);
    display.setTextColor(selected ? Palette::Focus : Palette::TextSecondary,
                         background);
    setUiCursor(UiTextRole::Body,
                Layout::Edge + kInteractiveRowTextInset, y - 1);
    display.print(tr(libraryEntryTitle(*entry)));
    display.setTextColor(
        entry->integrity ==
                leshy1::apps::library::SessionIntegrity::RecoveredFallback ||
                !entry->persistent
            ? Palette::Warning
            : Palette::Positive,
        background);
    setUiCursor(UiTextRole::Meta,
                Layout::Edge + kInteractiveRowTextInset, y + 23);
    display.print(tr(libraryEntryState(*entry)));
}

void renderLibraryPage(bool clearContent) {
    char line[96] = {};
    const LibraryEntry* selected = libraryController.selected();
    const bool persistent = selected != nullptr && selected->persistent;
    if (libraryController.view() == LibraryView::ExportReady) {
        renderHeader(tr(UiTextId::ExportReady), clearContent);
        if (selected == nullptr || selected->session == nullptr) return;
        renderMetric(0, tr(libraryEntryTitle(*selected)), Tone::Positive);
        if (std::strcmp(selected->session->id(),
                        FieldSurveyTracker::kSessionId) == 0) {
            renderMetric(1, tr(UiTextId::FieldSurveyNativeReady),
                         Tone::Positive);
            renderMetric(2, tr(UiTextId::FieldSurveyWigleLocal),
                         Tone::Warning);
            renderMetric(3, tr(UiTextId::ExportUsbRequired), Tone::Positive);
            return;
        }
        renderMetric(1, tr(UiTextId::FormatSummaryReady));
        const auto& capture = selected->session->captureMetadata();
        const bool rawFrames = capture.framePayloadCaptured;
        if (capture.subGhzRawCaptured || capture.infraredRawCaptured) {
            renderMetric(2, tr(UiTextId::FormatPulseCsvReady));
        } else if (rawFrames) {
            renderMetric(2, tr(UiTextId::FormatPcapReady));
        } else {
            renderMetric(2, tr(UiTextId::FormatCsvReady));
        }
        renderMetric(3, tr(UiTextId::ExportUsbRequired), Tone::Positive);
        return;
    }
    if (libraryController.view() == LibraryView::SessionDetail) {
        renderHeader(tr(UiTextId::SessionDetail), clearContent);
        if (selected == nullptr || selected->session == nullptr) return;
        renderMetric(0, tr(libraryEntryTitle(*selected)), Tone::Positive);
        const auto& capture = selected->session->captureMetadata();
        if (capture.infraredRawCaptured) {
            if (capture.infraredDecode.integrityValid) {
                std::snprintf(
                    line, sizeof(line), tr(UiTextId::IrProtocolFormat),
                    leshy1::domain::captures::infraredProtocolName(
                        capture.infraredDecode.protocol));
                renderMetric(1, line, Tone::Positive);
                std::snprintf(
                    line, sizeof(line), tr(UiTextId::IrCodeFormat),
                    static_cast<unsigned long>(capture.infraredDecode.rawCode));
                renderMetric(2, line);
            } else {
                renderMetric(1, tr(UiTextId::IrUnknownFormat), Tone::Warning);
            }
        } else if (capture.subGhzRawCaptured) {
            std::snprintf(
                line, sizeof(line), tr(UiTextId::SubGhzRawFrequencyFormat),
                static_cast<unsigned long>(capture.subGhzFrequencyKHz / 1000U),
                static_cast<unsigned long>(capture.subGhzFrequencyKHz % 1000U));
            renderMetric(1, line);
            renderMetric(2, tr(UiTextId::SubGhzSignalRecorded), Tone::Positive);
        } else if (capture.framePayloadCaptured) {
            std::snprintf(line, sizeof(line),
                          tr(UiTextId::CapturePacketsFormat),
                          static_cast<unsigned long>(
                              capture.framePayloadRecords));
            renderMetric(1, line);
            renderMetric(2, tr(UiTextId::CapturePcapReadyUser), Tone::Positive);
        } else {
            std::size_t wifiCount = 0;
            std::size_t bleCount = 0;
            libraryObservationCounts(*selected, &wifiCount, &bleCount);
            std::snprintf(line, sizeof(line),
                          tr(UiTextId::LibraryWifiBleCountFormat),
                          static_cast<unsigned>(wifiCount),
                          static_cast<unsigned>(bleCount));
            renderMetric(1, line);
        }
        renderMetric(3,
                     tr(selected->integrity ==
                                leshy1::apps::library::SessionIntegrity::
                                    RecoveredFallback
                            ? UiTextId::LibraryRecoveredWarning
                            : persistent ? UiTextId::LibraryStoredOnSd
                                         : UiTextId::LibraryNotStored),
                     selected->integrity ==
                             leshy1::apps::library::SessionIntegrity::
                                 RecoveredFallback
                         ? Tone::Warning
                         : persistent ? Tone::Positive : Tone::Warning);
        return;
    }

    renderHeader(tr(UiTextId::AppLibrary), clearContent);
    display.setTextColor(Palette::Positive, Palette::Canvas);
    std::snprintf(line, sizeof(line), tr(UiTextId::LibraryCountFormat),
                  static_cast<unsigned>(libraryController.size()));
    setUiCursor(UiTextRole::Meta, 14, 70);
    display.print(line);
    for (std::size_t index = 0; index < libraryController.size(); ++index) {
        renderLibraryListRow(index);
    }
}

constexpr std::size_t kVisibleTargetRows = 4;

std::size_t targetsFirstVisible(std::size_t selection) {
    return selection < kVisibleTargetRows
        ? 0U : selection - (kVisibleTargetRows - 1U);
}

void formatTargetIdentity(
    const leshy1::domain::targets::TargetIdentity& identity,
    char* output, std::size_t capacity) {
    if (output == nullptr || capacity == 0) return;
    output[0] = '\0';
    if (identity.length != 6 || capacity < 18) return;
    std::snprintf(
        output, capacity, "%02X:%02X:%02X:%02X:%02X:%02X",
        static_cast<unsigned>(identity.value[0]),
        static_cast<unsigned>(identity.value[1]),
        static_cast<unsigned>(identity.value[2]),
        static_cast<unsigned>(identity.value[3]),
        static_cast<unsigned>(identity.value[4]),
        static_cast<unsigned>(identity.value[5]));
}

void formatTargetName(const TargetListRow& row, char* output,
                      std::size_t capacity) {
    if (output == nullptr || capacity == 0) return;
    output[0] = '\0';
    const auto* target = targetsProductRuntime == nullptr
        ? nullptr : targetsProductRuntime->controller.catalog().find(
              row.targetId);
    if (target != nullptr && target->nameLength != 0) {
        std::snprintf(output, capacity, "%s", target->name.data());
        return;
    }
    if (row.latest.labelLength != 0) {
        std::snprintf(output, capacity, "%s", row.latest.label.data());
        return;
    }
    formatTargetIdentity(row.identity, output, capacity);
}

void formatTargetRecordName(const TargetRecord& record, char* output,
                            std::size_t capacity) {
    if (output == nullptr || capacity == 0) return;
    output[0] = '\0';
    if (record.nameLength != 0) {
        std::snprintf(output, capacity, "%s", record.name.data());
    } else if (record.identityCount != 0) {
        formatTargetIdentity(record.identities[0], output, capacity);
    }
}

