anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void fitTargetRowText(char* text, std::size_t capacity, UiTextRole role) {
    if (text == nullptr || capacity < 4) return;
    constexpr std::int16_t kRightInset = 6;
    constexpr std::int16_t kMaximumWidth =
        Layout::ContentWidth - kInteractiveRowTextInset - kRightInset;
    selectUiFont(role);
    if (display.textWidth(text) <= kMaximumWidth) return;
    std::size_t length = std::strlen(text);
    while (length > 0) {
        std::size_t cut = length - 1;
        while (cut > 0 &&
               (static_cast<unsigned char>(text[cut]) & 0xc0U) == 0x80U) {
            --cut;
        }
        text[cut] = '\0';
        length = cut;
        if (length + 3 >= capacity) continue;
        std::memcpy(text + length, "...", 4);
        if (display.textWidth(text) <= kMaximumWidth) return;
        text[length] = '\0';
    }
    std::snprintf(text, capacity, "...");
}

void formatCorrelationObservation(
    const Observation& observation,
    const leshy1::domain::targets::TargetIdentity& identity,
    char* text, std::size_t textCapacity,
    char* note, std::size_t noteCapacity) {
    if (text == nullptr || textCapacity == 0 || note == nullptr ||
        noteCapacity == 0) {
        return;
    }
    if (observation.labelLength != 0) {
        std::snprintf(text, textCapacity, "%s", observation.label.data());
    } else {
        formatTargetIdentity(identity, text, textCapacity);
    }
    char identityText[24] = {};
    formatTargetIdentity(identity, identityText, sizeof(identityText));
    std::snprintf(note, noteCapacity,
                  tr(UiTextId::TargetsCorrelationIdentityFormat),
                  identityText, static_cast<int>(observation.rssiDbm));
    fitTargetRowText(text, textCapacity, UiTextRole::Body);
}

void renderTargetListRow(std::size_t entryIndex, std::size_t firstVisible) {
    if (targetsProductRuntime == nullptr || entryIndex < firstVisible ||
        entryIndex >= firstVisible + kVisibleTargetRows) {
        return;
    }
    TargetsController& controller = targetsProductRuntime->controller;
    if (entryIndex >= controller.entryCount()) return;
    const Rect bounds = Components::homeRow(static_cast<std::uint8_t>(
        entryIndex - firstVisible));
    const bool selected = controller.selection() == entryIndex;
    if (controller.compareAvailable() && entryIndex == 0) {
        const auto& comparison = controller.comparison();
        char note[64] = {};
        std::snprintf(note, sizeof(note),
                      tr(UiTextId::TargetsCompareRowFormat),
                      static_cast<unsigned>(comparison.added),
                      static_cast<unsigned>(comparison.removed),
                      static_cast<unsigned>(comparison.changed));
        renderMenuRow(bounds, tr(UiTextId::TargetsCompareVisits), note,
                      selected, true, Tone::Positive);
        return;
    }
    const std::size_t rowIndex = controller.compareAvailable()
        ? entryIndex - 1U : entryIndex;
    const TargetListRow* row = controller.row(rowIndex);
    if (row == nullptr) return;
    char name[49] = {};
    char note[64] = {};
    formatTargetName(*row, name, sizeof(name));
    if (row->latest.radio == RadioKind::Wifi) {
        std::snprintf(note, sizeof(note),
                      tr(UiTextId::TargetsWifiRowFormat),
                      static_cast<int>(row->latest.rssiDbm),
                      static_cast<unsigned>(row->latest.channel));
    } else {
        std::snprintf(note, sizeof(note),
                      tr(UiTextId::TargetsBleRowFormat),
                      static_cast<int>(row->latest.rssiDbm));
    }
    fitTargetRowText(name, sizeof(name), UiTextRole::Body);
    fitTargetRowText(note, sizeof(note), UiTextRole::Meta);
    renderMenuRow(bounds, name, note, selected, true, Tone::Neutral);
}

UiTextId targetComparisonClassTextId(TargetComparisonClass classification) {
    switch (classification) {
        case TargetComparisonClass::Added: return UiTextId::TargetsClassAdded;
        case TargetComparisonClass::Removed:
            return UiTextId::TargetsClassRemoved;
        case TargetComparisonClass::Changed:
            return UiTextId::TargetsClassChanged;
        case TargetComparisonClass::Unchanged:
            return UiTextId::TargetsClassUnchanged;
    }
    return UiTextId::TargetsClassUnchanged;
}

Tone targetComparisonTone(TargetComparisonClass classification) {
    switch (classification) {
        case TargetComparisonClass::Added: return Tone::Positive;
        case TargetComparisonClass::Removed: return Tone::Warning;
        case TargetComparisonClass::Changed: return Tone::Warning;
        case TargetComparisonClass::Unchanged: return Tone::Muted;
    }
    return Tone::Neutral;
}

void formatTargetComparisonName(const TargetsController& controller,
                                std::size_t index, char* output,
                                std::size_t capacity) {
    if (output == nullptr || capacity == 0) return;
    output[0] = '\0';
    const TargetListRow* row = controller.comparisonTargetRow(index);
    if (row != nullptr) formatTargetName(*row, output, capacity);
}

void renderTargetComparisonRow(std::size_t index, std::size_t firstVisible) {
    if (targetsProductRuntime == nullptr || index < firstVisible ||
        index >= firstVisible + kVisibleTargetRows) {
        return;
    }
    TargetsController& controller = targetsProductRuntime->controller;
    const auto* item = controller.comparisonItem(index);
    if (item == nullptr) return;
    TargetComparisonSide baseline{};
    TargetComparisonSide current{};
    if (!controller.comparisonSide(index, false, &baseline) ||
        !controller.comparisonSide(index, true, &current)) {
        return;
    }
    char name[49] = {};
    char note[64] = {};
    formatTargetComparisonName(controller, index, name, sizeof(name));
    const char* classification = tr(targetComparisonClassTextId(
        item->classification));
    if (baseline.present && current.present) {
        std::snprintf(note, sizeof(note),
                      tr(UiTextId::TargetsCompareSignalDeltaFormat),
                      classification,
                      static_cast<int>(baseline.observation.rssiDbm),
                      static_cast<int>(current.observation.rssiDbm));
    } else {
        const TargetComparisonSide& visible = current.present
            ? current : baseline;
        std::snprintf(note, sizeof(note),
                      tr(UiTextId::TargetsCompareSignalFormat),
                      classification,
                      static_cast<int>(visible.observation.rssiDbm));
    }
    fitTargetRowText(name, sizeof(name), UiTextRole::Body);
    fitTargetRowText(note, sizeof(note), UiTextRole::Meta);
    const Rect bounds = Components::homeRow(static_cast<std::uint8_t>(
        index - firstVisible));
    renderMenuRow(bounds, name, note,
                  controller.comparisonSelection() == index, true,
                  targetComparisonTone(item->classification));
}

