anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void appendTargetChange(char* output, std::size_t capacity, UiTextId id,
                        std::uint8_t* count) {
    if (output == nullptr || capacity == 0 || count == nullptr) return;
    const char* token = tr(id);
    const std::size_t length = std::strlen(output);
    if (*count >= 2) {
        if (length + 3 < capacity) std::snprintf(output + length,
                                                capacity - length, " +");
        ++*count;
        return;
    }
    std::snprintf(output + length, capacity - length, "%s%s",
                  length == 0 ? "" : ", ", token);
    ++*count;
}

void formatTargetChanges(
    leshy1::domain::targets::TargetChangeMask mask,
    char* output, std::size_t capacity) {
    if (output == nullptr || capacity == 0) return;
    output[0] = '\0';
    std::uint8_t count = 0;
    const auto append = [&](TargetChangeKind kind, UiTextId id) {
        if ((mask & leshy1::domain::targets::targetChangeMask(kind)) != 0 &&
            count <= 2) {
            appendTargetChange(output, capacity, id, &count);
        }
    };
    append(TargetChangeKind::IdentitySet, UiTextId::TargetsChangeIdentity);
    append(TargetChangeKind::Radio, UiTextId::TargetsChangeRadio);
    append(TargetChangeKind::Frequency, UiTextId::TargetsChangeFrequency);
    append(TargetChangeKind::Channel, UiTextId::TargetsChangeChannel);
    append(TargetChangeKind::Signal, UiTextId::TargetsChangeSignal);
    append(TargetChangeKind::Label, UiTextId::TargetsChangeLabel);
    append(TargetChangeKind::WifiFacts, UiTextId::TargetsChangeWifi);
    append(TargetChangeKind::BleFacts, UiTextId::TargetsChangeBle);
}

void formatTargetComparisonSide(bool current,
                                const TargetComparisonSide& side,
                                char* output, std::size_t capacity) {
    if (output == nullptr || capacity == 0) return;
    if (!side.present) {
        std::snprintf(output, capacity, "%s",
                      tr(current ? UiTextId::TargetsNowNone
                                 : UiTextId::TargetsBeforeNone));
        return;
    }
    if (side.observation.radio == RadioKind::Wifi) {
        std::snprintf(output, capacity,
                      tr(current ? UiTextId::TargetsNowWifiFormat
                                 : UiTextId::TargetsBeforeWifiFormat),
                      static_cast<int>(side.observation.rssiDbm),
                      static_cast<unsigned>(side.observation.channel));
    } else {
        std::snprintf(output, capacity,
                      tr(current ? UiTextId::TargetsNowBleFormat
                                 : UiTextId::TargetsBeforeBleFormat),
                      static_cast<int>(side.observation.rssiDbm));
    }
}

void renderTargetComparisonDetail(bool clearContent) {
    renderHeader(tr(UiTextId::TargetsCompareEvidence), clearContent);
    if (targetsProductRuntime == nullptr) {
        renderMetric(0, tr(UiTextId::TargetsLoadFailed), Tone::Danger);
        return;
    }
    TargetsController& controller = targetsProductRuntime->controller;
    const std::size_t index = controller.comparisonSelection();
    const auto* item = controller.selectedComparisonItem();
    if (item == nullptr) {
        renderMetric(0, tr(UiTextId::TargetsCompareEmpty), Tone::Muted);
        return;
    }
    TargetComparisonSide baseline{};
    TargetComparisonSide current{};
    if (!controller.comparisonSide(index, false, &baseline) ||
        !controller.comparisonSide(index, true, &current)) {
        renderMetric(0, tr(UiTextId::TargetsLoadFailed), Tone::Danger);
        return;
    }
    char line[64] = {};
    formatTargetComparisonName(controller, index, line, sizeof(line));
    renderMetric(0, line, Tone::Positive);
    std::snprintf(line, sizeof(line), tr(UiTextId::TargetsStatusFormat),
                  tr(targetComparisonClassTextId(item->classification)));
    renderMetric(1, line, targetComparisonTone(item->classification));
    formatTargetComparisonSide(false, baseline, line, sizeof(line));
    renderMetric(2, line);
    formatTargetComparisonSide(true, current, line, sizeof(line));
    renderMetric(3, line);
    if (item->changes != 0) {
        char changes[40] = {};
        formatTargetChanges(item->changes, changes, sizeof(changes));
        std::snprintf(line, sizeof(line), tr(UiTextId::TargetsChangesFormat),
                      changes);
    } else {
        const auto& comparison = controller.comparison();
        std::snprintf(line, sizeof(line), tr(UiTextId::TargetsVisitsFormat),
                      static_cast<unsigned long>(
                          comparison.baseline.generation),
                      static_cast<unsigned long>(
                          comparison.current.generation));
    }
    renderMetric(4, line);
}

void renderWebCompanionPage(bool clearContent) {
    renderHeader(tr(UiTextId::CompanionWebTitle), clearContent);
    if (!webCompanionConnectivity.authorized() ||
        !arduinoCompanionWebService.active()) {
        renderMenuRow(Components::homeRow(0),
                      tr(UiTextId::CompanionWebOff),
                      tr(UiTextId::CompanionWebStartHint), true, true,
                      Tone::Positive);
        const auto reason = webCompanionConnectivity.stopReason();
        if (reason != leshy1::services::companion::
                          CompanionLocalStopReason::None &&
            reason != leshy1::services::companion::
                          CompanionLocalStopReason::User) {
            UiTextId reasonText = UiTextId::CompanionWebSafetyEnded;
            switch (reason) {
                case leshy1::services::companion::
                        CompanionLocalStopReason::StartFailed:
                    reasonText = UiTextId::CompanionWebStartFailed;
                    break;
                case leshy1::services::companion::
                        CompanionLocalStopReason::IdleTimeout:
                    reasonText = UiTextId::CompanionWebIdleEnded;
                    break;
                case leshy1::services::companion::
                        CompanionLocalStopReason::LifetimeTimeout:
                    reasonText = UiTextId::CompanionWebLimitEnded;
                    break;
                default:
                    break;
            }
            renderMetric(2, tr(reasonText), Tone::Warning);
        }
        return;
    }
    char line[96] = {};
    std::snprintf(line, sizeof(line), tr(UiTextId::CompanionWebSsidFormat),
                  webCompanionCredentials.ssid.data());
    renderMetric(0, line, Tone::Positive);
    std::snprintf(line, sizeof(line), tr(UiTextId::CompanionWebPassFormat),
                  webCompanionCredentials.passphrase.data());
    renderMetric(1, line, Tone::Warning);
    renderMetric(2, tr(UiTextId::CompanionWebUrl), Tone::Positive);
    renderMetric(3, tr(UiTextId::CompanionWebTimeout), Tone::Muted);
    std::snprintf(
        line, sizeof(line), tr(UiTextId::CompanionWebRequestsFormat),
        static_cast<unsigned>(
            arduinoCompanionWebService.requestsHandled()),
        static_cast<unsigned>(
            arduinoCompanionWebService.requestsRejected()));
    renderMetric(4, line, Tone::Muted);
}

