anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void renderTargetsPage(bool clearContent) {
    if (webCompanionOverlay) {
        renderWebCompanionPage(clearContent);
        return;
    }
    if (targetsProductRuntime == nullptr) {
        renderHeader(targetsMutationState == TargetsMutationState::Saving
                         ? tr(UiTextId::TargetsActions)
                         : tr(UiTextId::AppTargets),
                     clearContent);
        renderMetric(0,
                     targetsMutationState == TargetsMutationState::Saving
                         ? tr(UiTextId::TargetsSaving)
                         : tr(UiTextId::TargetsLoadFailed),
                     targetsMutationState == TargetsMutationState::Saving
                         ? Tone::Positive : Tone::Danger);
        return;
    }
    TargetsController& controller = targetsProductRuntime->controller;
    if (controller.view() == TargetsView::CorrelationEvidence) {
        renderHeader(tr(UiTextId::TargetsCorrelationEvidence), clearContent);
        const auto* proposal = controller.reviewedCorrelationProposal();
        Observation observation{};
        const bool candidate = controller.correlationEvidenceIsCandidate();
        if (proposal == nullptr ||
            !controller.correlationEvidence(candidate, &observation)) {
            renderMetric(0, tr(UiTextId::TargetsLoadFailed), Tone::Danger);
            return;
        }
        const auto* selectedRow = controller.selectedRow();
        if (!candidate && selectedRow == nullptr) {
            renderMetric(0, tr(UiTextId::TargetsLoadFailed), Tone::Danger);
            return;
        }
        const auto& identity = candidate ? proposal->candidateIdentity
                                         : selectedRow->identity;
        char line[80] = {};
        if (observation.labelLength != 0) {
            std::snprintf(line, sizeof(line), "%s", observation.label.data());
        } else {
            formatTargetIdentity(identity, line, sizeof(line));
        }
        renderMetric(0, line, Tone::Positive);
        char identityText[24] = {};
        formatTargetIdentity(identity, identityText, sizeof(identityText));
        std::snprintf(line, sizeof(line), tr(UiTextId::TargetsIdentityFormat),
                      identityText);
        renderMetric(1, line);
        if (observation.radio == RadioKind::Wifi) {
            std::snprintf(line, sizeof(line),
                          tr(UiTextId::TargetsWifiRowFormat),
                          static_cast<int>(observation.rssiDbm),
                          static_cast<unsigned>(observation.channel));
        } else {
            std::snprintf(line, sizeof(line),
                          tr(UiTextId::TargetsBleRowFormat),
                          static_cast<int>(observation.rssiDbm));
        }
        renderMetric(2, line);
        const auto& evidence = candidate
            ? proposal->candidateEvidence
            : proposal->features[0].targetEvidence;
        std::snprintf(line, sizeof(line),
                      tr(UiTextId::TargetsCorrelationSourceFormat),
                      static_cast<unsigned long>(evidence.sourceGeneration),
                      static_cast<unsigned long long>(
                          evidence.observationSequence));
        renderMetric(3, line);
        renderMetric(4, candidate
            ? tr(UiTextId::TargetsCorrelationCandidate)
            : tr(UiTextId::TargetsCorrelationExisting), Tone::Muted);
        return;
    }
    if (controller.view() == TargetsView::CorrelationReview) {
        renderHeader(tr(UiTextId::TargetsCorrelationReview), clearContent);
        const auto* proposal = controller.reviewedCorrelationProposal();
        Observation known{};
        Observation candidate{};
        if (proposal == nullptr || !controller.correlationEvidence(false, &known) ||
            !controller.correlationEvidence(true, &candidate)) {
            renderMetric(0, tr(UiTextId::TargetsLoadFailed), Tone::Danger);
            return;
        }
        char text[48] = {};
        char note[64] = {};
        const auto* selectedRow = controller.selectedRow();
        if (selectedRow == nullptr) {
            renderMetric(0, tr(UiTextId::TargetsLoadFailed), Tone::Danger);
            return;
        }
        formatCorrelationObservation(known, selectedRow->identity,
                                     text, sizeof(text), note, sizeof(note));
        renderMenuRow(Components::homeRow(0),
                      tr(UiTextId::TargetsCorrelationExisting), note,
                      controller.correlationReviewSelection() == 0, true,
                      Tone::Neutral);
        formatCorrelationObservation(candidate, proposal->candidateIdentity,
                                     text, sizeof(text), note, sizeof(note));
        renderMenuRow(Components::homeRow(1),
                      tr(UiTextId::TargetsCorrelationCandidate), note,
                      controller.correlationReviewSelection() == 1, true,
                      Tone::Positive);
        std::snprintf(note, sizeof(note),
                      tr(UiTextId::TargetsCorrelationScoreFormat),
                      static_cast<unsigned>(proposal->scorePermille / 10U));
        renderMenuRow(Components::homeRow(2),
                      tr(UiTextId::TargetsCorrelationAccept), note,
                      controller.correlationReviewSelection() == 2, true,
                      Tone::Positive);
        renderMenuRow(Components::homeRow(3),
                      tr(UiTextId::TargetsCorrelationReject), note,
                      controller.correlationReviewSelection() == 3, true,
                      Tone::Warning);
        return;
    }
    if (controller.view() == TargetsView::CorrelationList) {
        renderHeader(tr(UiTextId::TargetsCorrelationList), clearContent);
        const std::size_t count = controller.selectedCorrelationCount();
        if (count == 0) {
            renderMetric(0, tr(UiTextId::TargetsCompareEmpty), Tone::Muted);
            return;
        }
        const std::size_t first = targetsFirstVisible(
            controller.correlationSelection());
        const std::size_t end = count < first + kVisibleTargetRows
            ? count : first + kVisibleTargetRows;
        for (std::size_t index = first; index < end; ++index) {
            const auto* proposal = controller.selectedCorrelationProposal(index);
            if (proposal == nullptr) continue;
            char identity[24] = {};
            formatTargetIdentity(proposal->candidateIdentity, identity,
                                 sizeof(identity));
            char note[40] = {};
            std::snprintf(note, sizeof(note),
                          tr(UiTextId::TargetsCorrelationScoreFormat),
                          static_cast<unsigned>(proposal->scorePermille / 10U));
            renderMenuRow(Components::homeRow(index - first), identity, note,
                          controller.correlationSelection() == index, true,
                          Tone::Positive);
        }
        return;
    }
    if (controller.view() == TargetsView::NotesEdit) {
        renderHeader(tr(UiTextId::TargetsNotesEdit), clearContent);
        char notes[TargetRecord::kNotesCapacity + 1] = {};
        std::snprintf(notes, sizeof(notes), "%s", controller.notesEditorText());
        if (notes[0] == '\0') {
            std::snprintf(notes, sizeof(notes), "%s",
                          tr(UiTextId::TargetsNotesEmpty));
        }
        fitTargetRowText(notes, sizeof(notes), UiTextRole::Body);
        char note[48] = {};
        std::snprintf(note, sizeof(note),
                      tr(UiTextId::TargetsNameSymbolFormat),
                      controller.notesEditorGlyph());
        renderMenuRow(Components::homeRow(0), notes, note,
                      controller.notesEditorSelection() == 0, true,
                      Tone::Positive);
        char glyph[2] = {controller.notesEditorGlyph(), '\0'};
        renderMenuRow(Components::homeRow(1),
                      tr(UiTextId::TargetsNameAppend), glyph,
                      controller.notesEditorSelection() == 1,
                      controller.notesEditorCanAppend(), Tone::Positive);
        std::snprintf(note, sizeof(note),
                      tr(UiTextId::TargetsNameLengthFormat),
                      static_cast<unsigned>(controller.notesEditorLength()),
                      static_cast<unsigned>(TargetRecord::kNotesCapacity));
        renderMenuRow(Components::homeRow(2),
                      tr(UiTextId::TargetsNameDelete), note,
                      controller.notesEditorSelection() == 2,
                      controller.notesEditorLength() != 0, Tone::Muted);
        renderMenuRow(Components::homeRow(3),
                      tr(UiTextId::TargetsNotesSave),
                      tr(controller.notesEditorDirty()
                             ? UiTextId::TargetsNameChanged
                             : targetsMutationState == TargetsMutationState::Saved &&
                                       targetsMutationReport.actionKind ==
                                           TargetActionKind::SetNotes
                                   ? UiTextId::TargetsSaved
                                   : UiTextId::TargetsNameUnchanged),
                      controller.notesEditorSelection() == 3,
                      controller.notesEditorDirty(),
                      controller.notesEditorDirty() ? Tone::Positive
                                                    : Tone::Muted);
        return;
    }
    if (controller.view() == TargetsView::TagEdit) {
        renderHeader(tr(UiTextId::TargetsTagEdit), clearContent);
        char tag[TargetRecord::kTagCapacity + 1] = {};
        std::snprintf(tag, sizeof(tag), "%s", controller.tagEditorText());
        if (tag[0] == '\0') {
            std::snprintf(tag, sizeof(tag), "%s",
                          tr(UiTextId::TargetsTagNew));
        }
        fitTargetRowText(tag, sizeof(tag), UiTextRole::Body);
        char note[48] = {};
        std::snprintf(note, sizeof(note),
                      tr(UiTextId::TargetsNameSymbolFormat),
                      controller.tagEditorGlyph());
        renderMenuRow(Components::homeRow(0), tag, note,
                      controller.tagEditorSelection() == 0, true,
                      Tone::Positive);
        char glyph[2] = {controller.tagEditorGlyph(), '\0'};
        renderMenuRow(Components::homeRow(1),
                      tr(UiTextId::TargetsNameAppend), glyph,
                      controller.tagEditorSelection() == 1,
                      controller.tagEditorCanAppend(), Tone::Positive);
        std::snprintf(note, sizeof(note),
                      tr(UiTextId::TargetsNameLengthFormat),
                      static_cast<unsigned>(controller.tagEditorLength()),
                      static_cast<unsigned>(TargetRecord::kTagCapacity));
        renderMenuRow(Components::homeRow(2),
                      tr(UiTextId::TargetsNameDelete), note,
                      controller.tagEditorSelection() == 2,
                      controller.tagEditorLength() != 0, Tone::Muted);
        renderMenuRow(Components::homeRow(3),
                      tr(UiTextId::TargetsTagSave),
                      tr(controller.tagEditorCanSave()
                             ? UiTextId::TargetsNameChanged
                             : UiTextId::TargetsNameUnchanged),
                      controller.tagEditorSelection() == 3,
                      controller.tagEditorCanSave(),
                      controller.tagEditorCanSave() ? Tone::Positive
                                                    : Tone::Muted);
        return;
    }
    if (controller.view() == TargetsView::TagList) {
        renderHeader(tr(UiTextId::TargetsTagsList), clearContent);
        const auto* target = controller.selectedTarget();
        if (target == nullptr || controller.tagEntryCount() == 0) {
            renderMetric(0, tr(UiTextId::TargetsLoadFailed), Tone::Danger);
            return;
        }
        const std::size_t first = targetsFirstVisible(
            controller.tagSelection());
        const std::size_t end = controller.tagEntryCount() <
                first + kVisibleTargetRows
            ? controller.tagEntryCount() : first + kVisibleTargetRows;
        for (std::size_t index = first; index < end; ++index) {
            const bool add = index == target->tagCount;
            char text[TargetRecord::kTagCapacity + 1] = {};
            if (add) {
                std::snprintf(text, sizeof(text), "%s",
                              tr(UiTextId::TargetsTagAdd));
            } else {
                std::memcpy(text, target->tags[index].data(),
                            target->tagLengths[index]);
            }
            char note[24] = {};
            if (add) {
                std::snprintf(note, sizeof(note),
                              tr(UiTextId::TargetsTagsCountFormat),
                              static_cast<unsigned>(target->tagCount),
                              static_cast<unsigned>(
                                  TargetRecord::kTagCountCapacity));
            } else {
                std::snprintf(note, sizeof(note), "%s",
                              tr(UiTextId::TargetsTagRemove));
            }
            renderMenuRow(Components::homeRow(index - first), text, note,
                          controller.tagSelection() == index, true,
                          add ? Tone::Positive : Tone::Neutral);
        }
        return;
    }
    if (controller.view() == TargetsView::NameEdit) {
        renderHeader(tr(UiTextId::TargetsNameEdit), clearContent);
        char name[TargetRecord::kNameCapacity + 1] = {};
        std::snprintf(name, sizeof(name), "%s", controller.nameEditorText());
        if (name[0] == '\0') {
            std::snprintf(name, sizeof(name), "%s",
                          tr(UiTextId::TargetsNameEmpty));
        }
        fitTargetRowText(name, sizeof(name), UiTextRole::Body);
        char note[48] = {};
        std::snprintf(note, sizeof(note),
                      tr(UiTextId::TargetsNameSymbolFormat),
                      controller.nameEditorGlyph());
        renderMenuRow(Components::homeRow(0), name, note,
                      controller.nameEditorSelection() == 0, true,
                      Tone::Positive);
        char glyph[2] = {controller.nameEditorGlyph(), '\0'};
        renderMenuRow(Components::homeRow(1),
                      tr(UiTextId::TargetsNameAppend), glyph,
                      controller.nameEditorSelection() == 1,
                      controller.nameEditorCanAppend(), Tone::Positive);
        std::snprintf(note, sizeof(note),
                      tr(UiTextId::TargetsNameLengthFormat),
                      static_cast<unsigned>(controller.nameEditorLength()),
                      static_cast<unsigned>(TargetRecord::kNameCapacity));
        renderMenuRow(Components::homeRow(2),
                      tr(UiTextId::TargetsNameDelete), note,
                      controller.nameEditorSelection() == 2,
                      controller.nameEditorLength() != 0, Tone::Muted);
        renderMenuRow(Components::homeRow(3),
                      tr(UiTextId::TargetsNameSave),
                      tr(controller.nameEditorDirty()
                             ? UiTextId::TargetsNameChanged
                             : targetsMutationState == TargetsMutationState::Saved &&
                                       targetsMutationReport.actionKind ==
                                           TargetActionKind::SetName
                                   ? UiTextId::TargetsSaved
                                   : UiTextId::TargetsNameUnchanged),
                      controller.nameEditorSelection() == 3,
                      controller.nameEditorDirty(),
                      controller.nameEditorDirty() ? Tone::Positive
                                                   : Tone::Muted);
        return;
    }
    if (controller.view() == TargetsView::CompareDetail) {
        renderTargetComparisonDetail(clearContent);
        return;
    }
    if (controller.view() == TargetsView::Compare) {
        renderHeader(tr(UiTextId::TargetsCompare), clearContent);
        if (controller.comparisonSize() == 0) {
            renderMetric(0, tr(UiTextId::TargetsCompareEmpty), Tone::Muted);
            return;
        }
        const std::size_t first = targetsFirstVisible(
            controller.comparisonSelection());
        const std::size_t end = controller.comparisonSize() <
                first + kVisibleTargetRows
            ? controller.comparisonSize() : first + kVisibleTargetRows;
        for (std::size_t index = first; index < end; ++index) {
            renderTargetComparisonRow(index, first);
        }
        return;
    }
    if (controller.view() == TargetsView::MergeList) {
        renderHeader(tr(UiTextId::TargetsMergeList), clearContent);
        const std::size_t count = controller.mergeCandidateCount();
        const std::size_t first = targetsFirstVisible(
            controller.mergeSelection());
        const std::size_t end = count < first + kVisibleTargetRows
            ? count : first + kVisibleTargetRows;
        for (std::size_t index = first; index < end; ++index) {
            const auto* row = controller.mergeCandidate(index);
            if (row == nullptr) continue;
            char name[TargetRecord::kNameCapacity + 1] = {};
            char note[48] = {};
            formatTargetName(*row, name, sizeof(name));
            const auto* target = controller.catalog().find(row->targetId);
            std::snprintf(note, sizeof(note),
                          tr(UiTextId::TargetsEvidenceFormat),
                          static_cast<unsigned>(target == nullptr
                                                    ? 0U
                                                    : target->evidenceCount));
            renderMenuRow(Components::homeRow(index - first), name, note,
                          controller.mergeSelection() == index, true,
                          Tone::Neutral);
        }
        return;
    }
    if (controller.view() == TargetsView::MergeConfirm) {
        renderHeader(tr(UiTextId::TargetsMergeConfirm), clearContent);
        const auto* destination = controller.selectedTarget();
        const auto* sourceRow = controller.selectedMergeCandidate();
        const auto* source = sourceRow == nullptr ? nullptr
            : controller.catalog().find(sourceRow->targetId);
        if (destination == nullptr || source == nullptr || sourceRow == nullptr) {
            renderMetric(0, tr(UiTextId::TargetsLoadFailed), Tone::Danger);
            return;
        }
        char destinationName[TargetRecord::kNameCapacity + 1] = {};
        char sourceName[TargetRecord::kNameCapacity + 1] = {};
        const auto* destinationRow = controller.selectedRow();
        if (destinationRow != nullptr) {
            formatTargetName(*destinationRow, destinationName,
                             sizeof(destinationName));
        }
        formatTargetName(*sourceRow, sourceName, sizeof(sourceName));
        renderMenuRow(Components::homeRow(0),
                      tr(UiTextId::TargetsMergeDestination), destinationName,
                      false, true, Tone::Positive);
        renderMenuRow(Components::homeRow(1),
                      tr(UiTextId::TargetsMergeSource), sourceName,
                      false, true, Tone::Warning);
        char preview[80] = {};
        std::snprintf(preview, sizeof(preview),
                      tr(UiTextId::TargetsMergePreviewFormat),
                      static_cast<unsigned>(destination->evidenceCount),
                      static_cast<unsigned>(source->evidenceCount));
        renderMenuRow(Components::homeRow(2), preview, "", false, true,
                      Tone::Neutral);
        renderMenuRow(Components::homeRow(3),
                      tr(UiTextId::TargetsMergeConfirmAction), "", true, true,
                      Tone::Positive);
        return;
    }
    if (controller.view() == TargetsView::SplitConfirm) {
        renderHeader(tr(UiTextId::TargetsSplitConfirm), clearContent);
        const auto* destination = controller.selectedTarget();
        const auto* record = destination == nullptr ? nullptr
            : activeTargetMerge(targetsProductRuntime->merges,
                                destination->id);
        if (record == nullptr) {
            renderMetric(0, tr(UiTextId::TargetsLoadFailed), Tone::Danger);
            return;
        }
        char destinationName[TargetRecord::kNameCapacity + 1] = {};
        char sourceName[TargetRecord::kNameCapacity + 1] = {};
        formatTargetRecordName(record->destinationBefore, destinationName,
                               sizeof(destinationName));
        formatTargetRecordName(record->sourceBefore, sourceName,
                               sizeof(sourceName));
        renderMenuRow(Components::homeRow(0),
                      tr(UiTextId::TargetsMergeDestination), destinationName,
                      false, true, Tone::Neutral);
        renderMenuRow(Components::homeRow(1),
                      tr(UiTextId::TargetsMergeSource), sourceName,
                      false, true, Tone::Positive);
        char preview[64] = {};
        std::snprintf(preview, sizeof(preview),
                      tr(UiTextId::TargetsSplitPreviewFormat),
                      static_cast<unsigned>(record->destinationBefore.evidenceCount),
                      static_cast<unsigned>(record->sourceBefore.evidenceCount));
        renderMenuRow(Components::homeRow(2), preview, "", false, true,
                      Tone::Neutral);
        renderMenuRow(Components::homeRow(3),
                      tr(UiTextId::TargetsSplitConfirmAction), "", true, true,
                      Tone::Warning);
        return;
    }
    if (controller.view() == TargetsView::Actions) {
        renderHeader(tr(UiTextId::TargetsActions), clearContent);
        const auto* target = controller.selectedTarget();
        if (target == nullptr) {
            renderMetric(0, tr(UiTextId::TargetsLoadFailed), Tone::Danger);
            return;
        }
        const std::size_t first = targetsFirstVisible(
            controller.actionSelection());
        const std::size_t end = TargetsController::kActionCount <
                first + kVisibleTargetRows
            ? TargetsController::kActionCount : first + kVisibleTargetRows;
        for (std::size_t index = first; index < end; ++index) {
            const char* label = "";
            char note[TargetRecord::kNotesCapacity + 1] = {};
            bool enabled = true;
            Tone tone = Tone::Neutral;
            switch (index) {
                case 0: {
                    label = tr(UiTextId::TargetsFavorite);
                    const char* value = tr(target->favorite
                        ? UiTextId::TargetsFavoriteOn
                        : UiTextId::TargetsFavoriteOff);
                    std::snprintf(note, sizeof(note), "%s",
                                  targetsMutationState ==
                                          TargetsMutationState::Failed
                                      ? tr(UiTextId::TargetsSaveFailed)
                                      : value);
                    tone = target->favorite ? Tone::Positive : Tone::Muted;
                    break;
                }
                case 1:
                    label = tr(UiTextId::TargetsName);
                    if (target->nameLength != 0) {
                        std::memcpy(note, target->name.data(),
                                    target->nameLength);
                    } else {
                        std::snprintf(note, sizeof(note), "%s",
                                      tr(UiTextId::TargetsNameEmpty));
                    }
                    break;
                case 2:
