anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
UiRenderSnapshot captureUiRenderSnapshot() {
    return {
        true,
        uiController.page(),
        uiController.selection(),
        deviceSelection,
        interfaceSettingsController.selection(),
        interfaceSettingsController.brightnessIndex(),
        antennaStatusController.brightnessIndex(),
        static_cast<std::uint8_t>(interfaceSettingsController.theme()),
        static_cast<std::uint8_t>(languageController.active()),
        static_cast<std::uint8_t>(selfTestController.view()),
        selfTestController.selection(),
        static_cast<std::uint8_t>(wifiProductView),
        wifiProductSelection,
        static_cast<std::uint8_t>(airspaceGuardController.view()),
        airspaceGuardController.findingSelection(),
        airspaceGuardController.evidenceSelection(),
        wifiNetworkSelection,
        wifiNetworkVisibleSize(),
        wifiNetworkCatalog.revision(),
        wifiDeviceSelection,
        wifiDeviceVisibleSize(),
        wifiDeviceCatalog.revision(),
        wifiFrameCapture.deviceMonitorStats().active,
        static_cast<std::uint8_t>(bleProductView),
        bleInspectorModeSelection,
        bleDeviceSelection,
        bleDeviceVisibleSize(),
        bleDeviceCatalog.revision(),
        wifiFrameCapture.channelLoadSnapshot().revision,
        wifiFrameCapture.channelMonitorStats().active,
        static_cast<std::uint8_t>(rfSpectrumView),
        rfSpectrumSelection,
        nrf24ModeSelection,
        subGhzModeSelection,
        subGhzCaptureModeSelection,
        ccBandSelectionIndex(),
        static_cast<std::uint8_t>(spectrumViewport.mode()),
        static_cast<std::uint8_t>(surveyWorkflow.state()),
        static_cast<std::uint8_t>(surveySourceController.view()),
        surveySourceController.selection(),
        surveySourceController.selectedMask(),
        static_cast<std::uint8_t>(surveyController.view()),
        static_cast<std::uint8_t>(surveyController.filter()),
        static_cast<std::uint8_t>(surveyController.draftFilter()),
        surveyController.filterFocused(),
        surveyController.selection(),
        surveySession.size(),
        surveyController.visibleSize(),
        static_cast<std::uint8_t>(libraryController.view()),
        libraryController.selection(),
        libraryController.size(),
        static_cast<std::uint8_t>(automationCatalogStatus),
        automationPackageCatalog.selection(),
        automationPackageCatalog.size(),
        automationCatalogRefreshPending,
        automationInspectorController.model().revision,
        automationInspectionPending,
        targetsProductRuntime == nullptr
            ? static_cast<std::uint8_t>(0)
            : static_cast<std::uint8_t>(
                targetsProductRuntime->controller.view()),
        targetsProductRuntime == nullptr
            ? 0U : targetsProductRuntime->controller.navigationSelection(),
        targetsProductRuntime == nullptr
            ? 0U : targetsProductRuntime->controller.navigationCount(),
        webCompanionOverlay,
        webCompanionConnectivity.authorized(),
        static_cast<std::uint8_t>(deviceLockController.view()),
        static_cast<std::uint8_t>(deviceLockController.cursor()),
        deviceLockController.digit(),
        static_cast<std::uint8_t>(serialConsoleUiView),
        serialConsoleUiSelection,
        serialConsoleBaudIndex,
        serialConsoleDurationIndex,
        static_cast<std::uint8_t>(serialConsoleUiMode),
        static_cast<std::uint8_t>(serialConsoleUiActionStatus),
        serialConsoleEndpoint.stats().bytesReceived,
    };
}

bool renderSelectionDelta() {
    if (!renderedUi.valid || renderedUi.page != uiController.page()) return false;

    if (uiController.isRoot()) {
        const std::uint8_t current = uiController.selection();
        if (renderedUi.rootSelection == current) return false;
        const std::uint8_t oldFirst =
            homeFirstVisible(renderedUi.rootSelection);
        const std::uint8_t currentFirst = homeFirstVisible(current);
        if (oldFirst != currentFirst) {
            renderHome(false);
            return true;
        }
        renderHomeRow(renderedUi.rootSelection, currentFirst);
        renderHomeRow(current, currentFirst);
        return true;
    }

    if (uiController.page() == 7 &&
        (renderedUi.webCompanionOverlay != webCompanionOverlay ||
         renderedUi.webCompanionAuthorized !=
             webCompanionConnectivity.authorized())) {
        return false;
    }

    if (uiController.page() == kDevicePage) {
        if (renderedUi.deviceSelection == deviceSelection) return false;
        const std::uint8_t oldFirst =
            deviceFirstVisible(renderedUi.deviceSelection);
        const std::uint8_t currentFirst = deviceFirstVisible(deviceSelection);
        if (oldFirst != currentFirst) {
            renderDevicePage(false);
            return true;
        }
        renderDeviceRow(renderedUi.deviceSelection, currentFirst);
        renderDeviceRow(deviceSelection, currentFirst);
        return true;
    }

    if (uiController.page() == 8U) {
        const bool contentChanged =
            renderedUi.automationCatalogStatus !=
                static_cast<std::uint8_t>(automationCatalogStatus) ||
            renderedUi.automationSize != automationPackageCatalog.size() ||
            renderedUi.automationCatalogPending !=
                automationCatalogRefreshPending;
        if (contentChanged) return false;
        const std::size_t current = automationPackageCatalog.selection();
        if (renderedUi.automationSelection == current) return false;
        renderAutomationPackageRow(static_cast<std::uint8_t>(
            renderedUi.automationSelection));
        renderAutomationPackageRow(static_cast<std::uint8_t>(current));
        return true;
    }

    if (uiController.page() == kSerialConsolePage) {
        const bool viewChanged = renderedUi.serialConsoleView !=
            static_cast<std::uint8_t>(serialConsoleUiView);
        const bool changed = viewChanged ||
            renderedUi.serialConsoleSelection != serialConsoleUiSelection ||
            renderedUi.serialConsoleBaudIndex != serialConsoleBaudIndex ||
            renderedUi.serialConsoleDurationIndex !=
                serialConsoleDurationIndex ||
            renderedUi.serialConsoleMode !=
                static_cast<std::uint8_t>(serialConsoleUiMode) ||
            renderedUi.serialConsoleActionStatus !=
                static_cast<std::uint8_t>(serialConsoleUiActionStatus) ||
            renderedUi.serialConsoleRxBytes !=
                serialConsoleEndpoint.stats().bytesReceived ||
            serialConsoleLiveDirty;
        if (!changed) return false;
        renderSerialConsolePage(viewChanged);
        renderNavigationFooter();
        serialConsoleLiveDirty = false;
        return true;
    }

    if (uiController.page() == kDeviceLockPage &&
        (deviceLockController.view() == DeviceLockView::EnterPin ||
         deviceLockController.view() == DeviceLockView::ConfirmPin) &&
        renderedUi.deviceLockView ==
            static_cast<std::uint8_t>(deviceLockController.view())) {
        const bool cursorChanged = renderedUi.deviceLockCursor !=
            deviceLockController.cursor();
        const bool digitChanged = renderedUi.deviceLockDigit !=
            deviceLockController.digit();
        if (!cursorChanged && !digitChanged) return true;
        // PIN navigation is a strictly local repaint. Keeping the header,
        // headline and canvas intact prevents the bright flash that a
        // full-screen clear would create while keys repeat.
        renderDeviceLockPinCells();
        if (cursorChanged) {
            renderDeviceLockPinAdvanceAction();
            renderNavigationFooter();
        }
        return true;
    }

    if (uiController.page() == 2 &&
        bleProductView == BleProductView::InspectorMenu &&
        renderedUi.bleProductView ==
            static_cast<std::uint8_t>(BleProductView::InspectorMenu)) {
        if (renderedUi.bleInspectorModeSelection ==
            bleInspectorModeSelection) {
            return true;
        }
        renderBleInspectorModeMenu(false);
        renderNavigationFooter();
        return true;
    }

    if (uiController.page() == 2 &&
        bleProductView == BleProductView::InspectorGatt &&
        renderedUi.bleProductView ==
            static_cast<std::uint8_t>(BleProductView::InspectorGatt)) {
        renderBleGattInspectorData(false);
        renderHeaderStatus();
        renderNavigationFooter();
        return true;
    }

    if (uiController.page() == 2 &&
        bleProductView == BleProductView::InspectorRaw &&
        renderedUi.bleProductView ==
            static_cast<std::uint8_t>(BleProductView::InspectorRaw)) {
        const BleInspectorCaptureSummary summary =
            bleInspectorCaptureSnapshot();
        if (bleInspectorRenderedRevision != summary.revision) {
            std::uint64_t nowUs =
                static_cast<std::uint64_t>(esp_timer_get_time());
            if (nowUs == 0U) nowUs = 1U;
            if (nextBleInspectorUiRefreshUs != 0U &&
                nowUs < nextBleInspectorUiRefreshUs) {
                return true;
            }
            nextBleInspectorUiRefreshUs =
                nowUs + kBleDeviceUiRefreshPeriodUs;
            renderBleInspectorRawData(false);
            renderHeaderStatus();
            renderNavigationFooter();
        }
        // Duplicate advertisements for other devices still wake the shared
        // survey loop. The selected-target capture revision determines the
        // exact delta; never fall through to a full-screen repaint.
        return true;
    }

    if (uiController.page() == 2 &&
        bleProductView == BleProductView::DeviceDetail &&
        renderedUi.bleProductView ==
            static_cast<std::uint8_t>(BleProductView::DeviceDetail)) {
        const bool catalogChanged =
            renderedUi.bleDeviceRevision != bleDeviceCatalog.revision();
        if (!catalogChanged && !bleDeviceUiRefreshPending) {
            // A scan-window event can request a render even when it produced
            // no new fact for the selected device. Returning false here would
            // invoke the generic full-screen fallback and visibly blink the
            // otherwise unchanged card.
            ++bleDeviceDetailRefreshesDeferred;
            return true;
        }
        std::uint64_t nowUs =
            static_cast<std::uint64_t>(esp_timer_get_time());
        if (nowUs == 0U) nowUs = 1U;
        if (nextBleDeviceUiRefreshUs != 0U &&
            nowUs < nextBleDeviceUiRefreshUs) {
            bleDeviceUiRefreshPending = true;
            ++bleDeviceDetailRefreshesDeferred;
            // Acknowledge the catalog revision without falling through to a
            // full screen repaint. A later passive sample will publish the
            // most recent aggregate at the bounded four-Hz visual cadence.
            return true;
        }
        nextBleDeviceUiRefreshUs =
            nowUs + kBleDeviceUiRefreshPeriodUs;
        bleDeviceUiRefreshPending = false;
        ++bleDeviceDetailRefreshes;
        const Observation& live = *liveBleDeviceDetail();
        const BleDeviceSignalStats& signal = *liveBleDeviceSignal();
        if (bleDeviceDetailStaticFieldsDiffer(
                bleDeviceRenderedDetail, live)) {
            // Advertising devices may alternate packet shapes under one
            // address. Replace complete user-visible rows atomically instead
            // of clearing and redrawing the complete card.
            renderBleDeviceStaticFields(live, true);
        }
        renderBleDeviceRadar(live, signal, false);
        bleDeviceDetail = live;
        bleDeviceDetailSignal = signal;
        bleDeviceRenderedDetail = live;
        return true;
    }

    if (uiController.page() == 2 &&
        bleProductView == BleProductView::Devices &&
        renderedUi.bleProductView ==
            static_cast<std::uint8_t>(BleProductView::Devices)) {
        const std::size_t current = bleDeviceSelection;
        const std::size_t oldFirst =
            bleDeviceFirstVisible(renderedUi.bleDeviceSelection);
        const std::size_t currentFirst = bleDeviceFirstVisible(current);
        const bool dataChanged =
            renderedUi.bleDeviceSize != bleDeviceVisibleSize() ||
            renderedUi.bleDeviceRevision != bleDeviceCatalog.revision();
        const bool stateChanged = renderedUi.surveyState !=
            static_cast<std::uint8_t>(surveyWorkflow.state());
        const bool selectionChanged =
            renderedUi.bleDeviceSelection != current;
        if (dataChanged || oldFirst != currentFirst || selectionChanged ||
            stateChanged) {
            // The visible-row cache compares final pixels, so a catalog
            // revision repaints only rows whose user-facing content changed.
            renderBleDevicesData(false);
        }
        if (stateChanged) {
            display.fillRect(128, 0, Layout::ScreenWidth - 128,
                             Layout::HeaderHeight, Palette::Header);
            renderHeaderStatus();
            renderNavigationFooter();
        }
        // The shared survey worker can report a duplicate advertisement.
        // Nothing visible changed, so acknowledge the refresh without a
        // fallback full-screen repaint.
        return true;
    }

    if (uiController.page() == 2 &&
        wifiProductView == WifiProductView::Menu &&
        renderedUi.wifiProductView ==
            static_cast<std::uint8_t>(WifiProductView::Menu)) {
        if (renderedUi.wifiProductSelection == wifiProductSelection) {
            return false;
        }
        const std::uint8_t oldFirst = wifiProductFirstVisible(
            renderedUi.wifiProductSelection);
        const std::uint8_t currentFirst = wifiProductFirstVisible(
            wifiProductSelection);
        if (oldFirst != currentFirst) {
            renderWifiProductMenu(false);
            renderNavigationFooter();
            return true;
        }
        renderWifiProductRow(renderedUi.wifiProductSelection, currentFirst);
        renderWifiProductRow(wifiProductSelection, currentFirst);
        renderNavigationFooter();
        return true;
    }

    if (uiController.page() == 2 &&
        wifiProductView == WifiProductView::AirspaceGuard &&
        renderedUi.wifiProductView ==
            static_cast<std::uint8_t>(WifiProductView::AirspaceGuard) &&
        renderedUi.airspaceGuardView == static_cast<std::uint8_t>(
            airspaceGuardController.view())) {
        if (airspaceGuardController.view() !=
                AirspaceGuardView::EvidenceList ||
            renderedUi.airspaceGuardEvidenceSelection ==
                airspaceGuardController.evidenceSelection()) {
            return false;
        }
        // Evidence navigation repaints the compact report content only. The
        // display is never cleared, so physical-key repeats cannot create a
        // bright full-screen flash.
        renderAirspaceGuardPage(false);
        renderNavigationFooter();
        return true;
    }

    if (uiController.page() == 2 &&
        wifiProductView == WifiProductView::AuthenticationCapture &&
        renderedUi.wifiProductView == static_cast<std::uint8_t>(
            WifiProductView::AuthenticationCapture)) {
        // Preparing, running, cancelling and terminal states share fixed
        // geometry. Repaint only semantic rows; the target/header and footer
        // stay untouched so lifecycle transitions cannot flash the display.
        renderWifiAuthenticationCapture(false);
        renderNavigationFooter();
        return true;
    }

    if (uiController.page() == 2 &&
        wifiProductView == WifiProductView::Networks &&
        surveyWorkflow.state() == SurveyWorkflowState::Running &&
        renderedUi.wifiProductView ==
            static_cast<std::uint8_t>(WifiProductView::Networks)) {
        const std::size_t current = wifiNetworkSelection;
        const std::size_t oldFirst =
            wifiNetworkFirstVisible(renderedUi.wifiNetworkSelection);
        const std::size_t currentFirst = wifiNetworkFirstVisible(current);
        const bool dataChanged = productSurveyIncrementalRefreshPending ||
            renderedUi.wifiNetworkSize != wifiNetworkVisibleSize() ||
            renderedUi.wifiNetworkRevision != wifiNetworkCatalog.revision();
        if (dataChanged || oldFirst != currentFirst) {
            const bool clearRows = oldFirst != currentFirst ||
                renderedUi.wifiNetworkSize == 0 ||
                wifiNetworkVisibleSize() == 0;
            if (clearRows) {
                display.fillRect(
                    Layout::Edge, Layout::ContentTop, Layout::ContentWidth,
                    Layout::FooterDividerY - Layout::ContentTop,
                    Palette::Canvas);
                renderWifiNetworksData();
            } else {
                const std::size_t end = wifiNetworkVisibleSize() <
                        currentFirst + kVisibleWifiNetworkRows
                    ? wifiNetworkVisibleSize()
                    : currentFirst + kVisibleWifiNetworkRows;
                for (std::size_t index = currentFirst; index < end; ++index) {
                    renderWifiNetworkRow(index, currentFirst);
                }
            }
            if (renderedUi.surveyState !=
                static_cast<std::uint8_t>(SurveyWorkflowState::Running)) {
                display.fillRect(128, 0, Layout::ScreenWidth - 128,
                                 Layout::HeaderHeight, Palette::Header);
                renderHeaderStatus();
                renderNavigationFooter();
            }
            return true;
        }
        if (renderedUi.wifiNetworkSelection == current) return false;
        renderWifiNetworkRow(renderedUi.wifiNetworkSelection, currentFirst);
        renderWifiNetworkRow(current, currentFirst);
        return true;
    }

    if (uiController.page() == 2 &&
        wifiProductView == WifiProductView::NetworkDetail &&
        renderedUi.wifiProductView ==
            static_cast<std::uint8_t>(WifiProductView::NetworkDetail)) {
        if (renderedUi.wifiNetworkRevision == wifiNetworkCatalog.revision()) {
            return false;
        }
        const Observation& live = *liveWifiNetworkDetail();
        const WifiNetworkSignalStats& signal = *liveWifiNetworkSignal();
        if (wifiNetworkDetailStaticFieldsDiffer(
                wifiNetworkRenderedDetail, live)) {
            renderWifiNetworkDetailData();
        } else {
            renderWifiNetworkRadar(live, signal, false);
            wifiNetworkDetail = live;
            wifiNetworkDetailSignal = signal;
            wifiNetworkRenderedDetail = live;
        }
        return true;
    }

    if (uiController.page() == 2 &&
        wifiProductView == WifiProductView::DeviceDetail &&
        renderedUi.wifiProductView ==
            static_cast<std::uint8_t>(WifiProductView::DeviceDetail)) {
        if (renderedUi.wifiDeviceRevision == wifiDeviceCatalog.revision()) {
            return false;
        }
        renderWifiDeviceDetailLiveData(false);
        return true;
    }

    if (uiController.page() == 2 &&
        wifiProductView == WifiProductView::Devices &&
        renderedUi.wifiProductView ==
            static_cast<std::uint8_t>(WifiProductView::Devices)) {
        const std::size_t current = wifiDeviceSelection;
        const std::size_t oldFirst =
            wifiDeviceFirstVisible(renderedUi.wifiDeviceSelection);
        const std::size_t currentFirst = wifiDeviceFirstVisible(current);
        const bool dataChanged =
            renderedUi.wifiDeviceSize != wifiDeviceVisibleSize() ||
            renderedUi.wifiDeviceRevision != wifiDeviceCatalog.revision() ||
            renderedUi.wifiDeviceActive !=
                wifiFrameCapture.deviceMonitorStats().active;
        if (dataChanged || oldFirst != currentFirst) {
            const bool clearRows = oldFirst != currentFirst ||
                renderedUi.wifiDeviceSize == 0U ||
                wifiDeviceVisibleSize() == 0U;
            if (clearRows) {
                display.fillRect(
                    Layout::Edge, Layout::ContentTop, Layout::ContentWidth,
                    Layout::FooterDividerY - Layout::ContentTop,
                    Palette::Canvas);
                renderWifiDevicesData();
            } else {
                const std::size_t end = wifiDeviceVisibleSize() <
                        currentFirst + kVisibleWifiNetworkRows
                    ? wifiDeviceVisibleSize()
                    : currentFirst + kVisibleWifiNetworkRows;
                for (std::size_t index = currentFirst; index < end; ++index) {
                    renderWifiDeviceRow(index, currentFirst);
                }
            }
            return true;
        }
        if (renderedUi.wifiDeviceSelection == current) return false;
        renderWifiDeviceRow(renderedUi.wifiDeviceSelection, currentFirst);
        renderWifiDeviceRow(current, currentFirst);
        return true;
    }

    if (uiController.page() == 2 &&
        wifiProductView == WifiProductView::Channels &&
        renderedUi.wifiProductView ==
            static_cast<std::uint8_t>(WifiProductView::Channels)) {
        const auto stats = wifiFrameCapture.channelMonitorStats();
        if (renderedUi.wifiChannelActive != stats.active) return false;
        const auto snapshot = wifiFrameCapture.channelLoadSnapshot();
        if (renderedUi.wifiChannelRevision == snapshot.revision) return false;
        renderWifiChannelsData(false);
        return true;
    }

    if (uiController.page() == 2 &&
        rfSpectrumView == RfSpectrumView::SourceMenu &&
        renderedUi.rfSpectrumView ==
            static_cast<std::uint8_t>(RfSpectrumView::SourceMenu)) {
        const std::uint8_t current = rfSpectrumSelection;
        if (renderedUi.rfSpectrumSelection == current) return false;
        renderRfSpectrumSourceRow(renderedUi.rfSpectrumSelection);
        renderRfSpectrumSourceRow(current);
        renderNavigationFooter();
        return true;
    }

    if (uiController.page() == 2 &&
        rfSpectrumView == RfSpectrumView::Nrf24Menu &&
        renderedUi.rfSpectrumView ==
            static_cast<std::uint8_t>(RfSpectrumView::Nrf24Menu)) {
        const std::uint8_t current = nrf24ModeSelection;
        if (renderedUi.nrf24ModeSelection == current) return false;
        renderNrf24ModeRow(renderedUi.nrf24ModeSelection, false);
        renderNrf24ModeRow(current, true);
        renderNavigationFooter();
        return true;
    }

    if (uiController.page() == 2 &&
        rfSpectrumView == RfSpectrumView::SubGhzMenu &&
        renderedUi.rfSpectrumView ==
            static_cast<std::uint8_t>(RfSpectrumView::SubGhzMenu)) {
        const std::uint8_t current = subGhzModeSelection;
        if (renderedUi.subGhzModeSelection == current) return false;
        renderSubGhzModeRow(renderedUi.subGhzModeSelection, false);
        renderSubGhzModeRow(current, true);
        renderNavigationFooter();
        return true;
    }

    if (uiController.page() == 2 &&
        rfSpectrumView == RfSpectrumView::SubGhzCaptureModeMenu &&
        renderedUi.rfSpectrumView == static_cast<std::uint8_t>(
            RfSpectrumView::SubGhzCaptureModeMenu)) {
        const std::uint8_t current = subGhzCaptureModeSelection;
        if (renderedUi.subGhzCaptureModeSelection == current) return false;
        renderSubGhzCaptureModeMenu(false);
        renderNavigationFooter();
        return true;
    }

