anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    if (uiController.page() == 2 &&
        (rfSpectrumView == RfSpectrumView::CcBandMenu ||
         rfSpectrumView == RfSpectrumView::SubGhzCaptureBandMenu) &&
        renderedUi.rfSpectrumView ==
            static_cast<std::uint8_t>(rfSpectrumView)) {
        const std::uint8_t current = ccBandSelectionIndex();
        if (renderedUi.rfCcBandSelection == current) return false;
        renderRfCcBandRow(renderedUi.rfCcBandSelection);
        renderRfCcBandRow(current);
        renderNavigationFooter();
        return true;
    }

    if (uiController.page() == 2 &&
        surveyWorkflow.state() == SurveyWorkflowState::Setup &&
        renderedUi.surveyState ==
            static_cast<std::uint8_t>(SurveyWorkflowState::Setup) &&
        renderedUi.surveySetupView ==
            static_cast<std::uint8_t>(surveySourceController.view()) &&
        renderedUi.surveySourceMask == surveySourceController.selectedMask()) {
        const std::uint8_t current = surveySourceController.selection();
        if (renderedUi.surveySetupSelection == current) return false;
        if (surveySourceController.view() == SurveySetupView::Sources) {
            renderSurveySourceRow(renderedUi.surveySetupSelection);
            renderSurveySourceRow(current);
        } else {
            renderSurveyPlanRow(renderedUi.surveySetupSelection);
            renderSurveyPlanRow(current);
        }
        renderNavigationFooter();
        return true;
    }

    if (uiController.page() == 2 &&
        surveyWorkflow.state() == SurveyWorkflowState::Running &&
        surveyController.view() == SurveyView::Filter &&
        renderedUi.surveyState ==
            static_cast<std::uint8_t>(SurveyWorkflowState::Running) &&
        renderedUi.surveyView == static_cast<std::uint8_t>(SurveyView::Filter) &&
        renderedUi.surveySize == surveySession.size()) {
        const std::uint8_t current =
            static_cast<std::uint8_t>(surveyController.draftFilter());
        if (renderedUi.surveyDraftFilter == current) return false;
        renderSurveyFilterOption(renderedUi.surveyDraftFilter);
        renderSurveyFilterOption(current);
        renderNavigationFooter();
        return true;
    }

    if (uiController.page() == 2 &&
        surveyWorkflow.state() == SurveyWorkflowState::Running &&
        surveyController.view() == SurveyView::List &&
        renderedUi.surveyState ==
            static_cast<std::uint8_t>(SurveyWorkflowState::Running) &&
        renderedUi.surveyView == static_cast<std::uint8_t>(SurveyView::List) &&
        renderedUi.surveyFilter ==
            static_cast<std::uint8_t>(surveyController.filter())) {
        const std::size_t current = surveyController.selection();
        const bool currentFilterFocused = surveyController.filterFocused();
        if (productSurveyIncrementalRefreshPending) {
            renderSurveyFilterBar();
            display.fillRect(Layout::Edge, kSurveyRowsY, Layout::ContentWidth,
                             92, Palette::Canvas);
            const std::size_t first = surveyFirstVisible(current);
            const std::size_t end =
                surveyController.visibleSize() < first + kVisibleSurveyRows
                    ? surveyController.visibleSize()
                    : first + kVisibleSurveyRows;
            for (std::size_t index = first; index < end; ++index) {
                renderSurveyListRow(index, first);
            }
            return true;
        }
        if (renderedUi.surveySelection == current &&
            renderedUi.surveyFilterFocused == currentFilterFocused) return false;
        if (renderedUi.surveyFilterFocused != currentFilterFocused) {
            renderSurveyFilterBar();
            if (!renderedUi.surveyFilterFocused) {
                renderSurveyListRow(renderedUi.surveySelection,
                                    surveyFirstVisible(renderedUi.surveySelection));
            }
            if (!currentFilterFocused) {
                renderSurveyListRow(current, surveyFirstVisible(current));
            }
            renderNavigationFooter();
            return true;
        }
        const std::size_t oldFirst =
            surveyFirstVisible(renderedUi.surveySelection);
        const std::size_t currentFirst = surveyFirstVisible(current);
        if (oldFirst == currentFirst) {
            renderSurveyListRow(renderedUi.surveySelection, currentFirst);
            renderSurveyListRow(current, currentFirst);
        } else {
            display.fillRect(Layout::Edge, kSurveyRowsY, Layout::ContentWidth, 92,
                             Palette::Canvas);
            const std::size_t end =
                surveyController.visibleSize() < currentFirst + kVisibleSurveyRows
                    ? surveyController.visibleSize()
                    : currentFirst + kVisibleSurveyRows;
            for (std::size_t index = currentFirst; index < end; ++index) {
                renderSurveyListRow(index, currentFirst);
            }
        }
        return true;
    }

    if (uiController.page() == 3 &&
        libraryController.view() == LibraryView::SessionList &&
        renderedUi.libraryView ==
            static_cast<std::uint8_t>(LibraryView::SessionList) &&
        renderedUi.librarySize == libraryController.size()) {
        const std::size_t current = libraryController.selection();
        if (renderedUi.librarySelection == current) return false;
        renderLibraryListRow(renderedUi.librarySelection);
        renderLibraryListRow(current);
        return true;
    }

    if (uiController.page() == 7 && targetsProductRuntime != nullptr &&
        (targetsProductRuntime->controller.view() == TargetsView::List ||
         targetsProductRuntime->controller.view() == TargetsView::Compare) &&
        renderedUi.targetsView == static_cast<std::uint8_t>(
            targetsProductRuntime->controller.view()) &&
        renderedUi.targetsSize ==
            targetsProductRuntime->controller.navigationCount()) {
        const TargetsController& controller =
            targetsProductRuntime->controller;
        const std::size_t current = controller.navigationSelection();
        if (renderedUi.targetsSelection == current) return false;
        const std::size_t oldFirst =
            targetsFirstVisible(renderedUi.targetsSelection);
        const std::size_t currentFirst = targetsFirstVisible(current);
        if (oldFirst != currentFirst) {
            display.fillRect(
                Layout::Edge, Layout::ContentTop, Layout::ContentWidth,
                Layout::FooterDividerY - Layout::ContentTop,
                Palette::Canvas);
            renderTargetsPage(false);
            return true;
        }
        if (controller.view() == TargetsView::Compare) {
            renderTargetComparisonRow(renderedUi.targetsSelection,
                                      currentFirst);
            renderTargetComparisonRow(current, currentFirst);
        } else {
            renderTargetListRow(renderedUi.targetsSelection, currentFirst);
            renderTargetListRow(current, currentFirst);
        }
        return true;
    }

    if (uiController.page() == 5) {
        if (renderedUi.settingsLanguage !=
                static_cast<std::uint8_t>(languageController.active()) ||
            renderedUi.settingsTheme != static_cast<std::uint8_t>(
                interfaceSettingsController.theme())) {
            return false;
        }
        const std::uint8_t current = interfaceSettingsController.selection();
        if (renderedUi.settingsSelection != current) {
            const std::uint8_t oldFirst = settingsFirstVisible(
                renderedUi.settingsSelection);
            const std::uint8_t currentFirst = settingsFirstVisible(current);
            if (oldFirst != currentFirst) {
                renderSettingsPage(false);
                return true;
            }
            renderSettingsRow(renderedUi.settingsSelection, currentFirst);
            renderSettingsRow(current, currentFirst);
            return true;
        }
        if (renderedUi.settingsBrightnessIndex !=
            interfaceSettingsController.brightnessIndex()) {
            renderSettingsRow(static_cast<std::uint8_t>(
                InterfaceSetting::Brightness), settingsFirstVisible(current));
            return true;
        }
        if (renderedUi.settingsAntennaLedBrightnessIndex !=
            antennaStatusController.brightnessIndex()) {
            renderSettingsRow(static_cast<std::uint8_t>(
                InterfaceSetting::AntennaLeds),
                settingsFirstVisible(current));
            return true;
        }
        return false;
    }

