anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    if (uiController.page() == 6 &&
        selfTestController.view() == SelfTestView::ModeMenu &&
        renderedUi.selfTestView ==
            static_cast<std::uint8_t>(SelfTestView::ModeMenu)) {
        const std::uint8_t current = selfTestController.selection();
        if (renderedUi.selfTestSelection == current) return false;
        renderSelfTestModeRow(renderedUi.selfTestSelection);
        renderSelfTestModeRow(current);
        return true;
    }
    return false;
}

void renderInteractiveScreen(bool clearContent) {
    std::uint64_t startedUs = static_cast<std::uint64_t>(esp_timer_get_time());
    if (startedUs == 0) startedUs = 1;
    display.startWrite();
    const bool protectedUiBlocked =
        deviceLockProtectedPage(uiController.page()) &&
        !deviceLockOperationAllowed(
            leshy1::services::security::DeviceLockOperation::ProtectedUi);
    const bool incremental = !safetySupervisor.latched() &&
        !protectedUiBlocked && !clearContent && renderSelectionDelta();
    if (!incremental) {
        clearContent = true;
        if (safetySupervisor.latched()) {
            renderSafetyStop(clearContent);
        } else if (protectedUiBlocked) {
            renderDeviceLockBlockedPage(clearContent);
        } else if (uiController.isRoot()) {
            renderHome(clearContent);
        } else if (uiController.page() == 1) {
            renderOverview(clearContent);
        } else if (uiController.page() == 2) {
            renderInventoryPage(clearContent);
        } else if (uiController.page() == 3) {
            renderLibraryPage(clearContent);
        } else if (uiController.page() == 4) {
            renderCapturePage(clearContent);
        } else if (uiController.page() == 5) {
            renderSettingsPage(clearContent);
        } else if (uiController.page() == 6) {
            renderSelfTestPage(clearContent);
        } else if (uiController.page() == 7) {
            renderTargetsPage(clearContent);
        } else if (uiController.page() == 8U) {
            renderAutomationLibraryPage(clearContent);
        } else if (uiController.page() == kAutomationInspectorPage) {
            renderAutomationInspectorPage(clearContent);
        } else if (uiController.page() == kDevicePage) {
            renderDevicePage(clearContent);
        } else if (uiController.page() == kPowerPage) {
            renderPowerPage(clearContent);
        } else if (uiController.page() == kDeviceLockPage) {
            renderDeviceLockPage(clearContent);
        } else if (uiController.page() == kSerialConsolePage) {
            renderSerialConsolePage(clearContent);
        } else {
            renderAboutPage(clearContent);
        }
        const Rect divider = Components::footerDivider();
        display.drawFastHLine(divider.x, divider.y, divider.width,
                              Palette::Divider);
        renderNavigationFooter();
        // As in 0.x MenuScreen::repaint, focus movement leaves chrome untouched.
    }
    display.endWrite();
    renderedUi = captureUiRenderSnapshot();
    const std::uint64_t finishedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    lastUiRenderWasIncremental = incremental;
    lastUiRenderUs = finishedUs >= startedUs ? finishedUs - startedUs : 0;
}

bool spectrumViewportWorkspaceAvailable() {
    // The Session member may be referenced by persistent controllers, but it
    // is touched only while one of these bounded workers is active. Refuse the
    // spectrum before acquiring RF instead of overlapping union lifetimes.
    return targetsStoreCodecWorkspaceOwner ==
               TargetsStoreCodecWorkspaceOwner::Session &&
        productSurveyControl() == ProductSurveyWorkerControl::Idle &&
        !productSurveyScanActive() &&
        surveyWorkflow.state() != SurveyWorkflowState::Running &&
        targetsMutationTaskHandle == nullptr &&
        captureStoreTaskHandle == nullptr &&
        subGhzCaptureStoreTaskHandle == nullptr &&
        infraredCaptureStoreTaskHandle == nullptr;
}

SpectrumViewport* acquireSpectrumViewportWorkspace() {
    if (!spectrumViewportWorkspaceAvailable() || spectrumViewport.bound()) {
        return nullptr;
    }
    surveyWorkflow.bindWorkspace(nullptr);
    targetsStoreCodecWorkspace.session.~SessionStoreWorkspace();
    auto* viewport = new (&targetsStoreCodecWorkspace.spectrum)
        SpectrumViewport();
    targetsStoreCodecWorkspaceOwner =
        TargetsStoreCodecWorkspaceOwner::Spectrum;
    spectrumViewport.bind(viewport);
    return viewport;
}

void releaseSpectrumViewportWorkspace(SpectrumViewport* viewport) {
    if (targetsStoreCodecWorkspaceOwner !=
            TargetsStoreCodecWorkspaceOwner::Spectrum ||
        viewport != &targetsStoreCodecWorkspace.spectrum) {
        return;
    }
    spectrumViewport.unbind(viewport);
    viewport->~SpectrumViewport();
    new (&targetsStoreCodecWorkspace.session)
        leshy1::storage::SessionStoreWorkspace();
    targetsStoreCodecWorkspaceOwner =
        TargetsStoreCodecWorkspaceOwner::Session;
    surveyWorkflow.bindWorkspace(&targetsStoreCodecWorkspace.session);
}

void releaseSpectrumViewportWorkspace() {
    releaseSpectrumViewportWorkspace(&targetsStoreCodecWorkspace.spectrum);
}

bool startNrf24Receiver(bool finder) {
    nrf24SpectrumController.reset();
    nrf24SignalFinder.reset();
    if (!finder) {
        SpectrumViewport* viewport = acquireSpectrumViewportWorkspace();
        if (viewport == nullptr ||
            !spectrumViewport.reset(Nrf24SpectrumController::kChannelCount)) {
            releaseSpectrumViewportWorkspace(viewport);
            nrf24SpectrumController.fail();
            nrf24SpectrumReport = {};
            rfSpectrumKind = RfSpectrumKind::Nrf24;
            rfSpectrumView = RfSpectrumView::Live;
            nextSpectrumUiRefreshUs = 0;
            resetSpectrumWaterfallTiming();
            lastRuntimeEvent = "nrf24_spectrum_workspace_unavailable";
            return true;
        }
    }
    spectrumRenderedIntensity.fill(kSpectrumRenderedIntensityInvalid);
    nrf24SpectrumReport = {};
    std::uint64_t startedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (startedUs == 0) startedUs = 1;
    const bool owned = resourceBroker.ownerOf(Resource::RadioSpi) ==
        AppRuntime::kForegroundOwner;
    const Nrf24PassiveSpectrumPlan plan =
        leshy1::drivers::radio::defaultNrf24PassiveSpectrumPlan();
    const bool hardwareReady = boardNrf24Spectrum.begin(
        owned, plan, &nrf24SpectrumReport);
    const bool started = hardwareReady && nrf24SpectrumController.start(
        nrf24SpectrumReport.detectedModules, startedUs) &&
        (!finder || nrf24SignalFinder.start(
            nrf24SpectrumReport.detectedModules, startedUs));
    if (!started) {
        boardNrf24Spectrum.end();
        nrf24SpectrumController.fail();
        if (finder) nrf24SignalFinder.fail();
        if (!finder) releaseSpectrumViewportWorkspace();
    }
    rfSpectrumKind = RfSpectrumKind::Nrf24;
    rfSpectrumView = finder ? RfSpectrumView::Nrf24Finder
                            : RfSpectrumView::Live;
    nextSpectrumUiRefreshUs = startedUs;
    resetSpectrumWaterfallTiming();
    if (!finder) armSpectrumWaterfallForCurrentReceiver();
    nrf24SpectrumChunkMaxUs = 0;
    nrf24FinderRenderedHeights.fill(0);
    nrf24FinderRenderedRevision = UINT32_MAX;
    nrf24FinderRenderedState = Nrf24SignalFinderState::Idle;
    nrf24FinderRenderedChannel = 0xffU;
    nrf24FinderRenderedFound = false;
    lastRuntimeEvent = started
        ? (finder ? "nrf24_finder_calibrating" : "nrf24_spectrum_running")
        : (finder ? "nrf24_finder_start_failed"
                  : "nrf24_spectrum_start_failed");
    return true;
}

bool startNrf24Spectrum() { return startNrf24Receiver(false); }

bool startNrf24Finder() { return startNrf24Receiver(true); }

bool stopNrf24Spectrum(bool returnToSourceMenu) {
    const bool cleanup = boardNrf24Spectrum.end();
    if (nrf24SpectrumController.state() != Nrf24SpectrumViewState::Idle) {
        nrf24SpectrumController.stop();
    }
    if (nrf24SignalFinder.state() != Nrf24SignalFinderState::Idle) {
        nrf24SignalFinder.stop();
    }
    releaseSpectrumViewportWorkspace();
    const bool direct = std::strcmp(appRuntime.activeApp(), "spectrum24") == 0;
    rfSpectrumView = returnToSourceMenu
        ? RfSpectrumView::SourceMenu
        : (direct ? RfSpectrumView::Nrf24Menu : RfSpectrumView::None);
    nextSpectrumUiRefreshUs = 0;
    lastRuntimeEvent = cleanup ? "nrf24_spectrum_stopped"
                               : "nrf24_spectrum_cleanup_failed";
    return true;
}

