anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void serviceNrf24Spectrum() {
    const bool finder = rfSpectrumView == RfSpectrumView::Nrf24Finder;
    if ((!finder && rfSpectrumView != RfSpectrumView::Live) ||
        rfSpectrumKind != RfSpectrumKind::Nrf24 ||
        nrf24SpectrumController.state() !=
            Nrf24SpectrumViewState::Running) {
        return;
    }
    const std::uint32_t finderRevision = nrf24SignalFinder.revision();
    Nrf24PassiveSweep sweep;
    const bool valid = boardNrf24Spectrum.sampleChunk(&sweep) &&
                       nrf24SpectrumController.ingest(sweep) &&
                       (!finder || nrf24SignalFinder.ingest(sweep));
    if (!valid) {
        boardNrf24Spectrum.end();
        nrf24SpectrumController.fail();
        if (finder) nrf24SignalFinder.fail();
        if (!finder) releaseSpectrumViewportWorkspace();
        lastRuntimeEvent = finder ? "nrf24_finder_runtime_fault"
                                  : "nrf24_spectrum_runtime_fault";
        renderInteractiveScreen(true);
        return;
    }
    const std::uint64_t chunkUs = sweep.endedUs - sweep.startedUs;
    if (chunkUs > nrf24SpectrumChunkMaxUs) {
        nrf24SpectrumChunkMaxUs = chunkUs;
    }
    if (finder) {
        if (nrf24SignalFinder.revision() != finderRevision &&
            !uiController.isRoot() && uiController.page() == 2) {
            display.startWrite();
            renderNrf24FinderResult(false);
            renderNrf24FinderGraph(false);
            display.endWrite();
            lastRuntimeEvent = nrf24SignalFinder.found()
                ? "nrf24_finder_signal_found"
                : (nrf24SignalFinder.calibrated()
                       ? "nrf24_finder_waiting"
                       : "nrf24_finder_calibrating");
        }
        return;
    }
    const std::uint64_t refreshUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (!uiController.isRoot() && uiController.page() == 2 &&
        spectrumViewport.mode() == SpectrumDisplayMode::Spectrum &&
        refreshUs >= nextSpectrumUiRefreshUs) {
        display.startWrite();
        renderSpectrumBars();
        display.endWrite();
        nextSpectrumUiRefreshUs = refreshUs + 100000ULL;
    }
}

bool startCc1101Spectrum(
    leshy1::drivers::radio::Cc1101SpectrumBand band) {
    cc1101SpectrumController.reset();
    SpectrumViewport* viewport = acquireSpectrumViewportWorkspace();
    if (viewport == nullptr ||
        !spectrumViewport.reset(Cc1101SpectrumController::kBinCount)) {
        releaseSpectrumViewportWorkspace(viewport);
        cc1101SpectrumController.fail();
        cc1101SpectrumReport = {};
        rfSpectrumKind = RfSpectrumKind::Cc1101;
        rfSpectrumView = RfSpectrumView::Live;
        nextSpectrumUiRefreshUs = 0;
        resetSpectrumWaterfallTiming();
        lastRuntimeEvent = "cc1101_spectrum_workspace_unavailable";
        return true;
    }
    spectrumRenderedIntensity.fill(kSpectrumRenderedIntensityInvalid);
    cc1101SpectrumReport = {};
    std::uint64_t startedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (startedUs == 0) startedUs = 1;
    const bool owned = resourceBroker.ownerOf(Resource::RadioSpi) ==
        AppRuntime::kForegroundOwner;
    const bool hardwareReady = boardCc1101Spectrum.begin(
        owned, &cc1101SpectrumReport);
    const bool started = hardwareReady &&
        cc1101SpectrumController.start(band, startedUs);
    if (!started) {
        boardCc1101Spectrum.end();
        cc1101SpectrumController.fail();
        releaseSpectrumViewportWorkspace();
    }
    rfSpectrumKind = RfSpectrumKind::Cc1101;
    rfSpectrumView = RfSpectrumView::Live;
    nextSpectrumUiRefreshUs = startedUs;
    resetSpectrumWaterfallTiming();
    armSpectrumWaterfallForCurrentReceiver();
    lastRuntimeEvent = started ? "cc1101_spectrum_running"
                               : "cc1101_spectrum_start_failed";
    return true;
}

bool startCc1101Finder() {
    cc1101SignalFinder.reset();
    cc1101SpectrumReport = {};
    std::uint64_t startedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (startedUs == 0U) startedUs = 1U;
    const bool owned = resourceBroker.ownerOf(Resource::RadioSpi) ==
        AppRuntime::kForegroundOwner;
    const bool hardwareReady = boardCc1101Spectrum.begin(
        owned, &cc1101SpectrumReport);
    const bool started = hardwareReady &&
        cc1101SignalFinder.start(startedUs);
    if (!started) {
        boardCc1101Spectrum.end();
        cc1101SignalFinder.fail();
    }
    rfSpectrumKind = RfSpectrumKind::Cc1101;
    rfSpectrumView = RfSpectrumView::CcFinder;
    ccFinderRenderedHeights.fill(0);
    ccFinderRenderedRevision = UINT32_MAX;
    ccFinderRenderedState = Cc1101SignalFinderState::Idle;
    ccFinderRenderedFrequencyKHz = UINT32_MAX;
    ccFinderRenderedFound = false;
    lastRuntimeEvent = started ? "cc1101_finder_calibrating"
                               : "cc1101_finder_start_failed";
    return true;
}

bool stopCc1101Finder() {
    const bool cleanup = boardCc1101Spectrum.end();
    if (cc1101SignalFinder.state() != Cc1101SignalFinderState::Idle) {
        cc1101SignalFinder.stop();
    }
    rfSpectrumView = RfSpectrumView::SubGhzMenu;
    nextSpectrumUiRefreshUs = 0;
    lastRuntimeEvent = cleanup ? "cc1101_finder_stopped"
                               : "cc1101_finder_cleanup_failed";
    return true;
}

bool stopCc1101Spectrum(bool returnToSourceMenu) {
    const bool cleanup = boardCc1101Spectrum.end();
    if (cc1101SpectrumController.state() !=
        Cc1101SpectrumViewState::Idle) {
        cc1101SpectrumController.stop();
    }
    if (cc1101SignalFinder.state() != Cc1101SignalFinderState::Idle) {
        cc1101SignalFinder.stop();
    }
    releaseSpectrumViewportWorkspace();
    rfSpectrumView = returnToSourceMenu ? RfSpectrumView::CcBandMenu
                                        : RfSpectrumView::None;
    nextSpectrumUiRefreshUs = 0;
    lastRuntimeEvent = cleanup ? "cc1101_spectrum_stopped"
                               : "cc1101_spectrum_cleanup_failed";
    return true;
}

bool stopCurrentSpectrum(bool returnToSourceMenu) {
    return rfSpectrumKind == RfSpectrumKind::Cc1101
        ? stopCc1101Spectrum(returnToSourceMenu)
        : stopNrf24Spectrum(returnToSourceMenu);
}

void serviceCc1101Spectrum() {
    if (rfSpectrumView != RfSpectrumView::Live ||
        rfSpectrumKind != RfSpectrumKind::Cc1101 ||
        cc1101SpectrumController.state() !=
            Cc1101SpectrumViewState::Running) {
        return;
    }
    Cc1101PassiveSample sample;
    const bool valid = boardCc1101Spectrum.sample(
        cc1101SpectrumController.plan(),
        cc1101SpectrumController.nextBin(), &sample) &&
        cc1101SpectrumController.ingest(sample);
    if (!valid) {
        boardCc1101Spectrum.end();
        cc1101SpectrumController.fail();
        releaseSpectrumViewportWorkspace();
        lastRuntimeEvent = "cc1101_spectrum_runtime_fault";
        renderInteractiveScreen(true);
        return;
    }
    const std::uint64_t refreshUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (cc1101SpectrumController.nextBin() == 0 &&
        !uiController.isRoot() && uiController.page() == 2 &&
        spectrumViewport.mode() == SpectrumDisplayMode::Spectrum &&
        refreshUs >= nextSpectrumUiRefreshUs) {
        display.startWrite();
        renderSpectrumBars();
        display.endWrite();
        nextSpectrumUiRefreshUs = refreshUs + 100000ULL;
    }
}

void serviceCc1101Finder() {
    if (rfSpectrumView != RfSpectrumView::CcFinder ||
        rfSpectrumKind != RfSpectrumKind::Cc1101 ||
        (cc1101SignalFinder.state() !=
             Cc1101SignalFinderState::Calibrating &&
         cc1101SignalFinder.state() !=
             Cc1101SignalFinderState::Searching)) {
        return;
    }
    const std::uint32_t revision = cc1101SignalFinder.revision();
    const std::uint32_t frequency =
        cc1101SignalFinder.nextFrequencyKHz();
    std::int16_t rssiDbm = -128;
    std::uint64_t startedUs = 0;
    std::uint64_t endedUs = 0;
    const bool valid = boardCc1101Spectrum.sampleFrequency(
        frequency, &rssiDbm, &startedUs, &endedUs) &&
        cc1101SignalFinder.ingest(
            frequency, rssiDbm, startedUs, endedUs);
    if (!valid) {
        boardCc1101Spectrum.end();
        cc1101SignalFinder.fail();
        lastRuntimeEvent = "cc1101_finder_runtime_fault";
        renderInteractiveScreen(true);
        return;
    }
    if (cc1101SignalFinder.revision() != revision &&
        !uiController.isRoot() && uiController.page() == 2) {
        display.startWrite();
        renderCcFinderResult(false);
        renderCcFinderGraph(false);
        display.endWrite();
        lastRuntimeEvent = cc1101SignalFinder.found()
            ? "cc1101_finder_signal_found"
            : (cc1101SignalFinder.calibrated()
                   ? "cc1101_finder_waiting"
                   : "cc1101_finder_calibrating");
    }
}

