anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void resetSubGhzFskEdgeTransport() {
    boardCc1101Spectrum.stopAsyncEdgeCapture();
    subGhzFskLowCarrierSamples = 0;
}

void pauseSubGhzFskEdgeTransport() {
    // Once RSSI says the constant-envelope carrier is gone, any queued GDO0
    // toggles belong to unqualified noise and must not enter the artifact.
    boardCc1101Spectrum.stopAsyncEdgeCapture();
}

bool armSubGhzFskEdgeTransport(std::uint64_t monotonicUs) {
    if (boardCc1101Spectrum.asyncEdgeCaptureActive() ||
        subGhzRawCapture.plan().modulation !=
            leshy1::domain::captures::SubGhzRawModulation::FskAsync ||
        subGhzRawCapture.stats().state !=
            SubGhzRawCaptureState::Capturing) {
        return false;
    }
    bool startLevel = false;
    if (!boardCc1101Spectrum.startAsyncEdgeCapture(&startLevel)) return false;
    if (subGhzRawCapture.armFskEdges(startLevel, monotonicUs)) {
        ++subGhzFskTransportArms;
        return true;
    }
    boardCc1101Spectrum.stopAsyncEdgeCapture();
    return false;
}

bool drainSubGhzFskEdgeTransport(std::uint64_t monotonicUs) {
    bool changed = false;
    BoardCc1101PassiveSpectrum::AsyncEdge event;
    while (boardCc1101Spectrum.popAsyncEdge(&event)) {
        if (subGhzRawCapture.stats().state !=
            SubGhzRawCaptureState::Capturing) {
            break;
        }
        changed = subGhzRawCapture.ingestFskEdge(
            event.durationUs, event.newLevel, event.clipped,
            monotonicUs) || changed;
        ++subGhzFskEdgesDrained;
    }
    if (boardCc1101Spectrum.takeAsyncEdgeOverflow()) {
        ++subGhzFskTransportOverflows;
        changed = subGhzRawCapture.finishFskTransport(
            monotonicUs, true) || changed;
    }
    return changed;
}

bool startSubGhzRawCapture(
    leshy1::drivers::radio::Cc1101SpectrumBand band) {
    resetSubGhzFskEdgeTransport();
    subGhzRawCapture.reset();
    subGhzFskTransportArms = 0;
    subGhzFskEdgesDrained = 0;
    subGhzFskTransportOverflows = 0;
    subGhzCapturePersistState = CapturePersistState::Result;
    subGhzCapturePersistStatus = "volatile";
    subGhzCapturePersistGeneration = 0;
    subGhzCapturePersistHeapFreeBeforeMount = 0;
    subGhzCapturePersistHeapLargestBeforeMount = 0;
    subGhzCapturePersistFilesystemMountError = 0;
    cc1101SpectrumReport = {};
    SubGhzRawCapturePlan plan;
    plan.frequencyKHz = subGhzCaptureFrequencyKHz(band);
    plan.modulation = subGhzCaptureModulation;
    if (plan.modulation ==
        leshy1::domain::captures::SubGhzRawModulation::FskAsync) {
        plan.endGapUs = 5000U;
    }
    std::uint64_t startedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (startedUs == 0U) startedUs = 1U;
    const bool owned = resourceBroker.ownerOf(Resource::RadioSpi) ==
        AppRuntime::kForegroundOwner;
    const bool hardwareReady = boardCc1101Spectrum.begin(
        owned, &cc1101SpectrumReport) &&
        boardCc1101Spectrum.lockReceive(plan.frequencyKHz, plan.modulation);
    const bool started = hardwareReady &&
        subGhzRawCapture.begin(plan, startedUs);
    if (!started) {
        boardCc1101Spectrum.end();
        if (subGhzRawCapture.stats().state ==
            SubGhzRawCaptureState::Waiting) {
            subGhzRawCapture.fail(-1, startedUs);
        }
    }
    rfCcBandSelection = band;
    rfSpectrumKind = RfSpectrumKind::Cc1101;
    rfSpectrumView = RfSpectrumView::SubGhzCaptureLive;
    nextSubGhzCaptureUiRefreshUs = startedUs;
    lastRuntimeEvent = started ? "subghz_raw_waiting"
                               : "subghz_raw_start_failed";
    return true;
}

bool stopSubGhzRawCapture(bool returnToCaptureBands) {
    resetSubGhzFskEdgeTransport();
    const std::uint64_t nowUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    const auto state = subGhzRawCapture.stats().state;
    if (state == SubGhzRawCaptureState::Waiting ||
        state == SubGhzRawCaptureState::Capturing) {
        subGhzRawCapture.cancel(nowUs == 0U ? 1U : nowUs);
    }
    const bool cleanup = boardCc1101Spectrum.end();
    nextSubGhzCaptureUiRefreshUs = 0;
    rfSpectrumView = returnToCaptureBands
        ? RfSpectrumView::SubGhzCaptureBandMenu : RfSpectrumView::None;
    lastRuntimeEvent = cleanup ? "subghz_raw_stopped"
                               : "subghz_raw_cleanup_failed";
    return true;
}

bool loadSubGhzRawStoreTestFixture() {
    if (!hilSession.active() ||
        rfSpectrumView != RfSpectrumView::SubGhzCaptureLive ||
        resourceBroker.ownerOf(Resource::RadioSpi) !=
            AppRuntime::kForegroundOwner) {
        return false;
    }
    const bool receiverCleanup = boardCc1101Spectrum.end();
    subGhzRawCapture.reset();
    SubGhzRawCapturePlan plan;
    plan.frequencyKHz = 433920U;
    std::uint64_t startedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (startedUs == 0U) startedUs = 1U;
    bool valid = receiverCleanup && subGhzRawCapture.begin(plan, startedUs);
    const auto ingest = [&](std::uint64_t offsetUs, std::int16_t rssiDbm) {
        return subGhzRawCapture.ingest({startedUs + offsetUs, rssiDbm});
    };
    if (valid) {
        ingest(100U, -100);
        ingest(200U, -100);
        ingest(1000U, -40);
        ingest(1100U, -40);
        ingest(2000U, -100);
        ingest(2100U, -100);
        ingest(3000U, -40);
        ingest(3100U, -40);
        ingest(4000U, -100);
        ingest(4100U, -100);
        subGhzRawCapture.service(startedUs + 25000U);
        valid = subGhzRawCapture.stats().state ==
                    SubGhzRawCaptureState::Complete &&
                subGhzRawCapture.pulseCount() == 3U;
    }
    subGhzCapturePersistState = CapturePersistState::Result;
    subGhzCapturePersistStatus = "volatile_test_fixture";
    subGhzCapturePersistGeneration = 0;
    nextSubGhzCaptureUiRefreshUs = 0;
    lastRuntimeEvent = valid ? "subghz_store_test_fixture_ready"
                             : "subghz_store_test_fixture_failed";
    if (valid) renderInteractiveScreen(true);
    return valid;
}

void emitSubGhzRawStoreTestFixture(Stream& reply) {
    const bool loaded = loadSubGhzRawStoreTestFixture();
    char line[640] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.capture.subghz_store_fixture.v1\","
        "\"kind\":\"result\",\"status\":\"%s\","
        "\"software_fixture\":true,\"physical_signal\":false,"
        "\"rx_only_semantics\":true,\"frequency_khz\":433920,"
        "\"pulses\":%u,\"capture_state\":\"%s\","
        "\"receiver_cleanup_complete\":%s,"
        "\"application_tx_calls\":0,\"radio_tx_commands\":0,"
        "\"persist_state\":\"%s\",\"lease_mask\":%lu}",
        loaded ? "ready" : "rejected",
        static_cast<unsigned>(subGhzRawCapture.pulseCount()),
        leshy1::apps::capture::subGhzRawCaptureStateName(
            subGhzRawCapture.stats().state),
        cc1101SpectrumReport.cleanupComplete ? "true" : "false",
        capturePersistStateName(subGhzCapturePersistState),
        static_cast<unsigned long>(
            resourceBroker.ownedBy(AppRuntime::kForegroundOwner)));
    reply.println(line);
}

void serviceSubGhzRawCapture() {
    if (rfSpectrumView != RfSpectrumView::SubGhzCaptureLive) return;
    const bool fsk = subGhzRawCapture.plan().modulation ==
        leshy1::domain::captures::SubGhzRawModulation::FskAsync;
    auto state = subGhzRawCapture.stats().state;
    if (state != SubGhzRawCaptureState::Waiting &&
        state != SubGhzRawCaptureState::Capturing) {
        return;
    }
    std::uint64_t serviceUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (serviceUs == 0U) serviceUs = 1U;
    if (fsk && state == SubGhzRawCaptureState::Capturing) {
        drainSubGhzFskEdgeTransport(serviceUs);
        state = subGhzRawCapture.stats().state;
        if (state != SubGhzRawCaptureState::Waiting &&
            state != SubGhzRawCaptureState::Capturing) {
            resetSubGhzFskEdgeTransport();
            const bool cleanup = boardCc1101Spectrum.end();
            lastRuntimeEvent = cleanup ? "subghz_fsk_complete"
                                       : "subghz_raw_cleanup_failed";
            renderInteractiveScreen(true);
            return;
        }
    }
    std::int16_t rssiDbm = 0;
    std::uint64_t sampleUs = 0;
    if (!boardCc1101Spectrum.sampleRssi(&rssiDbm, &sampleUs)) {
        const std::uint64_t nowUs =
            static_cast<std::uint64_t>(esp_timer_get_time());
        subGhzRawCapture.fail(-2, nowUs == 0U ? 1U : nowUs);
        resetSubGhzFskEdgeTransport();
        boardCc1101Spectrum.end();
        lastRuntimeEvent = "subghz_raw_runtime_fault";
        renderInteractiveScreen(true);
        return;
    }
    subGhzRawCapture.ingest({sampleUs, rssiDbm});
    subGhzRawCapture.service(sampleUs);
    const auto after = subGhzRawCapture.stats().state;
    if (fsk && after == SubGhzRawCaptureState::Capturing) {
        if (rssiDbm > subGhzRawCapture.plan().thresholdDbm) {
            subGhzFskLowCarrierSamples = 0;
            if (!boardCc1101Spectrum.asyncEdgeCaptureActive() &&
                !armSubGhzFskEdgeTransport(sampleUs)) {
                subGhzRawCapture.fail(-3, sampleUs);
            }
        } else {
            if (subGhzFskLowCarrierSamples != UINT8_MAX) {
                ++subGhzFskLowCarrierSamples;
            }
            if (subGhzFskLowCarrierSamples >= 2U &&
                boardCc1101Spectrum.asyncEdgeCaptureActive()) {
                pauseSubGhzFskEdgeTransport();
            }
        }
    }
    const auto finalState = subGhzRawCapture.stats().state;
    const bool terminal = finalState != SubGhzRawCaptureState::Waiting &&
        finalState != SubGhzRawCaptureState::Capturing;
    if (terminal) {
        resetSubGhzFskEdgeTransport();
        const bool cleanup = boardCc1101Spectrum.end();
        lastRuntimeEvent = !cleanup
            ? "subghz_raw_cleanup_failed"
            : finalState == SubGhzRawCaptureState::Complete
                  ? (fsk ? "subghz_fsk_complete" : "subghz_raw_complete")
                  : finalState == SubGhzRawCaptureState::TimedOut
                        ? "subghz_raw_no_signal"
                        : finalState == SubGhzRawCaptureState::SignalTooLong
                              ? "subghz_raw_signal_too_long"
                              : "subghz_raw_terminal";
    }
    // Display transfers are deliberately suspended once the first edge starts
    // the capture.  A full TFT refresh is long enough to create false pulse
    // widths; measurement integrity takes precedence until the terminal gap.
    if (terminal ||
        (finalState == SubGhzRawCaptureState::Waiting &&
         sampleUs >= nextSubGhzCaptureUiRefreshUs)) {
        nextSubGhzCaptureUiRefreshUs = sampleUs + 200000ULL;
        renderInteractiveScreen(true);
    }
}

bool activeSpectrumRunning() {
    if (rfSpectrumView != RfSpectrumView::Live) return false;
    return rfSpectrumKind == RfSpectrumKind::Cc1101
        ? cc1101SpectrumController.state() ==
              Cc1101SpectrumViewState::Running
        : nrf24SpectrumController.state() ==
              Nrf24SpectrumViewState::Running;
}

bool activeReceiveSampling() {
    const auto rawState = subGhzRawCapture.stats().state;
    const auto irState = infraredCapture.stats().state;
    return activeSpectrumRunning() ||
        (rfSpectrumView == RfSpectrumView::Nrf24Finder &&
         nrf24SpectrumController.state() ==
             Nrf24SpectrumViewState::Running) ||
        (rfSpectrumView == RfSpectrumView::CcFinder &&
         (cc1101SignalFinder.state() ==
              Cc1101SignalFinderState::Calibrating ||
          cc1101SignalFinder.state() ==
              Cc1101SignalFinderState::Searching)) ||
        (rfSpectrumView == RfSpectrumView::SubGhzCaptureLive &&
         (rawState == SubGhzRawCaptureState::Waiting ||
          rawState == SubGhzRawCaptureState::Capturing)) ||
        (uiController.page() == 4 && captureView == CaptureView::Infrared &&
         (irState == InfraredCaptureState::Waiting ||
          irState == InfraredCaptureState::Capturing));
}

void serviceAntennaStatusLeds() {
    std::uint8_t receiveMask = 0;
    std::uint8_t faultMask = 0;
    if (!safetySupervisor.latched()) {
        const std::uint8_t activeNrfMask =
            AntennaStatusController::nrf24MaskFromSlots(
                nrf24SpectrumReport.activeSlotMask);
        const bool nrfRunning =
            nrf24SpectrumController.state() ==
                Nrf24SpectrumViewState::Running ||
            nrf24SignalFinder.state() ==
                Nrf24SignalFinderState::Calibrating ||
            nrf24SignalFinder.state() ==
                Nrf24SignalFinderState::Searching;
        if (nrfRunning) receiveMask |= activeNrfMask;
        if (nrf24SpectrumController.state() ==
                Nrf24SpectrumViewState::Fault ||
            nrf24SignalFinder.state() == Nrf24SignalFinderState::Fault) {
            faultMask |= activeNrfMask == 0U ? 0x0eU : activeNrfMask;
        }

