anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
        const auto rawState = subGhzRawCapture.stats().state;
        const bool ccRunning =
            cc1101SpectrumController.state() ==
                Cc1101SpectrumViewState::Running ||
            cc1101SignalFinder.state() ==
                Cc1101SignalFinderState::Calibrating ||
            cc1101SignalFinder.state() ==
                Cc1101SignalFinderState::Searching ||
            rawState == SubGhzRawCaptureState::Waiting ||
            rawState == SubGhzRawCaptureState::Capturing;
        if (ccRunning) receiveMask |= AntennaStatusController::kCc1101Mask;
        if (cc1101SpectrumController.state() ==
                Cc1101SpectrumViewState::Fault ||
            cc1101SignalFinder.state() == Cc1101SignalFinderState::Fault ||
            rawState == SubGhzRawCaptureState::Failed) {
            faultMask |= AntennaStatusController::kCc1101Mask;
        }
    }
    antennaStatusController.setActivity(receiveMask, faultMask);
    boardAntennaStatusLeds.apply(
        antennaStatusController.brightnessRaw(),
        antennaStatusController.receiveMask(),
        antennaStatusController.faultMask());
}

std::uint32_t activeSpectrumSweeps() {
    return rfSpectrumKind == RfSpectrumKind::Cc1101
        ? cc1101SpectrumController.sweeps()
        : nrf24SpectrumController.sweeps();
}

void armSpectrumWaterfallForCurrentReceiver() {
    const std::uint32_t sweeps = activeSpectrumSweeps();
    spectrumWaterfallSourceSweepBaseline = sweeps;
    spectrumWaterfallLastSourceSweep = sweeps;
}

void serviceSpectrumWaterfallCadence() {
    if (!activeSpectrumRunning()) return;
    const std::uint32_t sourceSweeps = activeSpectrumSweeps();
    if (sourceSweeps == spectrumWaterfallLastSourceSweep) return;
    if (sourceSweeps < spectrumWaterfallLastSourceSweep) {
        armSpectrumWaterfallForCurrentReceiver();
        return;
    }
    const std::uint32_t newlyCompleted =
        sourceSweeps - spectrumWaterfallLastSourceSweep;
    if (newlyCompleted > 1U) {
        spectrumWaterfallMeasurementsSkipped += newlyCompleted - 1U;
    }
    spectrumWaterfallLastSourceSweep = sourceSweeps;

    // One complete receiver sweep becomes exactly one physical TFT row.  No
    // fixed display timer can replay a partial or stale receiver snapshot.
    const bool renderRows = !uiController.isRoot() &&
        uiController.page() == 2 &&
        spectrumViewport.mode() == SpectrumDisplayMode::Waterfall;
    if (renderRows) display.startWrite();
    const std::uint64_t rowStartedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (spectrumWaterfallPreviousRowUs != 0) {
        const std::uint64_t intervalUs =
            rowStartedUs - spectrumWaterfallPreviousRowUs;
        spectrumWaterfallRowIntervalTotalUs += intervalUs;
        if (intervalUs > spectrumWaterfallRowIntervalMaxUs) {
            spectrumWaterfallRowIntervalMaxUs = intervalUs;
        }
    }
    spectrumWaterfallPreviousRowUs = rowStartedUs;
    if (!pushActiveSpectrumHistory()) {
        if (rfSpectrumKind == RfSpectrumKind::Cc1101) {
            boardCc1101Spectrum.end();
            cc1101SpectrumController.fail();
        } else {
            boardNrf24Spectrum.end();
            nrf24SpectrumController.fail();
        }
        releaseSpectrumViewportWorkspace();
        lastRuntimeEvent = "spectrum_history_fault";
        if (renderRows) display.endWrite();
        renderInteractiveScreen(true);
        return;
    }
    const std::uint64_t pushedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    const std::uint64_t pushUs = pushedUs - rowStartedUs;
    spectrumWaterfallPushTotalUs += pushUs;
    if (pushUs > spectrumWaterfallPushMaxUs) {
        spectrumWaterfallPushMaxUs = pushUs;
    }
    if (spectrumWaterfallStartedUs == 0) {
        spectrumWaterfallStartedUs = rowStartedUs;
    }
    ++spectrumWaterfallRowsEmitted;
    ++spectrumWaterfallMeasurementsConsumed;
    if (spectrumWaterfallCompletedUs == 0 &&
        spectrumViewport.rowsStored() == SpectrumViewport::kHistoryRows) {
        spectrumWaterfallCompletedUs = rowStartedUs;
    }
    if (renderRows) {
        renderLatestWaterfallRow();
    }
    const std::uint64_t renderedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    const std::uint64_t renderUs = renderedUs - pushedUs;
    spectrumWaterfallRenderTotalUs += renderUs;
    if (renderUs > spectrumWaterfallRenderMaxUs) {
        spectrumWaterfallRenderMaxUs = renderUs;
    }
    const std::uint64_t serviceUs = renderedUs - rowStartedUs;
    if (serviceUs > spectrumWaterfallServiceMaxUs) {
        spectrumWaterfallServiceMaxUs = serviceUs;
    }
    if (renderRows) display.endWrite();
}

void releaseFullGuidedRfResource() {
    if (fullGuidedRfState.resourceAcquired) {
        resourceBroker.release(
            AppRuntime::kForegroundOwner,
            leshy1::kernel::runtime::resourceMask(Resource::RadioSpi));
    }
    fullGuidedRfState.resourceReleased =
        resourceBroker.ownerOf(Resource::RadioSpi) ==
        leshy1::kernel::runtime::kNoOwner;
}

void restoreFullGuidedLibraryView() {
    if (libraryController.view() == LibraryView::ExportReady) {
        libraryController.back();
    }
    if (libraryController.view() == LibraryView::SessionDetail) {
        libraryController.back();
    }
}

void quiesceSpectrumOnSafetyStop() {
    // Finders deliberately do not own the waterfall workspace.  Safety must
    // therefore key off every active RF/controller state, not viewport
    // ownership, and quiesce both board types independently.
    const auto nrfState = nrf24SpectrumController.state();
    const auto nrfFinderState = nrf24SignalFinder.state();
    const auto ccState = cc1101SpectrumController.state();
    const auto ccFinderState = cc1101SignalFinder.state();
    const bool nrfControllerActive =
        nrfState == Nrf24SpectrumViewState::Running ||
        nrfState == Nrf24SpectrumViewState::Paused;
    const bool nrfFinderActive =
        nrfFinderState == Nrf24SignalFinderState::Calibrating ||
        nrfFinderState == Nrf24SignalFinderState::Searching;
    const bool ccControllerActive =
        ccState == Cc1101SpectrumViewState::Running ||
        ccState == Cc1101SpectrumViewState::Paused;
    const bool ccFinderActive =
        ccFinderState == Cc1101SignalFinderState::Calibrating ||
        ccFinderState == Cc1101SignalFinderState::Searching;
    const bool nrfActive = boardNrf24Spectrum.active() ||
        nrfControllerActive || nrfFinderActive;
    const bool ccActive = boardCc1101Spectrum.active() ||
        ccControllerActive || ccFinderActive;
    const bool workspaceOwned = spectrumViewport.bound();
    if (!nrfActive && !ccActive && !workspaceOwned) return;
    bool cleanup = true;
    if (nrfActive) {
        cleanup = boardNrf24Spectrum.end() && cleanup;
        if (nrfControllerActive) nrf24SpectrumController.fail();
        if (nrfFinderActive) nrf24SignalFinder.fail();
    }
    if (ccActive) {
        cleanup = boardCc1101Spectrum.end() && cleanup;
        if (ccControllerActive) cc1101SpectrumController.fail();
        if (ccFinderActive) cc1101SignalFinder.fail();
    }
    if (workspaceOwned) releaseSpectrumViewportWorkspace();
    lastRuntimeEvent = cleanup ? "spectrum_safety_stop"
                               : "spectrum_safety_cleanup_failed";
}

void finishFullGuidedActiveChecks(bool success);

