anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void serviceFullGuidedRfChecks() {
    if (selfTestController.view() != SelfTestView::ActiveChecks) return;
    if (fullGuidedRfState.step == FullGuidedRfStep::Complete) {
        serviceFullGuidedArtifactChecks();
        return;
    }
    if (fullGuidedRfState.step == FullGuidedRfStep::Idle) {
        const std::uint64_t nowUs =
            static_cast<std::uint64_t>(esp_timer_get_time());
        if (nowUs < fullGuidedRfStartAfterUs) return;
        startFullGuidedRfChecks();
        return;
    }
    if (fullGuidedRfState.step == FullGuidedRfStep::Nrf24Sweep) {
        Nrf24PassiveSweep sweep;
        const bool swept = boardNrf24Spectrum.sweep(&sweep);
        const bool cleanup = boardNrf24Spectrum.end();
        fullGuidedRfState.nrf24Complete = true;
        fullGuidedRfState.nrf24Passed = swept && sweep.valid && cleanup &&
            fullGuidedNrf24Report.sweeps == 1 &&
            fullGuidedNrf24Report.cleanupComplete;
        if (!fullGuidedRfState.nrf24Passed) {
            finishFullGuidedRfChecks(false);
            return;
        }
        const bool owned = resourceBroker.ownerOf(Resource::RadioSpi) ==
            AppRuntime::kForegroundOwner;
        if (!boardCc1101Spectrum.begin(owned, &fullGuidedCc1101Report)) {
            fullGuidedRfState.cc1101Complete = true;
            finishFullGuidedRfChecks(false);
            return;
        }
        fullGuidedRfState.step = FullGuidedRfStep::Cc1101Sweep;
        lastRuntimeEvent = "self_test_active_cc1101";
        renderInteractiveScreen(true);
        return;
    }
    if (fullGuidedRfState.step == FullGuidedRfStep::Cc1101Sweep) {
        const Cc1101PassiveSpectrumPlan plan =
            leshy1::drivers::radio::cc1101PassiveSpectrumPlan(
                leshy1::drivers::radio::Cc1101SpectrumBand::Band433);
        Cc1101PassiveSample sample;
        const bool sampled = boardCc1101Spectrum.sample(
            plan, fullGuidedRfState.cc1101Bins, &sample);
        if (!sampled || !sample.valid) {
            fullGuidedRfState.cc1101Complete = true;
            finishFullGuidedRfChecks(false);
            return;
        }
        ++fullGuidedRfState.cc1101Bins;
        if (fullGuidedRfState.cc1101Bins <
            Cc1101PassiveSpectrumPlan::kBinCount) {
            return;
        }
        const bool cleanup = boardCc1101Spectrum.end();
        fullGuidedRfState.cc1101Complete = true;
        fullGuidedRfState.cc1101Passed = cleanup &&
            fullGuidedCc1101Report.samples ==
                Cc1101PassiveSpectrumPlan::kBinCount &&
            fullGuidedCc1101Report.cleanupComplete &&
            fullGuidedCc1101Report.txStrobes == 0 &&
            fullGuidedCc1101Report.paTableWrites == 0 &&
            fullGuidedCc1101Report.fifoWrites == 0 &&
            fullGuidedCc1101Report.rejectedStrobes == 0;
        if (!fullGuidedRfState.cc1101Passed) {
            finishFullGuidedRfChecks(false);
            return;
        }
        const bool owned = resourceBroker.ownerOf(Resource::RadioSpi) ==
            AppRuntime::kForegroundOwner;
        const bool started = boardCc1101Spectrum.begin(
                owned, &fullGuidedCc1101OokReport) &&
            boardCc1101Spectrum.lockReceive(
                433920U,
                leshy1::domain::captures::SubGhzRawModulation::OokEnvelope);
        if (!started) {
            fullGuidedRfState.subGhzOokComplete = true;
            finishFullGuidedRfChecks(false);
            return;
        }
        fullGuidedRfState.step = FullGuidedRfStep::SubGhzOokReceive;
        lastRuntimeEvent = "self_test_active_subghz_ook";
        renderInteractiveScreen(true);
        return;
    }
    if (fullGuidedRfState.step == FullGuidedRfStep::SubGhzOokReceive) {
        std::int16_t rssiDbm = -128;
        std::uint64_t sampleUs = 0;
        if (!boardCc1101Spectrum.sampleRssi(&rssiDbm, &sampleUs)) {
            fullGuidedRfState.subGhzOokComplete = true;
            finishFullGuidedRfChecks(false);
            return;
        }
        ++fullGuidedRfState.subGhzOokSamples;
        if (fullGuidedRfState.subGhzOokSamples <
            kFullGuidedReceiveSamples) {
            return;
        }
        const bool cleanup = boardCc1101Spectrum.end();
        fullGuidedRfState.subGhzOokComplete = true;
        fullGuidedRfState.subGhzOokPassed = cleanup &&
            fullGuidedCc1101OokReport.samples ==
                kFullGuidedReceiveSamples &&
            fullGuidedCc1101OokReport.cleanupComplete &&
            fullGuidedCc1101OokReport.txStrobes == 0 &&
            fullGuidedCc1101OokReport.paTableWrites == 0 &&
            fullGuidedCc1101OokReport.fifoWrites == 0 &&
            fullGuidedCc1101OokReport.rejectedStrobes == 0;
        if (!fullGuidedRfState.subGhzOokPassed) {
            finishFullGuidedRfChecks(false);
            return;
        }
        const bool owned = resourceBroker.ownerOf(Resource::RadioSpi) ==
            AppRuntime::kForegroundOwner;
        const bool started = boardCc1101Spectrum.begin(
                owned, &fullGuidedCc1101FskReport) &&
            boardCc1101Spectrum.lockReceive(
                433920U,
                leshy1::domain::captures::SubGhzRawModulation::FskAsync);
        if (!started) {
            fullGuidedRfState.subGhzFskComplete = true;
            finishFullGuidedRfChecks(false);
            return;
        }
        fullGuidedRfState.step = FullGuidedRfStep::SubGhzFskReceive;
        lastRuntimeEvent = "self_test_active_subghz_fsk";
        renderInteractiveScreen(true);
        return;
    }
    if (fullGuidedRfState.step == FullGuidedRfStep::SubGhzFskReceive) {
        // Product capture arms GDO0 only after RSSI carrier admission. This
        // automatic no-fixture smoke instead opens one bounded ISR window per
        // RSSI sample and closes it before returning to the main loop. Leaving
        // asynchronous data attached between loop passes would intentionally
        // collect unqualified receiver noise and can fill the finite ring.
        bool startLevel = false;
        if (!boardCc1101Spectrum.startAsyncEdgeCapture(&startLevel)) {
            fullGuidedRfState.subGhzFskComplete = true;
            finishFullGuidedRfChecks(false);
            return;
        }
        std::int16_t rssiDbm = -128;
        std::uint64_t sampleUs = 0;
        if (!boardCc1101Spectrum.sampleRssi(&rssiDbm, &sampleUs)) {
            boardCc1101Spectrum.stopAsyncEdgeCapture();
            fullGuidedRfState.subGhzFskComplete = true;
            finishFullGuidedRfChecks(false);
            return;
        }
        BoardCc1101PassiveSpectrum::AsyncEdge edge;
        while (boardCc1101Spectrum.popAsyncEdge(&edge)) {
            ++fullGuidedRfState.subGhzFskEdges;
            fullGuidedRfState.subGhzFskOverflow =
                fullGuidedRfState.subGhzFskOverflow || edge.clipped;
        }
        fullGuidedRfState.subGhzFskOverflow =
            fullGuidedRfState.subGhzFskOverflow ||
            boardCc1101Spectrum.takeAsyncEdgeOverflow();
        boardCc1101Spectrum.stopAsyncEdgeCapture();
        ++fullGuidedRfState.subGhzFskSamples;
        if (fullGuidedRfState.subGhzFskSamples <
            kFullGuidedReceiveSamples) {
            return;
        }
        const bool cleanup = boardCc1101Spectrum.end();
        fullGuidedRfState.subGhzFskComplete = true;
        fullGuidedRfState.subGhzFskPassed = cleanup &&
            !fullGuidedRfState.subGhzFskOverflow &&
            fullGuidedCc1101FskReport.samples ==
                kFullGuidedReceiveSamples &&
            fullGuidedCc1101FskReport.cleanupComplete &&
            fullGuidedCc1101FskReport.txStrobes == 0 &&
            fullGuidedCc1101FskReport.paTableWrites == 0 &&
            fullGuidedCc1101FskReport.fifoWrites == 0 &&
            fullGuidedCc1101FskReport.rejectedStrobes == 0;
        if (!fullGuidedRfState.subGhzFskPassed) {
            finishFullGuidedRfChecks(false);
            return;
        }
        const bool owned = resourceBroker.ownerOf(Resource::RadioSpi) ==
            AppRuntime::kForegroundOwner;
        bool initialLevel = true;
        std::uint64_t startedUs = 0;
        if (!boardInfraredReceiver.begin(
                owned, &fullGuidedInfraredReport, &initialLevel,
                &startedUs)) {
            fullGuidedRfState.infraredComplete = true;
            finishFullGuidedRfChecks(false);
            return;
        }
        fullGuidedRfState.step = FullGuidedRfStep::InfraredReceive;
        lastRuntimeEvent = "self_test_active_infrared";
        renderInteractiveScreen(true);
        return;
    }
    if (fullGuidedRfState.step == FullGuidedRfStep::InfraredReceive) {
        bool level = true;
        std::uint64_t sampleUs = 0;
        if (!boardInfraredReceiver.sample(&level, &sampleUs)) {
            fullGuidedRfState.infraredComplete = true;
            finishFullGuidedRfChecks(false);
            return;
        }
        ++fullGuidedRfState.infraredSamples;
        if (fullGuidedRfState.infraredSamples <
            kFullGuidedInfraredSamples) {
            return;
        }
        const bool cleanup = boardInfraredReceiver.end();
        fullGuidedRfState.infraredComplete = true;
        fullGuidedRfState.infraredPassed = cleanup &&
            fullGuidedInfraredReport.status == InfraredReceiverStatus::Ready &&
            fullGuidedInfraredReport.samples ==
                kFullGuidedInfraredSamples &&
            fullGuidedInfraredReport.cleanupComplete &&
            fullGuidedInfraredReport.txHeldLow &&
            fullGuidedInfraredReport.nrfCeHeldLow &&
            fullGuidedInfraredReport.gpio21Input;
        finishFullGuidedRfChecks(fullGuidedRfState.infraredPassed);
    }
}

void resetWifiAuthenticationCaptureProduct() {
    clearWifiAuthenticationSyntheticHilState();
    wifiAuthenticationController.reset();
    std::memset(&wifiAuthenticationReport, 0,
                sizeof(wifiAuthenticationReport));
    wifiAuthenticationTarget = {};
    wifiAuthenticationRepeatRequested = false;
    wifiAuthenticationReturnAfterSurveyStop = false;
    wifiAuthenticationBackDuringWaitObserved = false;
    wifiAuthenticationFailure = WifiAuthenticationCaptureUiFailure::None;
    wifiAuthenticationRenderedModel = {};
    wifiAuthenticationRenderedModelValid = false;
    nextWifiAuthenticationUiRefreshUs = 0;
    wifiAuthenticationProductState = WifiAuthenticationProductState::Idle;
}

