anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
bool wifiAuthenticationTargetValid() {
    if (wifiAuthenticationTarget.channel < 1U ||
        wifiAuthenticationTarget.channel > 13U) {
        return false;
    }
    if ((wifiAuthenticationTarget.accessPoint[0] & 0x01U) != 0U) {
        return false;
    }
    for (const std::uint8_t octet :
         wifiAuthenticationTarget.accessPoint) {
        if (octet != 0U) return true;
    }
    return false;
}

bool wifiAuthenticationTargetMatchesSelectedDetail() {
    return wifiAuthenticationTargetValid() &&
        wifiNetworkDetail.identityLength ==
            wifiAuthenticationTarget.accessPoint.size() &&
        wifiNetworkDetail.channel == wifiAuthenticationTarget.channel &&
        std::equal(wifiAuthenticationTarget.accessPoint.begin(),
                   wifiAuthenticationTarget.accessPoint.end(),
                   wifiNetworkDetail.identity.begin());
}

bool requestWifiAuthenticationCaptureFromDetail() {
    const Observation* network = liveWifiNetworkDetail();
    if (network == nullptr || network->identityLength != 6U ||
        network->channel < 1U || network->channel > 13U) {
        wifiAuthenticationProductState =
            WifiAuthenticationProductState::Idle;
        lastRuntimeEvent = "authentication_target_invalid";
        return false;
    }
    WifiAuthenticationTarget target{};
    std::copy_n(network->identity.begin(), target.accessPoint.size(),
                target.accessPoint.begin());
    target.ssidLength = static_cast<std::uint8_t>(
        std::min<std::size_t>(network->labelLength, target.ssid.size()));
    target.ssidKnown = target.ssidLength != 0U;
    if (target.ssidKnown) {
        std::copy_n(
            reinterpret_cast<const std::uint8_t*>(network->label.data()),
            target.ssidLength, target.ssid.begin());
    }
    target.channel = static_cast<std::uint8_t>(network->channel);
    wifiAuthenticationTarget = target;
    clearWifiAuthenticationSyntheticHilState();
    wifiAuthenticationRepeatRequested = false;
    wifiAuthenticationController.reset();
    std::memset(&wifiAuthenticationReport, 0,
                sizeof(wifiAuthenticationReport));
    wifiAuthenticationReturnAfterSurveyStop = false;
    wifiAuthenticationBackDuringWaitObserved = false;
    wifiAuthenticationFailure = WifiAuthenticationCaptureUiFailure::None;
    wifiAuthenticationPersistState = CapturePersistState::Result;
    wifiAuthenticationPersistStatus = "volatile";
    wifiAuthenticationPersistGeneration = 0U;
    wifiAuthenticationPcapReady = false;
    wifiAuthenticationStandardReady = false;
    wifiAuthenticationContentRepaints = 0;
    wifiAuthenticationFullRepaints = 0;
    wifiAuthenticationChromeRepaints = 0;
    if (!wifiAuthenticationTargetValid() ||
        !requestProductSurveyWorkerStop(true)) {
        wifiAuthenticationTarget = {};
        wifiAuthenticationProductState =
            WifiAuthenticationProductState::Idle;
        lastRuntimeEvent = "authentication_survey_stop_unavailable";
        return false;
    }
    wifiAuthenticationProductState =
        WifiAuthenticationProductState::WaitingForSurveyStop;
    armWifiAuthenticationSurveyTerminalHoldDeadline();
    ++wifiAuthenticationGeneration;
    if (wifiAuthenticationGeneration == 0U) {
        ++wifiAuthenticationGeneration;
    }
    wifiProductView = WifiProductView::AuthenticationCapture;
    lastRuntimeEvent = "authentication_waiting_for_survey_stop";
    return true;
}

bool beginWifiAuthenticationCaptureAfterSurvey() {
    if (wifiAuthenticationProductState !=
            WifiAuthenticationProductState::WaitingForSurveyStop ||
        !wifiAuthenticationTargetValid() ||
        resourceBroker.ownerOf(Resource::EspRf) !=
            AppRuntime::kForegroundOwner ||
        std::strcmp(appRuntime.activeApp(), "wifi") != 0) {
        return false;
    }
    wifiFrameCapture.reset();
    WifiFrameCapturePlan plan{};
    plan.channel = wifiAuthenticationTarget.channel;
    plan.durationMs = kWifiAuthenticationCaptureDurationMs;
    plan.channelDwellMs = 120U;
    plan.snapLength = kWifiAuthenticationCaptureSnapLength;
    plan.maximumFrames = kWifiAuthenticationCaptureMaximumFrames;
    std::uint64_t startedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (startedUs == 0U) startedUs = 1U;
    const bool started = wifiFrameCapture.beginAuthenticationCapture(
        plan, wifiAuthenticationTarget.accessPoint, startedUs);
    wifiAuthenticationProductState = started
        ? WifiAuthenticationProductState::Running
        : WifiAuthenticationProductState::Failed;
    wifiAuthenticationFailure = started
        ? WifiAuthenticationCaptureUiFailure::None
        : WifiAuthenticationCaptureUiFailure::StartFailed;
    wifiAuthenticationRenderedModelValid = false;
    nextWifiAuthenticationUiRefreshUs = startedUs + 500000ULL;
    lastRuntimeEvent = started ? "authentication_capture_running"
                               : "authentication_capture_start_failed";
    return started;
}

bool repeatWifiAuthenticationCapture() {
    if (wifiAuthenticationProductState !=
            WifiAuthenticationProductState::Result ||
        wifiAuthenticationSynthetic ||
        !wifiAuthenticationController.ready() ||
        !wifiAuthenticationTargetValid() ||
        !wifiFrameCapture.cleanupComplete()) {
        return false;
    }
    wifiAuthenticationController.reset();
    std::memset(&wifiAuthenticationReport, 0,
                sizeof(wifiAuthenticationReport));
    wifiAuthenticationRepeatRequested = true;
    ++wifiAuthenticationRepeatRequestGeneration;
    if (wifiAuthenticationRepeatRequestGeneration == 0U) {
        ++wifiAuthenticationRepeatRequestGeneration;
    }
    wifiAuthenticationFailure = WifiAuthenticationCaptureUiFailure::None;
    wifiAuthenticationPersistState = CapturePersistState::Result;
    wifiAuthenticationPersistStatus = "volatile";
    wifiAuthenticationPersistGeneration = 0U;
    wifiAuthenticationPcapReady = false;
    wifiAuthenticationStandardReady = false;
    wifiAuthenticationProductState =
        WifiAuthenticationProductState::WaitingForSurveyStop;
    ++wifiAuthenticationGeneration;
    if (wifiAuthenticationGeneration == 0U) {
        ++wifiAuthenticationGeneration;
    }
    lastRuntimeEvent = "authentication_capture_repeat";
    return beginWifiAuthenticationCaptureAfterSurvey();
}

bool leaveWifiAuthenticationSyntheticHilView(bool repeatRequested) {
    if (!wifiAuthenticationSynthetic ||
        !wifiAuthenticationSyntheticHilController.ready()) {
        return false;
    }
    clearWifiAuthenticationSyntheticHilState();
    wifiAuthenticationRepeatRequested = repeatRequested;
    if (repeatRequested) {
        ++wifiAuthenticationRepeatRequestGeneration;
        if (wifiAuthenticationRepeatRequestGeneration == 0U) {
            ++wifiAuthenticationRepeatRequestGeneration;
        }
    }
    // The ambient report, controller, target, raw capture and generation stay
    // immutable.  The synthetic overlay closes into an idle Wi-Fi menu so it
    // cannot remain product-routable after its bounded HIL request.
    wifiAuthenticationProductState = WifiAuthenticationProductState::Idle;
    wifiProductView = WifiProductView::Menu;
    wifiProductSelection = 0U;
    lastRuntimeEvent = repeatRequested
        ? "authentication_synthetic_repeat_requested"
        : "authentication_synthetic_closed";
    return true;
}

