anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
bool leaveWifiAuthenticationCapture() {
    if (wifiAuthenticationSynthetic) {
        return leaveWifiAuthenticationSyntheticHilView(false);
    }
    if (wifiAuthenticationProductState ==
        WifiAuthenticationProductState::WaitingForSurveyStop) {
        wifiAuthenticationReturnAfterSurveyStop = true;
        wifiAuthenticationBackDuringWaitObserved = true;
        lastRuntimeEvent = "authentication_back_waiting_for_survey_stop";
        return true;
    }
    if (wifiAuthenticationProductState ==
            WifiAuthenticationProductState::Failed &&
        wifiAuthenticationFailure ==
            WifiAuthenticationCaptureUiFailure::ResultBeforeCleanup &&
        productSurveyControl() != ProductSurveyWorkerControl::Idle) {
        const WorkerDeadlineSnapshot worker = workerDeadlineSnapshot();
        const bool timelineTerminal =
            productSurveyTimeline.state() ==
                SourceTimelineState::Cancelled;
        const leshy1::platform::arduino::
            WifiAuthenticationSurveyTeardownState surveyTeardown{
                timelineTerminal,
                productSurveyRuntime.timelineHealthy,
                productSurveyRuntime.identityCleanupComplete,
                productSurveyRuntime.scannerCleanupComplete,
                productSurveyRuntime.sourceActive,
                productSurveyScanActive(),
                worker.armed,
            };
        const bool backendClosePermitted =
            leshy1::platform::arduino::
                wifiAuthenticationSurveyBackendClosePermitted(
                    surveyTeardown);
        const bool backendCleanup = backendClosePermitted &&
            closeProductSurveyBackend();
        const bool surveyQuiescent = backendClosePermitted &&
            backendCleanup && productSurveyRuntime.cleanupComplete;
        if (!surveyQuiescent) {
            productSurveyRuntime.status =
                "authentication_survey_cleanup_failed";
            lastRuntimeEvent = productSurveyRuntime.status;
            return true;
        }
        setProductSurveyControl(ProductSurveyWorkerControl::Idle);
        surveyPipeline.resetToSetup();
        productSurveyTimeline.reset();
    }
    const auto capture = wifiFrameCapture.stats();
    const auto ingress = wifiFrameCapture.authenticationCaptureStats();
    if (capture.state == WifiFrameCaptureState::Running ||
        ingress.active || !wifiFrameCapture.cleanupComplete() ||
        !ingress.cleanupComplete) {
        std::uint64_t endedUs =
            static_cast<std::uint64_t>(esp_timer_get_time());
        if (endedUs == 0U) endedUs = 1U;
        if (!wifiFrameCapture.stop(endedUs) ||
            !wifiFrameCapture.cleanupComplete()) {
            wifiAuthenticationProductState =
                WifiAuthenticationProductState::Failed;
            wifiAuthenticationFailure =
                WifiAuthenticationCaptureUiFailure::ResultBeforeCleanup;
            lastRuntimeEvent = "authentication_capture_cleanup_failed";
            return true;
        }
    }
    wifiFrameCapture.reset();
    resetWifiAuthenticationCaptureProduct();
    surveyPipeline.resetToSetup();
    wifiProductView = WifiProductView::Menu;
    wifiProductSelection = 0;
    lastRuntimeEvent = "wifi_menu";
    return true;
}

void serviceWifiAuthenticationSyntheticHilExpiry() {
    const bool expired = wifiAuthenticationPersistenceHil
        ? wifiAuthenticationPersistenceHilFixture.expired(millis())
        : wifiAuthenticationSyntheticHilFixture.expired(millis());
    if (!wifiAuthenticationSynthetic || !expired ||
        captureStoreTaskHandle != nullptr) {
        return;
    }
    if (leaveWifiAuthenticationSyntheticHilView(false)) {
        lastRuntimeEvent = "authentication_synthetic_expired";
        renderInteractiveScreen(true);
    }
}

void serviceWifiAuthenticationCapture() {
    if (wifiAuthenticationProductState !=
        WifiAuthenticationProductState::Running) {
        return;
    }
    const auto before = wifiFrameCapture.stats();
    if (before.state != WifiFrameCaptureState::Running) {
        wifiAuthenticationProductState =
            WifiAuthenticationProductState::Failed;
        wifiAuthenticationFailure =
            WifiAuthenticationCaptureUiFailure::RuntimeFailed;
        lastRuntimeEvent = "authentication_capture_state_lost";
        if (wifiProductView == WifiProductView::AuthenticationCapture) {
            renderInteractiveScreen(false);
        }
        return;
    }
    std::uint64_t nowUs = static_cast<std::uint64_t>(esp_timer_get_time());
    if (nowUs == 0U) nowUs = 1U;
    wifiFrameCapture.service(nowUs);
    const auto capture = wifiFrameCapture.stats();
    if (capture.state == WifiFrameCaptureState::Running) {
        if (wifiProductView == WifiProductView::AuthenticationCapture &&
            nowUs >= nextWifiAuthenticationUiRefreshUs) {
            nextWifiAuthenticationUiRefreshUs = nowUs + 500000ULL;
            display.startWrite();
            renderWifiAuthenticationCapture(false);
            display.endWrite();
        }
        return;
    }

    const auto ingress = wifiFrameCapture.authenticationCaptureStats();
    const bool captureQuiescent =
        capture.state == WifiFrameCaptureState::Complete &&
        wifiFrameCapture.cleanupComplete() && ingress.cleanupComplete &&
        !ingress.active;
    const std::uint64_t reported =
        static_cast<std::uint64_t>(ingress.candidates) +
        ingress.framesInvalid;
    const std::uint64_t accounted =
        static_cast<std::uint64_t>(ingress.candidatesAccepted) +
        ingress.candidatesDropped + ingress.framesInvalid;
    const bool accountingValid = reported <= UINT32_MAX &&
        accounted == reported &&
        capture.framesReported == ingress.candidates &&
        capture.framesAccepted == ingress.candidatesAccepted;
    bool analyzed = false;
    if (captureQuiescent && accountingValid) {
        WifiAuthenticationCaptureInput input{};
        input.source = &wifiFrameCapture.capture();
        input.captureComplete = true;
        input.framesReported = static_cast<std::uint32_t>(reported);
        input.framesAccepted = ingress.candidatesAccepted;
        input.framesDroppedCapacity = ingress.candidatesDropped;
        input.framesDroppedInvalid = ingress.framesInvalid;
        analyzed = leshy1::services::auth::analyzeWifiAuthenticationCapture(
            input, &wifiAuthenticationReport);
    }
    const bool reportLoaded = analyzed &&
        wifiAuthenticationController.load(wifiAuthenticationReport) ==
            WifiAuthenticationCaptureLoadStatus::Ready;
    wifiAuthenticationProductState = reportLoaded
        ? WifiAuthenticationProductState::Result
        : WifiAuthenticationProductState::Failed;
    wifiAuthenticationFailure = reportLoaded
        ? WifiAuthenticationCaptureUiFailure::None
        : (captureQuiescent && accountingValid
               ? WifiAuthenticationCaptureUiFailure::ReportRejected
               : (captureQuiescent
                      ? WifiAuthenticationCaptureUiFailure::RuntimeFailed
                      : WifiAuthenticationCaptureUiFailure::
                            ResultBeforeCleanup));
    lastRuntimeEvent = reportLoaded ? "authentication_capture_result"
                                    : "authentication_capture_failed";
    if (wifiProductView == WifiProductView::AuthenticationCapture) {
        renderInteractiveScreen(false);
    }
}

void releaseWifiFrameCaptureRfLease() {
    // The separate Capture app releases RF immediately after a bounded
    // recording; the Wi-Fi menu no longer duplicates this workflow.
    resourceBroker.release(
        AppRuntime::kForegroundOwner,
        leshy1::kernel::runtime::resourceMask(Resource::EspRf));
}

