anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
                      productSurveyRuntime.selected ? "true" : "false",
                      productSurveyRuntime.status,
                      preparation.stage,
                      static_cast<unsigned long long>(preparationStageAgeMs),
                      productSurveyRuntime.backendOpen ? "true" : "false",
                      productSurveyFilesystem.mounted() ? "true" : "false",
                      leshy1::storage::productStoreAccessStatusName(
                          productSurveyRuntime.storeStatus),
                      leshy1::apps::survey::productSurveyAdmissionStatusName(
                          productSurveyRuntime.admissionStatus),
                      productSurveyRuntime.expectedFingerprint,
                      productSurveyRuntime.observedFingerprint,
                      leshy1::storage::sdTransportRunStatusName(
                          productSurveyRuntime.identityStatus),
                      static_cast<unsigned>(
                          productSurveyRuntime.identityAttempts),
                      static_cast<unsigned>(
                          productSurveyRuntime.identityTransientRetries),
                      productSurveyRuntime.filesystemMountError,
                      productSurveyRuntime.filesystemMountLastFailureError,
                      productSurveyRuntime.filesystemMountStage,
                      productSurveyRuntime.filesystemBusInitializeError,
                      static_cast<unsigned long>(
                          productSurveyRuntime.filesystemHeapFreeBeforeBus),
                      static_cast<unsigned long>(
                          productSurveyRuntime.filesystemHeapLargestBeforeBus),
                      static_cast<unsigned long>(
                          productSurveyRuntime.filesystemHeapFreeBeforeVfs),
                      static_cast<unsigned long>(
                          productSurveyRuntime.filesystemHeapLargestBeforeVfs),
                      productSurveyRuntime.filesystemDriveAvailableBeforeVfs
                          ? "true" : "false",
                      static_cast<unsigned>(
                          productSurveyRuntime.filesystemMountAttempts),
                      static_cast<unsigned>(
                          productSurveyRuntime.filesystemMountTransientRetries),
                      static_cast<unsigned long>(
                          productSurveyMountTotals.attempts),
                      static_cast<unsigned long>(
                          productSurveyMountTotals.successes),
                      static_cast<unsigned long long>(
                          productSurveyRuntime.cardCapacityBytes),
                      static_cast<unsigned long long>(
                          productSurveyRuntime.cachedFreeBytes),
                      leshy1::platform::arduino::boardWifiScanStatusName(
                          productSurveyRuntime.scan.status),
                      productSurveyRuntime.scan.driverError,
                      static_cast<unsigned>(
                          productSurveyRuntime.scan.recordsReported),
                      static_cast<unsigned>(
                          productSurveyRuntime.scan.recordsRead),
                      static_cast<unsigned>(productSurveyRuntime.scan.accepted),
                      static_cast<unsigned>(productSurveyRuntime.scan.rejected),
                      static_cast<unsigned>(productSurveyRuntime.scan.dropped),
                      leshy1::platform::arduino::boardBleScanStatusName(
                          productSurveyRuntime.bleScan.status),
                      static_cast<unsigned>(
                          productSurveyRuntime.bleScan.attempts),
                      static_cast<unsigned>(
                          productSurveyRuntime.bleScan.transientRetries),
                      static_cast<unsigned>(
                          productSurveyRuntime.bleScan.recordsReported),
                      static_cast<unsigned>(
                          productSurveyRuntime.bleScan.recordsRead),
                      static_cast<unsigned>(
                          productSurveyRuntime.bleScan.accepted),
                      static_cast<unsigned>(
                          productSurveyRuntime.bleScan.rejected),
                      static_cast<unsigned>(
                          productSurveyRuntime.bleScan.dropped),
                      static_cast<unsigned>(
                          productSurveyRuntime.bleScan.queueHighWater),
                      leshy1::platform::arduino::boardBleBeginStageName(
                          productSurveyRuntime.bleBegin.stage),
                      productSurveyRuntime.bleBegin.error,
                      static_cast<unsigned long>(
                          productSurveyRuntime.bleBegin.heapFreeBefore),
                      static_cast<unsigned long>(
                          productSurveyRuntime.bleBegin.heapLargestBefore),
                      static_cast<unsigned long>(
                          productSurveyRuntime.bleBegin.heapFreeAfter),
                      static_cast<unsigned long>(
                          productSurveyRuntime.bleBegin.heapLargestAfter),
                      productSurveyRuntime.cleanupComplete ? "true" : "false",
                      productSurveyRuntime.workerReady ? "true" : "false",
                      productSurveyRuntime.sourceActive ? "true" : "false",
                      productSurveyRuntime.sourceStartAttempted ? "true" : "false",
                      productSurveyRuntime.sourceFailureInjected ? "true" : "false",
                      productSurveySourceUnavailableInjectionArmed()
                          ? "true" : "false",
                      productSurveyRuntime.runtimeSourceFailureInjected
                          ? "true" : "false",
                      static_cast<unsigned>(
                          productSurveyRuntime.runtimeSourceFailureInjectedMask),
                      static_cast<unsigned>(
                          productSurveyRuntimeUnavailableInjectionMask()),
                      productSurveyRuntime.storeOpenAttempted ? "true" : "false",
                      static_cast<unsigned long long>(
                          productSurveyRuntime.storeBytesWritten),
                      leshy1::apps::survey::surveyPipelineStatusName(
                          productSurveyRuntime.commitPipelineStatus),
                      leshy1::apps::survey::surveyWorkflowStatusName(
                          productSurveyRuntime.commitWorkflowStatus),
                      leshy1::storage::sessionStoreStatusName(
                          productSurveyRuntime.commitStoreStatus),
                      productSurveyRuntime.commitWorkspaceBound ? 1U : 0U,
                      static_cast<unsigned>(
                          productSurveyRuntime.commitWorkspaceOwner),
                      static_cast<unsigned>(
                          productSurveyRuntime.commitSessionState),
                      static_cast<unsigned>(
                          productSurveyRuntime.commitSessionSize),
                      productSurveyScanActive() ? "true" : "false",
                      productSurveyRuntime.cancelRequestedDuringScan
                          ? "true" : "false",
                      static_cast<unsigned long>(
                          productSurveyRuntime.scanCycles),
                      static_cast<unsigned long>(
                          productSurveyRuntime.wifiScanCycles),
                      static_cast<unsigned long>(
                          productSurveyRuntime.bleScanCycles),
                      static_cast<unsigned long long>(
                          productSurveyRuntime.startActionUs),
                      static_cast<unsigned long long>(
                          productSurveyRuntime.stopActionUs),
                      wifiProductViewName(wifiProductView),
                      static_cast<unsigned>(wifiProductSelection),
                      bleProductViewName(bleProductView),
                      static_cast<unsigned>(bleDeviceSelection),
                      static_cast<unsigned>(bleDeviceCatalog.size()),
                      bleDeviceCatalog.strongestFirst() ? "true" : "false",
                      static_cast<unsigned long>(bleDeviceCatalog.revision()),
                      static_cast<unsigned>(wifiNetworkSelection),
                      static_cast<unsigned>(wifiNetworkVisibleSize()),
                      wifiNetworkNavigationOrder.locked() ? "true" : "false",
                      static_cast<unsigned long>(
                          wifiNetworkNavigationOrder.orderHash(
                              wifiNetworkCatalog)),
                      static_cast<unsigned long>(
                          wifiNetworkNavigationOrder.identityHash(
                              wifiNetworkCatalog, wifiNetworkSelection)),
                      static_cast<unsigned>(wifiNetworkCatalog.size()),
                      wifiNetworkCatalog.strongestFirst() ? "true" : "false",
                      static_cast<unsigned long>(
                          wifiNetworkCatalog.revision()),
                      static_cast<unsigned>(wifiDeviceSelection),
                      static_cast<unsigned>(wifiDeviceVisibleSize()),
                      wifiDeviceNavigationOrder.locked() ? "true" : "false",
                      static_cast<unsigned long>(
                          wifiDeviceNavigationOrder.orderHash(
                              wifiDeviceCatalog)),
                      static_cast<unsigned>(wifiDeviceCatalog.size()),
                      wifiDeviceCatalog.strongestFirst() ? "true" : "false",
                      static_cast<unsigned long>(wifiDeviceCatalog.revision()),
                      wifiOuiDatabase.available() ? "true" : "false",
                      static_cast<unsigned>(wifiOuiDatabase.records()),
                      wifiDeviceDetail.locallyAdministered ? "true" : "false",
                      wifiDeviceDetail.ssidLength != 0U ? "true" : "false",
                      (wifiDeviceDetail.wpsDeviceNameLength != 0U ||
                       wifiDeviceDetail.wpsManufacturerLength != 0U ||
                       wifiDeviceDetail.wpsModelLength != 0U)
                          ? "true" : "false",
                      leshy1::apps::wifi::wifiDeviceGenerationName(
                          wifiDeviceDetail.generation),
                      static_cast<unsigned long long>(
                          wifiDeviceDetail.monotonicUs),
                      static_cast<int>(wifiDeviceDetail.rssiDbm),
                      wifiDeviceStats.active ? "true" : "false",
                      wifiFrameCapture.deviceChannelLocked() ? "true" : "false",
                      wifiDeviceStats.cleanupComplete ? "true" : "false",
                      wifiFrameCapture.nvsDisabled() ? "true" : "false",
                      wifiFrameCapture.volatileStorageOnly() ? "true" : "false",
                      static_cast<unsigned long>(wifiDeviceStats.framesReported),
                      static_cast<unsigned long>(wifiDeviceStats.clientsAccepted),
                      static_cast<unsigned long>(wifiDeviceStats.clientsDropped),
                      static_cast<unsigned long>(wifiDeviceStats.channelHops),
                      static_cast<unsigned>(wifiFrameCapture.currentChannel()),
                      wifiChannelStats.active ? "true" : "false",
                      wifiChannelStats.cleanupComplete ? "true" : "false",
                      static_cast<unsigned long>(
                          wifiChannelStats.framesReported),
                      static_cast<unsigned long>(
                          wifiChannelStats.invalidFrames),
                      static_cast<unsigned long>(wifiChannelStats.channelHops),
                      static_cast<unsigned>(wifiFrameCapture.currentChannel()),
                      static_cast<unsigned long>(wifiChannelSnapshot.revision),
                      static_cast<unsigned long>(
                          wifiChannelSnapshot.completedDwells),
                      static_cast<unsigned long>(
                          wifiChannelSnapshot.completedSweeps),
                      static_cast<unsigned>(wifiChannelSnapshot.measuredMask),
                      static_cast<unsigned>(
                          wifiFrameCapture.bestPrimaryChannel()),
                      selectedLibrary != nullptr && selectedLibrary->simulated
                          ? "true" : "false",
                      libraryController.view() == LibraryView::ExportReady
                          ? "export_ready"
                          : (libraryController.view() == LibraryView::SessionDetail
                                 ? "detail"
                                 : "list"),
                      static_cast<unsigned>(libraryController.size()),
                      static_cast<unsigned long>(selectedLibrary == nullptr
                                                     ? 0
                                                     : selectedLibrary->generation),
                      selectedLibrary != nullptr && selectedLibrary->persistent
                          ? "true" : "false",
                      leshy1::apps::self_test::selfTestViewName(
                          selfTestController.view()),
                      selfTestController.view() == SelfTestView::VisualCheck
                          ? leshy1::apps::self_test::selfTestVisualStateName(
                                selfTestController.visualState())
                          : "none",
                      leshy1::apps::self_test::selfTestModeName(
                          visibleSelfTestMode),
                      leshy1::apps::self_test::selfTestResultStatusName(
                          selfTestReport.status),
                      static_cast<unsigned>(selfTestReport.checkCount),
                      static_cast<unsigned>(selfTestReport.passed),
                      static_cast<unsigned>(selfTestReport.failed),
                      static_cast<unsigned>(selfTestReport.blocked),
                      static_cast<unsigned>(selfTestReport.notApplicable),
                      selfTestReport.readOnly ? "true" : "false",
                      fullGuidedRfStepName(fullGuidedRfState.step),
                      static_cast<unsigned>(fullGuidedRfState.cc1101Bins),
                      fullGuidedArtifactStepName(
                          fullGuidedArtifactState.step),
                      fullGuidedArtifactState.recoveryComplete
                          ? "true" : "false",
                      fullGuidedArtifactState.libraryComplete
                          ? "true" : "false",
                      fullGuidedArtifactState.captureComplete
                          ? "true" : "false",
                      static_cast<unsigned>(
                          fullGuidedArtifactState.pcapFrames));
        if (detailLength < 0 ||
            static_cast<std::size_t>(detailLength) >= detailCapacity) {
            std::snprintf(
                line, sizeof(line),
                "{\"schema\":\"leshy.ui.v1\",\"kind\":\"error\","
                "\"error\":\"state_overflow\"}");
        }
    }
    reply.println(line);
}

