anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void emitTargetsState(Stream& reply) {
    const TargetsController* controller = targetsProductRuntime == nullptr
        ? nullptr : &targetsProductRuntime->controller;
    const TargetListRow* selected = controller == nullptr
        ? nullptr : controller->selectedRow();
    const auto* selectedTarget = controller == nullptr
        ? nullptr : controller->selectedTarget();
    const auto* targetAdmission = controller == nullptr
        ? nullptr : &controller->lastAdmission();
    const auto* comparison = controller != nullptr &&
            controller->compareAvailable()
        ? &controller->comparison() : nullptr;
    const auto* selectedComparison = controller == nullptr
        ? nullptr : controller->selectedComparisonItem();
    TargetComparisonSide baselineSide{};
    TargetComparisonSide currentSide{};
    if (selectedComparison != nullptr) {
        controller->comparisonSide(controller->comparisonSelection(), false,
                                   &baselineSide);
        controller->comparisonSide(controller->comparisonSelection(), true,
                                   &currentSide);
    }
    const char* view = controller == nullptr
        ? "none"
        : controller->view() == TargetsView::Detail
              ? "detail"
              : controller->view() == TargetsView::Actions
                    ? "actions"
              : controller->view() == TargetsView::NameEdit
                    ? "name_edit"
              : controller->view() == TargetsView::TagList
                    ? "tag_list"
              : controller->view() == TargetsView::TagEdit
                    ? "tag_edit"
              : controller->view() == TargetsView::NotesEdit
                    ? "notes_edit"
              : controller->view() == TargetsView::CorrelationList
                    ? "correlation_list"
              : controller->view() == TargetsView::CorrelationReview
                    ? "correlation_review"
              : controller->view() == TargetsView::CorrelationEvidence
                    ? "correlation_evidence"
              : controller->view() == TargetsView::MergeList
                    ? "merge_list"
              : controller->view() == TargetsView::MergeConfirm
                    ? "merge_confirm"
              : controller->view() == TargetsView::SplitConfirm
                    ? "split_confirm"
              : controller->view() == TargetsView::Compare
                    ? "compare"
                    : controller->view() == TargetsView::CompareDetail
                          ? "compare_detail" : "list";
    const char* stateHead = targetsStateHead ==
            leshy1::storage::RecoveryChoice::A
        ? "a"
        : targetsStateHead == leshy1::storage::RecoveryChoice::B
              ? "b" : "none";
    char selectedTargetId[TargetId::kSize * 2U + 1U] = {};
    if (selectedTarget != nullptr) {
        for (std::size_t index = 0; index < TargetId::kSize; ++index) {
            std::snprintf(selectedTargetId + index * 2U, 3, "%02X",
                          static_cast<unsigned>(
                              selectedTarget->id.bytes[index]));
        }
    }
    const auto encodeHex = [](const char* input, std::size_t length,
                              char* output, std::size_t capacity) {
        if (output == nullptr || capacity == 0) return;
        output[0] = '\0';
        if (input == nullptr || capacity < length * 2U + 1U) return;
        for (std::size_t index = 0; index < length; ++index) {
            std::snprintf(output + index * 2U, 3, "%02X",
                          static_cast<unsigned>(
                              static_cast<unsigned char>(input[index])));
        }
    };
    const auto encodeBytesHex = [](const std::uint8_t* input,
                                   std::size_t length, char* output,
                                   std::size_t capacity) {
        if (output == nullptr || capacity == 0) return;
        output[0] = '\0';
        if (input == nullptr || capacity < length * 2U + 1U) return;
        for (std::size_t index = 0; index < length; ++index) {
            std::snprintf(output + index * 2U, 3, "%02X",
                          static_cast<unsigned>(input[index]));
        }
    };
    const auto targetGraphFingerprint = [](const TargetRecord* record) {
        std::uint64_t hash = 1469598103934665603ULL;
        const auto byte = [&hash](std::uint8_t value) {
            hash ^= value;
            hash *= 1099511628211ULL;
        };
        const auto little = [&byte](std::uint64_t value,
                                    std::size_t width) {
            for (std::size_t index = 0; index < width; ++index) {
                byte(static_cast<std::uint8_t>(value >> (index * 8U)));
            }
        };
        if (record == nullptr) return std::uint64_t{0};
        for (const std::uint8_t value : record->id.bytes) byte(value);
        byte(record->identityCount);
        for (std::size_t index = 0; index < record->identityCount; ++index) {
            const auto& identity = record->identities[index];
            byte(static_cast<std::uint8_t>(identity.kind));
            byte(identity.length);
            byte(identity.discriminator);
            for (const std::uint8_t value : identity.value) byte(value);
        }
        byte(record->evidenceCount);
        for (std::size_t index = 0; index < record->evidenceCount; ++index) {
            const auto& evidence = record->evidence[index];
            for (const std::uint8_t value : evidence.sourceId.bytes) byte(value);
            little(evidence.sourceGeneration, 4);
            little(evidence.observationSequence, 8);
            little(evidence.observedMonotonicUs, 8);
        }
        return hash;
    };
    char selectedNameHex[TargetRecord::kNameCapacity * 2U + 1U] = {};
    if (selectedTarget != nullptr) {
        encodeHex(selectedTarget->name.data(), selectedTarget->nameLength,
                  selectedNameHex, sizeof(selectedNameHex));
    }
    char editorNameHex[TargetRecord::kNameCapacity * 2U + 1U] = {};
    if (controller != nullptr && controller->view() == TargetsView::NameEdit) {
        encodeHex(controller->nameEditorText(), controller->nameEditorLength(),
                  editorNameHex, sizeof(editorNameHex));
    }
    char selectedTagHex[TargetRecord::kTagCapacity * 2U + 1U] = {};
    if (controller != nullptr && controller->view() == TargetsView::TagList &&
        !controller->selectedTagIsAdd()) {
        encodeHex(controller->selectedTagText(),
                  controller->selectedTagLength(), selectedTagHex,
                  sizeof(selectedTagHex));
    }
    char editorTagHex[TargetRecord::kTagCapacity * 2U + 1U] = {};
    if (controller != nullptr && controller->view() == TargetsView::TagEdit) {
        encodeHex(controller->tagEditorText(), controller->tagEditorLength(),
                  editorTagHex, sizeof(editorTagHex));
    }
    constexpr std::size_t kNotesProbePrefix =
        TargetRecord::kTagCapacity;
    char selectedNotesPrefixHex[kNotesProbePrefix * 2U + 1U] = {};
    if (selectedTarget != nullptr) {
        const std::size_t length = selectedTarget->notesLength < kNotesProbePrefix
            ? selectedTarget->notesLength : kNotesProbePrefix;
        encodeHex(selectedTarget->notes.data(), length,
                  selectedNotesPrefixHex, sizeof(selectedNotesPrefixHex));
    }
    char editorNotesPrefixHex[kNotesProbePrefix * 2U + 1U] = {};
    if (controller != nullptr && controller->view() == TargetsView::NotesEdit) {
        const std::size_t length = controller->notesEditorLength() <
                kNotesProbePrefix
            ? controller->notesEditorLength() : kNotesProbePrefix;
        encodeHex(controller->notesEditorText(), length,
                  editorNotesPrefixHex, sizeof(editorNotesPrefixHex));
    }
    char selectedObservationIdentityHex[
        Observation::kIdentityCapacity * 2U + 1U] = {};
    char selectedObservationLabelHex[
        Observation::kLabelCapacity * 2U + 1U] = {};
    if (selected != nullptr) {
        for (std::size_t index = 0;
             index < selected->latest.identityLength; ++index) {
            std::snprintf(selectedObservationIdentityHex + index * 2U, 3,
                          "%02X", static_cast<unsigned>(
                              selected->latest.identity[index]));
        }
        encodeHex(selected->latest.label.data(),
                  selected->latest.labelLength,
                  selectedObservationLabelHex,
                  sizeof(selectedObservationLabelHex));
    }
    const CorrelationProposal* correlationProposal = controller == nullptr
        ? nullptr : controller->reviewedCorrelationProposal();
    Observation correlationKnown{};
    Observation correlationCandidate{};
    const bool correlationKnownLoaded = correlationProposal != nullptr &&
        controller->correlationEvidence(false, &correlationKnown);
    const bool correlationCandidateLoaded = correlationProposal != nullptr &&
        controller->correlationEvidence(true, &correlationCandidate);
    char correlationProposalId[33] = {};
    char correlationCandidateIdentityHex[
        leshy1::domain::targets::TargetIdentity::kValueCapacity * 2U + 1U] = {};
    if (correlationProposal != nullptr) {
        for (std::size_t index = 0;
             index < correlationProposal->id.bytes.size(); ++index) {
            std::snprintf(correlationProposalId + index * 2U, 3, "%02X",
                          static_cast<unsigned>(
                              correlationProposal->id.bytes[index]));
        }
        for (std::size_t index = 0;
             index < correlationProposal->candidateIdentity.length; ++index) {
            std::snprintf(correlationCandidateIdentityHex + index * 2U, 3,
                          "%02X", static_cast<unsigned>(
                              correlationProposal->candidateIdentity
                                  .value[index]));
        }
    }
    const TargetMergeRecord* activeMerge = selectedTarget == nullptr ||
            targetsProductRuntime == nullptr
        ? nullptr : activeTargetMerge(targetsProductRuntime->merges,
                                      selectedTarget->id);
    const TargetListRow* mergeCandidateRow = controller == nullptr
        ? nullptr : controller->selectedMergeCandidate();
    const TargetRecord* mergeCandidateTarget = mergeCandidateRow == nullptr ||
            controller == nullptr
        ? nullptr : controller->catalog().find(mergeCandidateRow->targetId);
    char activeMergeOperationId[TargetMergeId::kSize * 2U + 1U] = {};
    if (activeMerge != nullptr) {
        encodeBytesHex(activeMerge->id.bytes.data(), activeMerge->id.bytes.size(),
                       activeMergeOperationId,
                       sizeof(activeMergeOperationId));
    }
    char mergeCandidateTargetId[TargetId::kSize * 2U + 1U] = {};
    if (mergeCandidateTarget != nullptr) {
        encodeBytesHex(mergeCandidateTarget->id.bytes.data(),
                       mergeCandidateTarget->id.bytes.size(),
                       mergeCandidateTargetId,
                       sizeof(mergeCandidateTargetId));
    }
    char mutationMergeOperationId[TargetMergeId::kSize * 2U + 1U] = {};
    char mutationMergeSourceId[TargetId::kSize * 2U + 1U] = {};
    encodeBytesHex(targetsMutationReport.mergeOperationId.bytes.data(),
                   targetsMutationReport.mergeOperationId.bytes.size(),
                   mutationMergeOperationId,
                   sizeof(mutationMergeOperationId));
    encodeBytesHex(targetsMutationReport.mergeSourceId.bytes.data(),
                   targetsMutationReport.mergeSourceId.bytes.size(),
                   mutationMergeSourceId, sizeof(mutationMergeSourceId));
    char selectedGraphFingerprint[17] = {};
    std::snprintf(selectedGraphFingerprint,
                  sizeof(selectedGraphFingerprint), "%016llX",
                  static_cast<unsigned long long>(
                      targetGraphFingerprint(selectedTarget)));
    const auto correlationConfidenceName = [](const CorrelationProposal* value) {
        if (value == nullptr) return "none";
        using leshy1::domain::targets::CorrelationConfidence;
        switch (value->confidence) {
            case CorrelationConfidence::Low: return "low";
            case CorrelationConfidence::Medium: return "medium";
            case CorrelationConfidence::High: return "high";
            case CorrelationConfidence::Stale: return "stale";
        }
        return "unknown";
    };
    const auto correlationFeatureName = [](const CorrelationProposal* value) {
        if (value == nullptr || value->featureCount == 0) return "none";
        using leshy1::domain::targets::CorrelationFeatureKind;
        switch (value->features[0].kind) {
            case CorrelationFeatureKind::AssignedVendorMatch:
                return "assigned_vendor";
            case CorrelationFeatureKind::AdvertisedNameMatch:
                return "advertised_name";
            case CorrelationFeatureKind::CoOccurrencePattern:
                return "co_occurrence";
            case CorrelationFeatureKind::ChannelPatternMatch:
                return "channel_pattern";
            case CorrelationFeatureKind::SignalTrendMatch:
                return "signal_trend";
        }
        return "unknown";
    };
    auto& line = diagnosticJson;
    std::memset(line, 0, sizeof(line));
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.targets.product.v1\",\"kind\":\"state\","
        "\"status\":\"%s\",\"workspace_allocated\":%s,"
        "\"page_open\":%s,\"view\":\"%s\","
        "\"target_count\":%u,\"catalog_count\":%u,"
        "\"catalog_capacity\":%u,\"source_identity_count\":%u,"
        "\"admission_stage\":\"%s\",\"admission_status\":\"%s\","
        "\"admission_target_status\":\"%s\","
        "\"admission_observations\":%u,\"admission_identities\":%u,"
        "\"admission_created\":%u,\"admission_evidence_attached\":%u,"
        "\"admission_unchanged\":%u,\"admission_capacity_skipped\":%u,"
        "\"truncated\":%s,\"entry_count\":%u,\"selection\":%u,"
        "\"compare_available\":%s,\"baseline_generation\":%lu,"
        "\"current_generation\":%lu,\"added\":%u,\"removed\":%u,"
        "\"changed\":%u,\"unchanged\":%u,"
        "\"comparison_count\":%u,\"comparison_selection\":%u,"
        "\"selected_change_class\":\"%s\","
        "\"selected_change_mask\":%u,"
        "\"baseline_evidence_present\":%s,"
        "\"baseline_evidence_generation\":%lu,"
        "\"baseline_observation_sequence\":%llu,"
        "\"baseline_rssi_dbm\":%d,\"baseline_channel\":%u,"
        "\"current_evidence_present\":%s,"
        "\"current_evidence_generation\":%lu,"
        "\"current_observation_sequence\":%llu,"
        "\"current_rssi_dbm\":%d,\"current_channel\":%u,"
        "\"selected_generation\":%lu,\"selected_rssi_dbm\":%d,"
        "\"selected_observation_radio\":%u,"
        "\"selected_observation_identity_hex\":\"%s\","
        "\"selected_observation_label_hex\":\"%s\","
        "\"selected_target_present\":%s,\"selected_target_id\":\"%s\","
        "\"selected_favorite\":%s,"
        "\"selected_name_length\":%u,\"selected_name_hex\":\"%s\","
        "\"selected_tag_count\":%u,\"tag_selection\":%u,"
        "\"selected_tag_length\":%u,\"selected_tag_hex\":\"%s\","
        "\"selected_revision\":%lu,"
        "\"selected_identity_count\":%u,\"selected_evidence_count\":%u,"
        "\"selected_graph_fingerprint\":\"%s\","
        "\"merge_candidate_count\":%u,\"merge_selection\":%u,"
        "\"merge_candidate_target_id\":\"%s\","
        "\"merge_candidate_identity_count\":%u,"
        "\"merge_candidate_evidence_count\":%u,"
        "\"merge_candidate_graph_fingerprint\":\"%016llX\","
        "\"merge_history_count\":%u,\"merge_history_capacity\":%u,"
        "\"active_merge_available\":%s,"
        "\"active_merge_operation_id\":\"%s\","
        "\"action_selection\":%u,\"name_editor_selection\":%u,"
        "\"name_editor_length\":%u,\"name_editor_hex\":\"%s\","
        "\"name_editor_glyph\":%u,\"name_editor_dirty\":%s,"
        "\"tag_editor_selection\":%u,\"tag_editor_length\":%u,"
        "\"tag_editor_hex\":\"%s\",\"tag_editor_glyph\":%u,"
        "\"tag_editor_can_save\":%s,"
        "\"selected_notes_length\":%u,"
        "\"selected_notes_prefix_hex\":\"%s\","
        "\"notes_editor_selection\":%u,\"notes_editor_length\":%u,"
        "\"notes_editor_prefix_hex\":\"%s\",\"notes_editor_glyph\":%u,"
        "\"notes_editor_dirty\":%s,"
        "\"correlation_count\":%u,\"correlation_selection\":%u,"
        "\"correlation_review_selection\":%u,"
        "\"correlation_decision_count\":%u,"
        "\"correlation_proposal_present\":%s,"
        "\"correlation_proposal_id\":\"%s\","
        "\"correlation_candidate_identity_kind\":%u,"
        "\"correlation_candidate_identity_discriminator\":%u,"
        "\"correlation_candidate_identity_hex\":\"%s\","
        "\"correlation_score_permille\":%u,"
        "\"correlation_confidence\":\"%s\","
        "\"correlation_stale\":%s,\"correlation_feature_count\":%u,"
        "\"correlation_feature_kind\":\"%s\","
        "\"correlation_feature_strength_permille\":%u,"
        "\"correlation_feature_maximum_points\":%u,"
        "\"correlation_feature_awarded_points\":%u,"
        "\"correlation_known_loaded\":%s,"
        "\"correlation_known_generation\":%lu,"
        "\"correlation_known_sequence\":%llu,"
        "\"correlation_known_radio\":%u,"
        "\"correlation_known_rssi_dbm\":%d,"
        "\"correlation_known_channel\":%u,"
        "\"correlation_candidate_loaded\":%s,"
        "\"correlation_candidate_generation\":%lu,"
        "\"correlation_candidate_sequence\":%llu,"
        "\"correlation_candidate_radio\":%u,"
        "\"correlation_candidate_rssi_dbm\":%d,"
        "\"correlation_candidate_channel\":%u,"
        "\"correlation_evidence_candidate\":%s,"
        "\"read_only\":false,\"write_enabled\":%s,"
        "\"target_state_generation\":%lu,\"target_state_head\":\"%s\","
        "\"mutation_state\":\"%s\",\"mutation_status\":\"%s\","
        "\"mutation_correlation\":%s,"
        "\"mutation_correlation_kind\":\"%s\","
        "\"mutation_correlation_status\":\"%s\","
        "\"mutation_merge\":%s,\"mutation_merge_kind\":\"%s\","
        "\"mutation_merge_status\":\"%s\","
        "\"mutation_merge_operation_id\":\"%s\","
        "\"mutation_merge_source_id\":\"%s\","
        "\"mutation_persisted\":%s,\"mutation_generation\":%lu,"
        "\"mutation_action_us\":%llu,\"mutation_elapsed_us\":%llu,"
        "\"mutation_bytes_written\":%llu,\"mutation_write_calls\":%lu,"
        "\"mutation_file_syncs\":%lu,\"mutation_directory_syncs\":%lu,"
        "\"mutation_heap_free_before_mount\":%lu,"
        "\"mutation_heap_largest_before_mount\":%lu,"
        "\"mutation_identity_attempts\":%u,"
        "\"mutation_identity_transient_retries\":%u,"
        "\"mutation_expected_cid\":\"%s\","
        "\"mutation_observed_cid\":\"%s\","
        "\"blocked_write_attempts\":%lu,"
        "\"identity_attempts\":%u,"
        "\"identity_transient_retries\":%u,"
        "\"identity_cleanup_complete\":%s,"
        "\"filesystem_mount_error\":%d,"
        "\"filesystem_mount_attempts\":%u,"
        "\"filesystem_mount_transient_retries\":%u,"
        "\"load_elapsed_us\":%llu,"
        "\"load_watchdog_feeds\":%lu,"
        "\"load_maximum_phase_us\":%llu,"
        "\"cleanup_complete\":%s,"
        "\"fixture_mode\":%s,\"fixture_run_id\":\"%s\","
        "\"fixture_storage\":\"%s\","
        "\"fixture_sd_accessed\":%s,"
        "\"fixture_product_target_state_touched\":%s,"
        "\"fixture_ota1_restore_required\":%s,"
        "\"lease_mask\":%lu,\"heap_free_before\":%lu,"
        "\"heap_free_now\":%lu,\"heap_free_after_release\":%lu}",
        targetsProductStatus,
        controller == nullptr ? "false" : "true",
        uiController.page() == 7 ? "true" : "false", view,
        static_cast<unsigned>(controller == nullptr ? 0 : controller->size()),
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->catalog().size()),
        static_cast<unsigned>(TargetCatalog::kCapacity),
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->sourceIdentityCount()),
        controller == nullptr ? "none" : controller->lastAdmissionStage(),
        leshy1::services::targets::sessionTargetAdmissionStatusName(
            targetAdmission == nullptr
                ? leshy1::services::targets::SessionTargetAdmissionStatus::InvalidArgument
                : targetAdmission->status),
        leshy1::domain::targets::targetMutationStatusName(
            targetAdmission == nullptr
                ? leshy1::domain::targets::TargetMutationStatus::InvalidArgument
                : targetAdmission->targetStatus),
        static_cast<unsigned>(targetAdmission == nullptr
                                  ? 0 : targetAdmission->observations),
        static_cast<unsigned>(targetAdmission == nullptr
                                  ? 0 : targetAdmission->identities),
        static_cast<unsigned>(targetAdmission == nullptr
                                  ? 0 : targetAdmission->created),
        static_cast<unsigned>(targetAdmission == nullptr
                                  ? 0 : targetAdmission->evidenceAttached),
        static_cast<unsigned>(targetAdmission == nullptr
                                  ? 0 : targetAdmission->unchanged),
        static_cast<unsigned>(targetAdmission == nullptr
                                  ? 0 : targetAdmission->capacitySkipped),
        controller != nullptr && controller->truncated() ? "true" : "false",
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->entryCount()),
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->selection()),
        comparison == nullptr ? "false" : "true",
        static_cast<unsigned long>(comparison == nullptr
                                       ? 0 : comparison->baseline.generation),
        static_cast<unsigned long>(comparison == nullptr
                                       ? 0 : comparison->current.generation),
        static_cast<unsigned>(comparison == nullptr ? 0 : comparison->added),
        static_cast<unsigned>(comparison == nullptr ? 0 : comparison->removed),
        static_cast<unsigned>(comparison == nullptr ? 0 : comparison->changed),
        static_cast<unsigned>(comparison == nullptr
                                  ? 0 : comparison->unchanged),
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->comparisonSize()),
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->comparisonSelection()),
        selectedComparison == nullptr
            ? "none"
            : leshy1::domain::targets::targetComparisonClassName(
                  selectedComparison->classification),
        static_cast<unsigned>(selectedComparison == nullptr
                                  ? 0 : selectedComparison->changes),
        baselineSide.present ? "true" : "false",
        static_cast<unsigned long>(baselineSide.present
            ? baselineSide.evidence.sourceGeneration : 0),
        static_cast<unsigned long long>(baselineSide.present
            ? baselineSide.evidence.observationSequence : 0),
        static_cast<int>(baselineSide.present
            ? baselineSide.observation.rssiDbm : 0),
        static_cast<unsigned>(baselineSide.present
            ? baselineSide.observation.channel : 0),
        currentSide.present ? "true" : "false",
        static_cast<unsigned long>(currentSide.present
            ? currentSide.evidence.sourceGeneration : 0),
