anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
        static_cast<unsigned long long>(currentSide.present
            ? currentSide.evidence.observationSequence : 0),
        static_cast<int>(currentSide.present
            ? currentSide.observation.rssiDbm : 0),
        static_cast<unsigned>(currentSide.present
            ? currentSide.observation.channel : 0),
        static_cast<unsigned long>(selected == nullptr
                                       ? 0 : selected->evidence.sourceGeneration),
        static_cast<int>(selected == nullptr ? 0 : selected->latest.rssiDbm),
        static_cast<unsigned>(selected == nullptr
                                  ? RadioKind{} : selected->latest.radio),
        selectedObservationIdentityHex,
        selectedObservationLabelHex,
        selectedTarget == nullptr ? "false" : "true",
        selectedTargetId,
        selectedTarget != nullptr && selectedTarget->favorite
            ? "true" : "false",
        static_cast<unsigned>(selectedTarget == nullptr
                                  ? 0 : selectedTarget->nameLength),
        selectedNameHex,
        static_cast<unsigned>(selectedTarget == nullptr
                                  ? 0 : selectedTarget->tagCount),
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->tagSelection()),
        static_cast<unsigned>(controller == nullptr ||
                                      controller->view() != TargetsView::TagList
                                  ? 0 : controller->selectedTagLength()),
        selectedTagHex,
        static_cast<unsigned long>(selectedTarget == nullptr
                                       ? 0 : selectedTarget->revision),
        static_cast<unsigned>(selectedTarget == nullptr
                                  ? 0 : selectedTarget->identityCount),
        static_cast<unsigned>(selectedTarget == nullptr
                                  ? 0 : selectedTarget->evidenceCount),
        selectedGraphFingerprint,
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->mergeCandidateCount()),
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->mergeSelection()),
        mergeCandidateTargetId,
        static_cast<unsigned>(mergeCandidateTarget == nullptr
                                  ? 0 : mergeCandidateTarget->identityCount),
        static_cast<unsigned>(mergeCandidateTarget == nullptr
                                  ? 0 : mergeCandidateTarget->evidenceCount),
        static_cast<unsigned long long>(
            targetGraphFingerprint(mergeCandidateTarget)),
        static_cast<unsigned>(targetsProductRuntime == nullptr
                                  ? 0 : targetsProductRuntime->merges.size()),
        static_cast<unsigned>(TargetMergeHistory::kCapacity),
        activeMerge == nullptr ? "false" : "true",
        activeMergeOperationId,
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->actionSelection()),
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->nameEditorSelection()),
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->nameEditorLength()),
        editorNameHex,
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->nameEditorGlyph()),
        controller != nullptr && controller->nameEditorDirty()
            ? "true" : "false",
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->tagEditorSelection()),
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->tagEditorLength()),
        editorTagHex,
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->tagEditorGlyph()),
        controller != nullptr && controller->tagEditorCanSave()
            ? "true" : "false",
        static_cast<unsigned>(selectedTarget == nullptr
                                  ? 0 : selectedTarget->notesLength),
        selectedNotesPrefixHex,
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->notesEditorSelection()),
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->notesEditorLength()),
        editorNotesPrefixHex,
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->notesEditorGlyph()),
        controller != nullptr && controller->notesEditorDirty()
            ? "true" : "false",
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->selectedCorrelationCount()),
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->correlationSelection()),
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->correlationReviewSelection()),
        static_cast<unsigned>(controller == nullptr
                                  ? 0 : controller->decisions().size()),
        correlationProposal == nullptr ? "false" : "true",
        correlationProposalId,
        correlationProposal == nullptr ? 0U : static_cast<unsigned>(
            correlationProposal->candidateIdentity.kind),
        static_cast<unsigned>(correlationProposal == nullptr ? 0 :
            correlationProposal->candidateIdentity.discriminator),
        correlationCandidateIdentityHex,
        static_cast<unsigned>(correlationProposal == nullptr ? 0 :
            correlationProposal->scorePermille),
        correlationConfidenceName(correlationProposal),
        correlationProposal != nullptr && correlationProposal->stale
            ? "true" : "false",
        static_cast<unsigned>(correlationProposal == nullptr ? 0 :
            correlationProposal->featureCount),
        correlationFeatureName(correlationProposal),
        static_cast<unsigned>(correlationProposal == nullptr ||
                                      correlationProposal->featureCount == 0
                                  ? 0
                                  : correlationProposal->features[0]
                                        .strengthPermille),
        static_cast<unsigned>(correlationProposal == nullptr ||
                                      correlationProposal->featureCount == 0
                                  ? 0
                                  : correlationProposal->features[0]
                                        .maximumPoints),
        static_cast<unsigned>(correlationProposal == nullptr ||
                                      correlationProposal->featureCount == 0
                                  ? 0
                                  : correlationProposal->features[0]
                                        .awardedPoints),
        correlationKnownLoaded ? "true" : "false",
        static_cast<unsigned long>(correlationProposal == nullptr ||
                                           correlationProposal->featureCount == 0
                                       ? 0
                                       : correlationProposal->features[0]
                                             .targetEvidence.sourceGeneration),
        static_cast<unsigned long long>(correlationProposal == nullptr ||
                                                correlationProposal
                                                        ->featureCount == 0
                                            ? 0
                                            : correlationProposal->features[0]
                                                  .targetEvidence
                                                  .observationSequence),
        static_cast<unsigned>(correlationKnownLoaded
                                  ? correlationKnown.radio : RadioKind{}),
        static_cast<int>(correlationKnownLoaded ? correlationKnown.rssiDbm : 0),
        static_cast<unsigned>(correlationKnownLoaded
                                  ? correlationKnown.channel : 0),
        correlationCandidateLoaded ? "true" : "false",
        static_cast<unsigned long>(correlationProposal == nullptr ? 0 :
            correlationProposal->candidateEvidence.sourceGeneration),
        static_cast<unsigned long long>(correlationProposal == nullptr ? 0 :
            correlationProposal->candidateEvidence.observationSequence),
        static_cast<unsigned>(correlationCandidateLoaded
                                  ? correlationCandidate.radio : RadioKind{}),
        static_cast<int>(correlationCandidateLoaded
                             ? correlationCandidate.rssiDbm : 0),
        static_cast<unsigned>(correlationCandidateLoaded
                                  ? correlationCandidate.channel : 0),
        controller != nullptr && controller->correlationEvidenceIsCandidate()
            ? "true" : "false",
        controller != nullptr &&
                ((controller->view() == TargetsView::Actions &&
                  controller->selectedAction() == TargetActionItem::Favorite) ||
                 (controller->view() == TargetsView::NameEdit &&
                  controller->nameEditorDirty()) ||
                 (controller->view() == TargetsView::TagList &&
                  !controller->selectedTagIsAdd()) ||
                 (controller->view() == TargetsView::TagEdit &&
                  controller->tagEditorCanSave()) ||
                 (controller->view() == TargetsView::NotesEdit &&
                  controller->notesEditorDirty()) ||
                 (controller->view() == TargetsView::CorrelationReview &&
                  controller->correlationReviewSelection() >= 2) ||
                 controller->view() == TargetsView::MergeConfirm ||
                 controller->view() == TargetsView::SplitConfirm) &&
                targetsMutationState != TargetsMutationState::Saving
            ? "true" : "false",
        static_cast<unsigned long>(targetsStateGeneration), stateHead,
        targetsMutationStateName(targetsMutationState),
        targetsMutationStatus,
        targetsMutationReport.correlation ? "true" : "false",
        targetsMutationReport.correlationKind == CorrelationActionKind::Accept
            ? "accept" : "reject",
        leshy1::services::targets::correlationDecisionStatusName(
            targetsMutationReport.correlationStatus),
        targetsMutationReport.merge ? "true" : "false",
        targetsMutationReport.mergeKind == TargetMergeActionKind::Merge
            ? "merge" : "split",
        leshy1::domain::targets::targetMergeStatusName(
            targetsMutationReport.mergeStatus),
        mutationMergeOperationId,
        mutationMergeSourceId,
        targetsMutationReport.persisted ? "true" : "false",
        static_cast<unsigned long>(targetsMutationReport.generation),
        static_cast<unsigned long long>(targetsMutationStartActionUs),
        static_cast<unsigned long long>(targetsMutationReport.elapsedUs),
        static_cast<unsigned long long>(targetsMutationReport.bytesWritten),
        static_cast<unsigned long>(targetsMutationReport.writeCalls),
        static_cast<unsigned long>(targetsMutationReport.fileSyncs),
        static_cast<unsigned long>(targetsMutationReport.directorySyncs),
        static_cast<unsigned long>(
            targetsMutationReport.heapFreeBeforeMount),
        static_cast<unsigned long>(
            targetsMutationReport.heapLargestBeforeMount),
        static_cast<unsigned>(targetsMutationReport.identityAttempts),
        static_cast<unsigned>(
            targetsMutationReport.identityTransientRetries),
        targetsMutationReport.expectedFingerprint,
        targetsMutationReport.observedFingerprint,
        static_cast<unsigned long>(targetsBlockedWriteAttempts),
        static_cast<unsigned>(targetsIdentityAttempts),
        static_cast<unsigned>(targetsIdentityTransientRetries),
        targetsIdentityCleanupComplete ? "true" : "false",
        targetsFilesystemMountError,
        static_cast<unsigned>(targetsFilesystemMountAttempts),
        static_cast<unsigned>(targetsFilesystemMountTransientRetries),
        static_cast<unsigned long long>(targetsLoadElapsedUs),
        static_cast<unsigned long>(targetsLoadWatchdogFeeds),
        static_cast<unsigned long long>(targetsLoadMaximumPhaseUs),
        targetsCleanupComplete ? "true" : "false",
        targetsMergeFixtureRuntime ? "true" : "false",
        targetsMergeFixtureRuntime && targetsMergeFixtureContinuityValid()
            ? targetsMergeFixtureRtcState.runId : "",
        targetsMergeFixtureRuntime ? "disposable_ota1" : "product_sd",
        targetsMergeFixtureSdAccessed ? "true" : "false",
        targetsMergeFixtureProductStateTouched ? "true" : "false",
        targetsMergeFixtureRuntime ? "true" : "false",
        static_cast<unsigned long>(appRuntime.activeResources()),
        static_cast<unsigned long>(targetsHeapFreeBefore),
        static_cast<unsigned long>(heap_caps_get_free_size(MALLOC_CAP_8BIT)),
        static_cast<unsigned long>(targetsHeapFreeAfter));
    reply.println(line);
}

