anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void emitCompanionWebState(Stream& reply) {
    namespace companion = leshy1::services::companion;
    char line[1536] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.companion.web.v1\",\"kind\":\"state\","
        "\"overlay_open\":%s,\"authorized\":%s,\"server_active\":%s,"
        "\"protocol_connected\":%s,\"generation\":%lu,"
        "\"started_us\":%llu,\"last_activity_us\":%llu,"
        "\"stop_reason\":\"%s\",\"requests_handled\":%lu,"
        "\"requests_rejected\":%lu,\"tx_backpressure_events\":%lu,"
        "\"last_send_errno\":%d,\"last_response_body_bytes\":%u,"
        "\"last_response_body_length\":%u,\"credential_present\":%s,"
        "\"hil_seed_armed\":%s,"
        "\"credential_persisted\":false,\"credential_exposed_over_diagnostic\":false,"
        "\"network_core_ready\":%s,\"begin_stage\":\"%s\","
        "\"driver_error\":%d,\"ap_ipv4_ready\":%s,"
        "\"dhcp_server_started\":%s,\"associated_stations\":%u,"
        "\"cleanup_complete\":%s,"
        "\"targets_suspended\":%s,"
        "\"heap_free_before_suspend\":%lu,"
        "\"heap_free_after_suspend\":%lu,"
        "\"survey_worker_suspended\":%s,"
        "\"heap_free_before_worker_suspend\":%lu,"
        "\"heap_free_after_worker_suspend\":%lu,"
        "\"heap_free_before_begin\":%lu,"
        "\"heap_largest_before_begin\":%lu,"
        "\"heap_free_after_begin\":%lu,\"heap_free_after_stop\":%lu,"
        "\"maximum_clients\":1,\"idle_timeout_us\":%llu,"
        "\"maximum_lifetime_us\":%llu,\"lease_mask\":%lu}",
        webCompanionOverlay ? "true" : "false",
        webCompanionConnectivity.authorized() ? "true" : "false",
        arduinoCompanionWebService.active() ? "true" : "false",
        webCompanionConnection.ready() ? "true" : "false",
        static_cast<unsigned long>(webCompanionConnectivity.generation()),
        static_cast<unsigned long long>(webCompanionConnectivity.startedUs()),
        static_cast<unsigned long long>(
            webCompanionConnectivity.lastActivityUs()),
        companion::companionLocalStopReasonName(
            webCompanionConnectivity.stopReason()),
        static_cast<unsigned long>(
            arduinoCompanionWebService.requestsHandled()),
        static_cast<unsigned long>(
            arduinoCompanionWebService.requestsRejected()),
        static_cast<unsigned long>(
            arduinoCompanionWebService.sendBackpressureEvents()),
        arduinoCompanionWebService.lastSendErrno(),
        static_cast<unsigned>(
            arduinoCompanionWebService.lastResponseBodyBytes()),
        static_cast<unsigned>(
            arduinoCompanionWebService.lastResponseBodyLength()),
        webCompanionCredentials.valid() ? "true" : "false",
        webCompanionHilEntropyPresent ? "true" : "false",
        arduinoCompanionWebService.networkCoreReady() ? "true" : "false",
        leshy1::platform::arduino::ArduinoCompanionWebService::beginStageName(
            arduinoCompanionWebService.beginStage()),
        static_cast<int>(arduinoCompanionWebService.lastError()),
        arduinoCompanionWebService.apIpv4Ready() ? "true" : "false",
        arduinoCompanionWebService.dhcpServerStarted() ? "true" : "false",
        static_cast<unsigned>(
            arduinoCompanionWebService.associatedStations()),
        arduinoCompanionWebService.cleanupComplete() ? "true" : "false",
        webCompanionTargetsSuspended() ? "true" : "false",
        static_cast<unsigned long>(webCompanionHeapBeforeSuspend),
        static_cast<unsigned long>(webCompanionHeapAfterSuspend),
        webCompanionSurveyWorkerSuspended ? "true" : "false",
        static_cast<unsigned long>(webCompanionHeapBeforeWorkerSuspend),
        static_cast<unsigned long>(webCompanionHeapAfterWorkerSuspend),
        static_cast<unsigned long>(
            arduinoCompanionWebService.heapFreeBeforeBegin()),
        static_cast<unsigned long>(
            arduinoCompanionWebService.heapLargestBeforeBegin()),
        static_cast<unsigned long>(
            arduinoCompanionWebService.heapFreeAfterBegin()),
        static_cast<unsigned long>(
            arduinoCompanionWebService.heapFreeAfterStop()),
        static_cast<unsigned long long>(
            companion::kCompanionLocalIdleTimeoutUs),
        static_cast<unsigned long long>(
            companion::kCompanionLocalMaximumLifetimeUs),
        static_cast<unsigned long>(appRuntime.activeResources()));
    reply.println(line);
}

bool computeCompanionWebHilProof(std::uint8_t output[32]) {
    static constexpr char kSchema[] =
        "leshy.companion.web.hil-proof.v1";
    if (output == nullptr || !webCompanionCredentials.valid()) return false;
    const std::uint8_t separator = 0;
    const char* passphrase = webCompanionCredentials.passphrase.data();
    mbedtls_sha256_context context;
    mbedtls_sha256_init(&context);
    const bool valid = mbedtls_sha256_starts(&context, 0) == 0 &&
        mbedtls_sha256_update(
            &context, reinterpret_cast<const std::uint8_t*>(kSchema),
            sizeof(kSchema) - 1U) == 0 &&
        mbedtls_sha256_update(&context, &separator, 1) == 0 &&
        mbedtls_sha256_update(
            &context, reinterpret_cast<const std::uint8_t*>(
                webCompanionCredentials.ssid.data()),
            std::strlen(webCompanionCredentials.ssid.data())) == 0 &&
        mbedtls_sha256_update(&context, &separator, 1) == 0 &&
        mbedtls_sha256_update(
            &context, reinterpret_cast<const std::uint8_t*>(
                passphrase),
            std::strlen(passphrase)) == 0 &&
        mbedtls_sha256_finish(&context, output) == 0;
    mbedtls_sha256_free(&context);
    return valid;
}

void emitCompanionWebHilProof(Stream& reply) {
    const bool admissible = hilSession.active() && webCompanionOverlay &&
        webCompanionConnectivity.authorized() &&
        arduinoCompanionWebService.active() &&
        webCompanionCredentials.valid();
    if (!admissible) {
        reply.println(
            "{\"schema\":\"leshy.companion.web.hil-proof.v1\","
            "\"kind\":\"error\",\"reason\":\"invalid_hil_scope\","
            "\"credential_material_exposed\":false}");
        return;
    }
    std::array<std::uint8_t, 32> digest{};
    if (!computeCompanionWebHilProof(digest.data())) {
        reply.println(
            "{\"schema\":\"leshy.companion.web.hil-proof.v1\","
            "\"kind\":\"error\",\"reason\":\"proof_failed\","
            "\"credential_material_exposed\":false}");
        return;
    }
    static constexpr char kHex[] = "0123456789abcdef";
    std::array<char, 65> encoded{};
    for (std::size_t index = 0; index < digest.size(); ++index) {
        encoded[index * 2U] = kHex[digest[index] >> 4U];
        encoded[index * 2U + 1U] = kHex[digest[index] & 0x0fU];
    }
    char line[384] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.companion.web.hil-proof.v1\","
        "\"kind\":\"state\",\"credential_sha256\":\"%s\","
        "\"ap_ipv4_ready\":%s,\"dhcp_server_started\":%s,"
        "\"associated_stations\":%u,"
        "\"credential_material_exposed\":false,"
        "\"proof_persisted\":false}",
        encoded.data(),
        arduinoCompanionWebService.apIpv4Ready() ? "true" : "false",
        arduinoCompanionWebService.dhcpServerStarted() ? "true" : "false",
        static_cast<unsigned>(
            arduinoCompanionWebService.associatedStations()));
    reply.println(line);
    volatile std::uint8_t* digestCursor = digest.data();
    for (std::size_t remaining = digest.size(); remaining != 0U; --remaining) {
        *digestCursor++ = 0;
    }
    volatile char* encodedCursor = encoded.data();
    for (std::size_t remaining = encoded.size(); remaining != 0U; --remaining) {
        *encodedCursor++ = '\0';
    }
    volatile char* lineCursor = line;
    for (std::size_t remaining = sizeof(line); remaining != 0U; --remaining) {
        *lineCursor++ = '\0';
    }
}

void armCompanionWebHilEntropy(Stream& reply, const char* command) {
    constexpr const char* prefix = "companion.web.hil-seed ";
    namespace companion = leshy1::services::companion;
    const bool admissible = hilSession.active() && webCompanionOverlay &&
        uiController.page() == 7 && targetsProductRuntime != nullptr &&
        std::strcmp(targetsProductStatus, "ready") == 0 &&
        !webCompanionConnectivity.authorized() &&
        !arduinoCompanionWebService.active() &&
        !webCompanionHilEntropyPresent;
    if (!admissible) {
        reply.println(
            "{\"schema\":\"leshy.companion.web.seed.v1\","
            "\"kind\":\"error\",\"status\":\"denied\","
            "\"reason\":\"invalid_hil_scope\","
            "\"credential_exposed\":false}");
        return;
    }
    std::array<std::uint8_t, 16> parsed{};
    if (!companion::parseCompanionHilEntropyHex(
            command + std::strlen(prefix), &parsed)) {
        reply.println(
            "{\"schema\":\"leshy.companion.web.seed.v1\","
            "\"kind\":\"error\",\"status\":\"invalid\","
            "\"reason\":\"invalid_entropy\","
            "\"credential_exposed\":false}");
        return;
    }
    webCompanionHilEntropy = parsed;
    clearWebCompanionEntropy(parsed);
    webCompanionHilEntropyPresent = true;
    std::array<std::uint8_t, 6> mac{};
    esp_read_mac(mac.data(), ESP_MAC_WIFI_SOFTAP);
    char line[256] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.companion.web.seed.v1\","
        "\"kind\":\"armed\",\"status\":\"armed\",\"bytes\":16,"
        "\"one_shot\":true,\"softap_mac\":"
        "\"%02x:%02x:%02x:%02x:%02x:%02x\","
        "\"credential_exposed\":false}",
        static_cast<unsigned>(mac[0]), static_cast<unsigned>(mac[1]),
        static_cast<unsigned>(mac[2]), static_cast<unsigned>(mac[3]),
        static_cast<unsigned>(mac[4]), static_cast<unsigned>(mac[5]));
    reply.println(line);
}

void emitWifiFrameCaptureState(Stream& reply) {
    const auto stats = wifiFrameCapture.stats();
    const auto& plan = wifiFrameCapture.capture().plan();
    const std::size_t pcapBytes =
        leshy1::apps::capture::radiotapPcapSize(wifiFrameCapture.capture());
    char line[1024] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.capture.wifi_frame.v1\",\"kind\":\"state\","
        "\"state\":\"%s\",\"passive_only\":true,\"rx_only\":true,"
        "\"application_connect_calls\":0,\"application_raw_tx_calls\":0,"
        "\"physical_no_tx_verified\":false,\"storage_written\":%s,"
        "\"volatile_ram\":true,\"immutable_after_stop\":true,"
        "\"persist_state\":\"%s\",\"persist_status\":\"%s\","
        "\"persist_generation\":%lu,"
        "\"heap_free_before_mount\":%lu,"
        "\"heap_largest_before_mount\":%lu,"
        "\"filesystem_mount_error\":%d,"
        "\"channel_plan\":%u,\"current_channel\":%u,"
        "\"duration_ms\":%lu,\"channel_dwell_ms\":%u,"
        "\"snap_length\":%u,\"maximum_frames\":%u,"
        "\"started_us\":%llu,\"ended_us\":%llu,"
        "\"frames_reported\":%lu,\"frames_accepted\":%lu,"
        "\"frames_dropped_capacity\":%lu,"
        "\"frames_dropped_invalid\":%lu,\"payload_bytes\":%lu,"
        "\"driver_error\":%ld,\"pcap_available\":%s,"
        "\"pcap_bytes\":%u,\"pcap_linktype\":127,"
        "\"pcap_timebase\":\"monotonic_us\","
        "\"cleanup_complete\":%s,\"lease_mask\":%lu}",
        leshy1::apps::capture::wifiFrameCaptureStateName(stats.state),
        capturePersistState == CapturePersistState::Saved ? "true" : "false",
        capturePersistStateName(capturePersistState), capturePersistStatus,
        static_cast<unsigned long>(capturePersistGeneration),
        static_cast<unsigned long>(capturePersistHeapFreeBeforeMount),
        static_cast<unsigned long>(capturePersistHeapLargestBeforeMount),
        capturePersistFilesystemMountError,
        static_cast<unsigned>(plan.channel),
        static_cast<unsigned>(wifiFrameCapture.currentChannel()),
        static_cast<unsigned long>(plan.durationMs),
        static_cast<unsigned>(plan.channelDwellMs),
        static_cast<unsigned>(plan.snapLength),
        static_cast<unsigned>(plan.maximumFrames),
        static_cast<unsigned long long>(stats.startedUs),
        static_cast<unsigned long long>(stats.endedUs),
        static_cast<unsigned long>(stats.framesReported),
        static_cast<unsigned long>(stats.framesAccepted),
        static_cast<unsigned long>(stats.framesDroppedCapacity),
        static_cast<unsigned long>(stats.framesDroppedInvalid),
        static_cast<unsigned long>(stats.payloadBytes),
        static_cast<long>(stats.driverError),
        pcapBytes == 0U ? "false" : "true",
        static_cast<unsigned>(pcapBytes),
        wifiFrameCapture.cleanupComplete() ? "true" : "false",
        static_cast<unsigned long>(appRuntime.activeResources()));
    reply.println(line);
}

void emitAirspaceGuardState(Stream& reply) {
    if (bleInspectorWorkspaceActive()) {
        reply.println(
            "{\"schema\":\"leshy.airspace_guard.v1\","
            "\"kind\":\"error\","
            "\"reason\":\"workspace_owned_by_ble_inspector\"}");
        return;
    }
    const auto capture = wifiFrameCapture.stats();
    const auto monitor = wifiFrameCapture.airspaceGuardMonitorStats();
    std::uint32_t findingMask = 0U;
    bool elevatedNoiseLowConfidence = true;
    for (std::size_t index = 0;
         index < airspaceGuardController.findingCount(); ++index) {
        const auto* finding = airspaceGuardController.finding(index);
        if (finding == nullptr) continue;
        const std::uint8_t kind = static_cast<std::uint8_t>(finding->kind);
        if (kind < 32U) findingMask |= 1UL << kind;
        if (finding->kind ==
                leshy1::services::guard::AirspaceFindingKind::
                    WifiElevatedNoise &&
            finding->confidence !=
                leshy1::services::guard::AirspaceConfidence::Low) {
            elevatedNoiseLowConfidence = false;
        }
    }
    const auto workerControl = airspaceGuardBleControl();
    const auto& bleWorkerEvent = airspaceGuardBleEventWorkspace;
    auto& line = diagnosticJson;
    const int written = std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.airspace_guard.v1\",\"kind\":\"state\","
        "\"capture_state\":\"%s\",\"generation\":%lu,"
        "\"view\":\"%s\",\"load_status\":\"%s\","
        "\"outcome\":\"%s\",\"evidence_incomplete\":%s,"
        "\"finding_count\":%u,\"finding_mask\":%lu,"
        "\"finding_selection\":%u,\"evidence_selection\":%u,"
        "\"elevated_noise_low_confidence\":%s,"
        "\"source_frames_observed\":%u,\"frames_available\":%u,"
        "\"frames_inspected\":%u,\"disconnect_frames\":%u,"
        "\"identity_frames\":%u,\"ble_records\":%u,"
        "\"noise_samples_observed\":%u,"
        "\"noise_samples_available\":%u,"
        "\"noise_samples_inspected\":%u,"
        "\"noise_samples_dropped\":%u,"
        "\"noise_samples_malformed\":%u,"
        "\"malformed_frames\":%u,\"source_read_failures\":%u,"
        "\"source_frames_dropped\":%u,\"findings_dropped\":%u,"
        "\"inspection_truncated\":%s,"
        "\"wifi_capture_state\":\"%s\",\"wifi_driver_error\":%ld,"
        "\"wifi_cleanup_complete\":%s,\"wifi_monitor_active\":%s,"
        "\"wifi_frames_reported\":%lu,\"wifi_frames_retained\":%lu,"
        "\"wifi_disconnects_retained\":%lu,"
        "\"wifi_disconnects_dropped\":%lu,"
        "\"wifi_identity_observed\":%lu,"
        "\"wifi_identity_retained\":%lu,"
        "\"wifi_identity_projected\":%lu,"
        "\"wifi_identity_deduplicated\":%lu,"
        "\"wifi_identity_dropped\":%lu,"
        "\"wifi_identity_malformed_envelope\":%lu,"
        "\"wifi_identity_malformed_addressing\":%lu,"
        "\"wifi_identity_malformed_elements\":%lu,"
        "\"wifi_noise_observed\":%lu,\"wifi_noise_retained\":%lu,"
        "\"wifi_noise_dropped\":%lu,\"wifi_invalid_frames\":%lu,"
        "\"wifi_receive_invalid_frames\":%lu,"
        "\"wifi_ignored_frames\":%lu,\"wifi_channel_hops\":%lu,"
        "\"wifi_identity_retention_complete\":%s,"
        "\"wifi_noise_retention_complete\":%s,"
        "\"ble_worker_control\":%u,\"ble_worker_ready\":%s,"
        "\"ble_worker_generation\":%lu,\"ble_worker_status\":\"%s\","
        "\"ble_worker_valid\":%s,\"ble_cleanup_complete\":%s,"
        "\"ble_capacity_drop_requested\":%s,"
        "\"ble_capacity_drop_injected\":%s,"
        "\"ble_scan_status\":\"%s\",\"ble_scan_attempts\":%u,"
        "\"ble_scan_transient_retries\":%u,"
        "\"ble_scan_observed\":%u,\"ble_scan_reported\":%u,"
        "\"ble_scan_read\":%u,\"ble_scan_accepted\":%u,"
        "\"ble_scan_rejected\":%u,\"ble_scan_dropped\":%u,"
        "\"ble_retention_observed\":%u,"
        "\"ble_retention_valid\":%u,"
        "\"ble_retention_trackers\":%u,"
        "\"ble_retention_retained\":%u,"
        "\"ble_retention_ignored\":%u,"
        "\"ble_retention_malformed\":%u,"
        "\"ble_retention_dropped\":%u,"
        "\"survey_queues_released\":%s,"
        "\"heap_free_before_queue_release\":%lu,"
        "\"heap_largest_before_queue_release\":%lu,"
        "\"heap_free_after_queue_release\":%lu,"
        "\"heap_largest_after_queue_release\":%lu,"
        "\"heap_free_after_queue_restore\":%lu,"
        "\"passive_only\":true,\"rx_only\":true,"
        "\"application_connect_calls\":0,"
        "\"application_raw_tx_calls\":0,"
        "\"runtime_owner\":\"%s\",\"lease_mask\":%lu}",
        airspaceGuardCaptureStateName(airspaceGuardCaptureState),
        static_cast<unsigned long>(airspaceGuardGeneration),
        leshy1::apps::guard::airspaceGuardViewName(
            airspaceGuardController.view()),
        leshy1::apps::guard::airspaceGuardLoadStatusName(
            airspaceGuardController.loadStatus()),
        leshy1::services::guard::airspaceGuardStatusName(
            airspaceGuardController.outcome()),
        airspaceGuardController.evidenceIncomplete() ? "true" : "false",
        static_cast<unsigned>(airspaceGuardController.findingCount()),
        static_cast<unsigned long>(findingMask),
        static_cast<unsigned>(airspaceGuardController.findingSelection()),
        static_cast<unsigned>(airspaceGuardController.evidenceSelection()),
        elevatedNoiseLowConfidence ? "true" : "false",
        static_cast<unsigned>(airspaceGuardController.sourceFramesObserved()),
        static_cast<unsigned>(airspaceGuardController.framesAvailable()),
        static_cast<unsigned>(airspaceGuardController.framesInspected()),
        static_cast<unsigned>(airspaceGuardController.disconnectFrames()),
        static_cast<unsigned>(
            airspaceGuardController.identityAdvertisementFrames()),
        static_cast<unsigned>(airspaceGuardController.bleAdvertisementRecords()),
        static_cast<unsigned>(
            airspaceGuardController.wifiNoiseSamplesObserved()),
        static_cast<unsigned>(
            airspaceGuardController.wifiNoiseSamplesAvailable()),
        static_cast<unsigned>(
            airspaceGuardController.wifiNoiseSamplesInspected()),
        static_cast<unsigned>(
            airspaceGuardController.wifiNoiseSamplesDropped()),
        static_cast<unsigned>(
            airspaceGuardController.wifiNoiseSamplesMalformed()),
        static_cast<unsigned>(airspaceGuardController.malformedFrames()),
        static_cast<unsigned>(airspaceGuardController.sourceReadFailures()),
        static_cast<unsigned>(airspaceGuardController.sourceFramesDropped()),
        static_cast<unsigned>(airspaceGuardController.findingsDropped()),
        airspaceGuardController.inspectionTruncated() ? "true" : "false",
        leshy1::apps::capture::wifiFrameCaptureStateName(capture.state),
        static_cast<long>(capture.driverError),
        wifiFrameCapture.cleanupComplete() ? "true" : "false",
        monitor.active ? "true" : "false",
        static_cast<unsigned long>(monitor.framesReported),
        static_cast<unsigned long>(monitor.framesRetained),
        static_cast<unsigned long>(monitor.disconnectFramesRetained),
        static_cast<unsigned long>(monitor.disconnectFramesDropped),
        static_cast<unsigned long>(monitor.identityAdvertisementsObserved),
        static_cast<unsigned long>(monitor.identityProfilesRetained),
        static_cast<unsigned long>(monitor.identityProfilesProjected),
        static_cast<unsigned long>(monitor.identityProfilesDeduplicated),
        static_cast<unsigned long>(monitor.identityProfilesDropped),
        static_cast<unsigned long>(monitor.identityMalformedEnvelope),
        static_cast<unsigned long>(monitor.identityMalformedAddressing),
        static_cast<unsigned long>(monitor.identityMalformedElements),
        static_cast<unsigned long>(monitor.noiseSamplesObserved),
        static_cast<unsigned long>(monitor.noiseSamplesRetained),
        static_cast<unsigned long>(monitor.noiseSamplesDropped),
        static_cast<unsigned long>(monitor.invalidFrames),
        static_cast<unsigned long>(monitor.receiveInvalidFrames),
        static_cast<unsigned long>(monitor.ignoredFrames),
        static_cast<unsigned long>(monitor.channelHops),
        monitor.identityRetentionComplete ? "true" : "false",
        monitor.noiseRetentionComplete ? "true" : "false",
        static_cast<unsigned>(workerControl),
        productSurveyWorkerReady ? "true" : "false",
        static_cast<unsigned long>(bleWorkerEvent.generation),
        bleWorkerEvent.status,
        bleWorkerEvent.valid ? "true" : "false",
        bleWorkerEvent.cleanupComplete ? "true" : "false",
        bleWorkerEvent.capacityDropRequested ? "true" : "false",
        bleWorkerEvent.capacityDropInjected ? "true" : "false",
        leshy1::platform::arduino::boardBleScanStatusName(
            bleWorkerEvent.scan.status),
        static_cast<unsigned>(bleWorkerEvent.scan.attempts),
        static_cast<unsigned>(bleWorkerEvent.scan.transientRetries),
        static_cast<unsigned>(bleWorkerEvent.scan.recordsObserved),
        static_cast<unsigned>(bleWorkerEvent.scan.recordsReported),
        static_cast<unsigned>(bleWorkerEvent.scan.recordsRead),
        static_cast<unsigned>(bleWorkerEvent.scan.accepted),
        static_cast<unsigned>(bleWorkerEvent.scan.rejected),
        static_cast<unsigned>(bleWorkerEvent.scan.dropped),
        static_cast<unsigned>(bleWorkerEvent.retention.recordsObserved),
        static_cast<unsigned>(bleWorkerEvent.retention.validAdvertisements),
        static_cast<unsigned>(bleWorkerEvent.retention.trackerAdvertisements),
        static_cast<unsigned>(bleWorkerEvent.retention.recordsRetained),
        static_cast<unsigned>(
            bleWorkerEvent.retention.advertisementsIgnored),
        static_cast<unsigned>(bleWorkerEvent.retention.malformedRecords),
        static_cast<unsigned>(bleWorkerEvent.retention.capacityDrops),
        airspaceGuardSurveyQueuesReleased ? "true" : "false",
        static_cast<unsigned long>(
            airspaceGuardHeapFreeBeforeQueueRelease),
        static_cast<unsigned long>(
            airspaceGuardHeapLargestBeforeQueueRelease),
        static_cast<unsigned long>(
            airspaceGuardHeapFreeAfterQueueRelease),
        static_cast<unsigned long>(
            airspaceGuardHeapLargestAfterQueueRelease),
        static_cast<unsigned long>(
            airspaceGuardHeapFreeAfterQueueRestore),
        appRuntime.activeApp(),
        static_cast<unsigned long>(appRuntime.activeResources()));
    if (written <= 0 || static_cast<std::size_t>(written) >= sizeof(line)) {
        reply.println(
            "{\"schema\":\"leshy.airspace_guard.v1\","
            "\"kind\":\"error\",\"reason\":\"state_overflow\"}");
        return;
    }
    reply.println(line);
}

