anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void emitAirspaceGuardCapacityDropTest(Stream& reply,
                                       const char* command) {
    const bool arm = std::strcmp(
        command, "airspace-guard.test-capacity-drop once") == 0;
    const bool clear = std::strcmp(
        command, "airspace-guard.test-capacity-drop clear") == 0;
    const bool workerIdle = airspaceGuardBleControl() ==
        AirspaceGuardBleWorkerControl::Idle;
    const bool safeState = hilSession.active() && workerIdle &&
        airspaceGuardCaptureState == AirspaceGuardCaptureState::Idle &&
        uiController.isRoot() && !appRuntime.running();
    const char* status = "invalid_request";
    if (clear && workerIdle) {
        setAirspaceGuardBleCapacityDropInjection(false);
        status = "cleared";
    } else if (arm && safeState) {
        setAirspaceGuardBleCapacityDropInjection(true);
        status = "armed";
    } else if (arm) {
        status = "unsafe_state";
    }
    char line[448] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.airspace_guard.capacity_drop_test.v1\","
        "\"kind\":\"state\",\"status\":\"%s\",\"one_shot\":true,"
        "\"armed\":%s,\"hil_active\":%s,\"worker_idle\":%s,"
        "\"ui_home\":%s,\"runtime_owner\":\"%s\",\"lease_mask\":%lu,"
        "\"hardware_touched\":false,\"radio_started\":false,"
        "\"storage_mounted\":false,\"storage_written\":false}",
        status,
        airspaceGuardBleCapacityDropInjectionArmed() ? "true" : "false",
        hilSession.active() ? "true" : "false",
        workerIdle ? "true" : "false",
        uiController.isRoot() ? "true" : "false",
        appRuntime.activeApp(),
        static_cast<unsigned long>(appRuntime.activeResources()));
    reply.println(line);
}

struct StreamPcapSink final {
    Stream* stream = nullptr;
};

bool writePcapBytes(const std::uint8_t* data, std::size_t size,
                    void* context) {
    auto* sink = static_cast<StreamPcapSink*>(context);
    return sink != nullptr && sink->stream != nullptr &&
           sink->stream->write(data, size) == size;
}

void emitWifiFrameCapturePcap(Stream& reply) {
    const auto stats = wifiFrameCapture.stats();
    const std::size_t expected =
        leshy1::apps::capture::radiotapPcapSize(wifiFrameCapture.capture());
    if (stats.state != WifiFrameCaptureState::Complete || expected == 0U) {
        reply.println(
            "{\"schema\":\"leshy.capture.pcap.v1\",\"kind\":\"error\","
            "\"reason\":\"capture_not_complete\"}");
        return;
    }
    char line[320] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.capture.pcap.v1\",\"kind\":\"pcap_begin\","
        "\"bytes\":%u,\"frames\":%u,\"linktype\":127,"
        "\"timebase\":\"monotonic_us\",\"streaming\":true,"
        "\"payload_retained_by_firmware\":true,"
        "\"storage_written\":false}",
        static_cast<unsigned>(expected),
        static_cast<unsigned>(wifiFrameCapture.capture().size()));
    reply.println(line);
    reply.flush();
    StreamPcapSink sink{&reply};
    const PcapExportResult result =
        leshy1::apps::capture::writeRadiotapPcap(
            wifiFrameCapture.capture(), writePcapBytes, &sink);
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.capture.pcap.v1\",\"kind\":\"pcap_end\","
        "\"status\":\"%s\",\"bytes\":%u,\"frames\":%u,"
        "\"storage_written\":false}",
        result.valid ? "valid" : "stream_failed",
        static_cast<unsigned>(result.bytesWritten),
        static_cast<unsigned>(result.framesWritten));
    reply.println(line);
    reply.flush();
}

void emitSubGhzRawCaptureState(Stream& reply) {
    const auto& stats = subGhzRawCapture.stats();
    const auto& plan = subGhzRawCapture.plan();
    const bool noTransmit = cc1101SpectrumReport.txStrobes == 0U &&
        cc1101SpectrumReport.paTableWrites == 0U &&
        cc1101SpectrumReport.fifoWrites == 0U;
    char line[1280] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.capture.subghz_raw.v1\",\"kind\":\"state\","
        "\"state\":\"%s\",\"passive_only\":true,\"rx_only\":true,"
        "\"modulation\":\"%s\",\"frequency_khz\":%lu,"
        "\"threshold_dbm\":%d,\"wait_timeout_ms\":%lu,"
        "\"maximum_capture_ms\":%lu,"
        "\"debounce_us\":%u,\"minimum_fsk_pulse_us\":%u,"
        "\"end_gap_us\":%u,"
        "\"maximum_pulses\":%u,\"started_us\":%llu,"
        "\"signal_started_us\":%llu,\"ended_us\":%llu,"
        "\"samples\":%lu,\"invalid_samples\":%lu,"
        "\"short_transitions_rejected\":%lu,\"pulses\":%u,"
        "\"start_level\":%s,\"truncated\":%s,"
        "\"driver_error\":%ld,\"csv_available\":%s,"
        "\"application_tx_calls\":0,\"tx_strobes\":%lu,"
        "\"pa_table_writes\":%lu,\"fifo_writes\":%lu,"
        "\"receiver_register_writes\":%lu,"
        "\"receiver_command_strobes\":%lu,"
        "\"receiver_reset_strobes\":%lu,"
        "\"receiver_receive_strobes\":%lu,"
        "\"receiver_idle_strobes\":%lu,"
        "\"receiver_rejected_strobes\":%lu,"
        "\"gdo0_gpio\":%d,\"fsk_transport_active\":%s,"
        "\"fsk_transport_arms\":%lu,\"fsk_edges_drained\":%lu,"
        "\"fsk_transport_overflows\":%lu,"
        "\"physical_no_tx_verified\":%s,\"cleanup_complete\":%s,"
        "\"storage_written\":%s,\"persist_state\":\"%s\","
        "\"persist_status\":\"%s\",\"persist_generation\":%lu,"
        "\"heap_free_before_mount\":%lu,"
        "\"heap_largest_before_mount\":%lu,"
        "\"filesystem_mount_error\":%d,"
        "\"lease_mask\":%lu}",
        leshy1::apps::capture::subGhzRawCaptureStateName(stats.state),
        leshy1::domain::captures::subGhzRawModulationName(plan.modulation),
        static_cast<unsigned long>(plan.frequencyKHz),
        static_cast<int>(plan.thresholdDbm),
        static_cast<unsigned long>(plan.waitTimeoutMs),
        static_cast<unsigned long>(plan.maximumCaptureMs),
        static_cast<unsigned>(plan.debounceUs),
        static_cast<unsigned>(plan.minimumFskPulseUs),
        static_cast<unsigned>(plan.endGapUs),
        static_cast<unsigned>(plan.maximumPulses),
        static_cast<unsigned long long>(stats.startedUs),
        static_cast<unsigned long long>(stats.signalStartedUs),
        static_cast<unsigned long long>(stats.endedUs),
        static_cast<unsigned long>(stats.samples),
        static_cast<unsigned long>(stats.invalidSamples),
        static_cast<unsigned long>(stats.shortTransitionsRejected),
        static_cast<unsigned>(subGhzRawCapture.pulseCount()),
        stats.startLevel ? "true" : "false",
        stats.truncated ? "true" : "false",
        static_cast<long>(stats.driverError),
        stats.state == SubGhzRawCaptureState::Complete ? "true" : "false",
        static_cast<unsigned long>(cc1101SpectrumReport.txStrobes),
        static_cast<unsigned long>(cc1101SpectrumReport.paTableWrites),
        static_cast<unsigned long>(cc1101SpectrumReport.fifoWrites),
        static_cast<unsigned long>(cc1101SpectrumReport.registerWrites),
        static_cast<unsigned long>(cc1101SpectrumReport.commandStrobes),
        static_cast<unsigned long>(cc1101SpectrumReport.resetStrobes),
        static_cast<unsigned long>(cc1101SpectrumReport.receiveStrobes),
        static_cast<unsigned long>(cc1101SpectrumReport.idleStrobes),
        static_cast<unsigned long>(cc1101SpectrumReport.rejectedStrobes),
        BoardProfile::kCc1101Gdo0Pin,
        boardCc1101Spectrum.asyncEdgeCaptureActive() ? "true" : "false",
        static_cast<unsigned long>(subGhzFskTransportArms),
        static_cast<unsigned long>(subGhzFskEdgesDrained),
        static_cast<unsigned long>(subGhzFskTransportOverflows),
        noTransmit && cc1101SpectrumReport.cleanupComplete
            ? "true" : "false",
        cc1101SpectrumReport.cleanupComplete ? "true" : "false",
        subGhzCapturePersistState == CapturePersistState::Saved
            ? "true" : "false",
        capturePersistStateName(subGhzCapturePersistState),
        subGhzCapturePersistStatus,
        static_cast<unsigned long>(subGhzCapturePersistGeneration),
        static_cast<unsigned long>(subGhzCapturePersistHeapFreeBeforeMount),
        static_cast<unsigned long>(subGhzCapturePersistHeapLargestBeforeMount),
        subGhzCapturePersistFilesystemMountError,
        static_cast<unsigned long>(appRuntime.activeResources()));
    reply.println(line);
}

void emitSubGhzRawCaptureCsv(Stream& reply) {
    const auto& stats = subGhzRawCapture.stats();
    if (stats.state != SubGhzRawCaptureState::Complete ||
        subGhzRawCapture.pulseCount() == 0U) {
        reply.println(
            "{\"schema\":\"leshy.capture.subghz_raw.csv.v1\","
            "\"kind\":\"error\",\"reason\":\"capture_not_complete\"}");
        return;
    }
    char line[160] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.capture.subghz_raw.csv.v1\","
        "\"kind\":\"csv_begin\",\"pulses\":%u,"
        "\"frequency_khz\":%lu,\"modulation\":\"%s\","
        "\"streaming\":true}",
        static_cast<unsigned>(subGhzRawCapture.pulseCount()),
        static_cast<unsigned long>(subGhzRawCapture.plan().frequencyKHz),
        leshy1::domain::captures::subGhzRawModulationName(
            subGhzRawCapture.plan().modulation));
    reply.println(line);
    reply.flush();

    std::size_t bytes = 0;
    const auto header = leshy1::apps::capture::formatSubGhzRawCsvHeader(
        line, sizeof(line));
    bool valid = header.valid &&
        reply.write(reinterpret_cast<const std::uint8_t*>(line),
                    header.bytes) == header.bytes;
    bytes += valid ? header.bytes : 0U;
    for (std::size_t index = 0;
         valid && index < subGhzRawCapture.pulseCount(); ++index) {
        const auto row = leshy1::apps::capture::formatSubGhzRawCsvRow(
            subGhzRawCapture, index, stats.startLevel, line, sizeof(line));
        valid = row.valid &&
            reply.write(reinterpret_cast<const std::uint8_t*>(line),
                        row.bytes) == row.bytes;
        bytes += valid ? row.bytes : 0U;
    }
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.capture.subghz_raw.csv.v1\","
        "\"kind\":\"csv_end\",\"status\":\"%s\",\"bytes\":%u,"
        "\"pulses\":%u}",
        valid ? "valid" : "stream_failed", static_cast<unsigned>(bytes),
        static_cast<unsigned>(subGhzRawCapture.pulseCount()));
    reply.println(line);
    reply.flush();
}

void emitInfraredRawCaptureState(Stream& reply) {
    const auto& stats = infraredCapture.stats();
    const auto& plan = infraredCapture.plan();
    const auto& decode = infraredCapture.decode();
    char line[1280] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.capture.infrared_raw.v1\",\"kind\":\"state\","
        "\"state\":\"%s\",\"passive_only\":true,\"rx_only\":true,"
        "\"gpio_rx\":%d,\"gpio_tx\":%d,\"tx_level\":\"low\","
        "\"application_tx_calls\":0,\"wait_timeout_ms\":%lu,"
        "\"maximum_capture_ms\":%lu,\"minimum_pulse_us\":%u,"
        "\"end_gap_us\":%u,\"maximum_sample_gap_us\":%u,"
        "\"maximum_pulses\":%u,\"started_us\":%llu,"
        "\"signal_started_us\":%llu,\"ended_us\":%llu,"
        "\"samples\":%lu,\"transitions\":%lu,"
        "\"invalid_samples\":%lu,\"short_pulses_rejected\":%lu,"
        "\"maximum_observed_sample_gap_us\":%lu,\"pulses\":%u,"
        "\"start_level\":%s,\"truncated\":%s,\"driver_error\":%ld,"
        "\"protocol\":\"%s\",\"raw_code\":%lu,\"address\":%u,"
        "\"command\":%u,\"decode_integrity_valid\":%s,"
        "\"csv_available\":%s,\"cleanup_complete\":%s,"
        "\"storage_written\":%s,\"persist_state\":\"%s\","
        "\"persist_status\":\"%s\",\"persist_generation\":%lu,"
        "\"heap_free_before_mount\":%lu,"
        "\"heap_largest_before_mount\":%lu,"
        "\"filesystem_mount_error\":%d,"
        "\"lease_mask\":%lu}",
        leshy1::apps::capture::infraredCaptureStateName(stats.state),
        BoardProfile::kIrRxPin, BoardProfile::kIrTxPin,
        static_cast<unsigned long>(plan.waitTimeoutMs),
        static_cast<unsigned long>(plan.maximumCaptureMs),
        static_cast<unsigned>(plan.minimumPulseUs),
        static_cast<unsigned>(plan.endGapUs),
        static_cast<unsigned>(plan.maximumSampleGapUs),
        static_cast<unsigned>(plan.maximumPulses),
        static_cast<unsigned long long>(stats.startedUs),
        static_cast<unsigned long long>(stats.signalStartedUs),
        static_cast<unsigned long long>(stats.endedUs),
        static_cast<unsigned long>(stats.samples),
        static_cast<unsigned long>(infraredReceiverReport.transitions),
        static_cast<unsigned long>(stats.invalidSamples),
        static_cast<unsigned long>(stats.shortPulsesRejected),
        static_cast<unsigned long>(stats.maximumObservedSampleGapUs),
        static_cast<unsigned>(infraredCapture.pulseCount()),
        stats.startLevel ? "true" : "false",
        stats.truncated ? "true" : "false",
        static_cast<long>(stats.driverError),
        leshy1::domain::captures::infraredProtocolName(decode.protocol),
        static_cast<unsigned long>(decode.rawCode),
        static_cast<unsigned>(decode.address),
        static_cast<unsigned>(decode.command),
        decode.integrityValid ? "true" : "false",
        stats.state == InfraredCaptureState::Complete ? "true" : "false",
        infraredReceiverReport.cleanupComplete ? "true" : "false",
        infraredCapturePersistState == CapturePersistState::Saved
            ? "true" : "false",
        capturePersistStateName(infraredCapturePersistState),
        infraredCapturePersistStatus,
        static_cast<unsigned long>(infraredCapturePersistGeneration),
        static_cast<unsigned long>(infraredCapturePersistHeapFreeBeforeMount),
        static_cast<unsigned long>(infraredCapturePersistHeapLargestBeforeMount),
        infraredCapturePersistFilesystemMountError,
        static_cast<unsigned long>(appRuntime.activeResources()));
    reply.println(line);
}

void emitInfraredRawCaptureCsv(Stream& reply) {
    const auto& stats = infraredCapture.stats();
    if (stats.state != InfraredCaptureState::Complete ||
        infraredCapture.pulseCount() == 0U) {
        reply.println(
            "{\"schema\":\"leshy.capture.infrared_raw.csv.v1\","
            "\"kind\":\"error\",\"reason\":\"capture_not_complete\"}");
        return;
    }
    char line[192] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.capture.infrared_raw.csv.v1\","
        "\"kind\":\"csv_begin\",\"pulses\":%u,"
        "\"protocol\":\"%s\",\"streaming\":true}",
        static_cast<unsigned>(infraredCapture.pulseCount()),
        leshy1::domain::captures::infraredProtocolName(
            infraredCapture.decode().protocol));
    reply.println(line);
    reply.flush();

    std::size_t bytes = 0;
    const auto header = leshy1::apps::capture::formatInfraredCsvHeader(
        line, sizeof(line));
    bool valid = header.valid &&
        reply.write(reinterpret_cast<const std::uint8_t*>(line),
                    header.bytes) == header.bytes;
    bytes += valid ? header.bytes : 0U;
    for (std::size_t index = 0;
         valid && index < infraredCapture.pulseCount(); ++index) {
        const auto row = leshy1::apps::capture::formatInfraredCsvRow(
            infraredCapture, index, stats.startLevel, line, sizeof(line));
        valid = row.valid &&
            reply.write(reinterpret_cast<const std::uint8_t*>(line),
                        row.bytes) == row.bytes;
        bytes += valid ? row.bytes : 0U;
    }
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.capture.infrared_raw.csv.v1\","
        "\"kind\":\"csv_end\",\"status\":\"%s\",\"bytes\":%u,"
        "\"pulses\":%u}",
        valid ? "valid" : "stream_failed", static_cast<unsigned>(bytes),
        static_cast<unsigned>(infraredCapture.pulseCount()));
    reply.println(line);
    reply.flush();
}

