anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void emitSurveyBrowser(Stream& reply) {
    const Observation* selected = surveyController.selected();
    const ObservationHistory history = surveyController.selectedHistory();
    char line[768] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.survey.browser.v1\",\"kind\":\"state\","
        "\"view\":\"%s\",\"filter\":\"%s\",\"draft_filter\":\"%s\","
        "\"filter_focused\":%s,\"total\":%u,\"visible\":%u,"
        "\"selection\":%u,\"selected\":%s,\"selected_radio\":\"%s\","
        "\"history_valid\":%s,\"history_samples\":%u,"
        "\"history_retained\":%u,\"history_min_rssi_dbm\":%d,"
        "\"history_max_rssi_dbm\":%d,\"history_latest_rssi_dbm\":%d,"
        "\"read_only_query\":true,\"radio_touched\":false,"
        "\"storage_touched\":false}",
        leshy1::apps::survey::surveyViewName(surveyController.view()),
        leshy1::apps::survey::surveyFilterName(surveyController.filter()),
        leshy1::apps::survey::surveyFilterName(surveyController.draftFilter()),
        surveyController.filterFocused() ? "true" : "false",
        static_cast<unsigned>(surveySession.size()),
        static_cast<unsigned>(surveyController.visibleSize()),
        static_cast<unsigned>(surveyController.selection()),
        selected == nullptr ? "false" : "true",
        selected == nullptr ? "none"
                            : (selected->radio == RadioKind::Ble ? "ble" : "wifi"),
        history.valid ? "true" : "false",
        static_cast<unsigned>(history.sampleCount),
        static_cast<unsigned>(history.retainedSamples),
        static_cast<int>(history.minimumRssiDbm),
        static_cast<int>(history.maximumRssiDbm),
        static_cast<int>(history.latestRssiDbm));
    reply.println(line);
}

bool startWifiNetworksProduct() {
    if (surveyWorkflow.state() != SurveyWorkflowState::Setup) {
        surveyPipeline.resetToSetup();
    }
    closeProductSurveyBackend();
    wifiNetworkCatalog.reset();
    wifiNetworkNavigationOrder.reset();
    wifiNetworkSelection = 0;
    wifiNetworkDetail = {};
    wifiNetworkRenderedDetail = {};
    wifiNetworkDetailSignal = {};
    productSurveyRuntime = {};
    productSurveyRuntime.selected = true;
    productSurveyRuntime.workerReady = productSurveyWorkerReady;
    surveySourceController.rebuild(inventory, false,
                                   SurveySourceScope::WifiOnly);
    const SurveyWorkflowStatus configured =
        surveyWorkflow.configure(true, false);
    if (configured != SurveyWorkflowStatus::Ready) {
        productSurveyRuntime.status = "workflow_config_failed";
        lastRuntimeEvent = productSurveyRuntime.status;
        return false;
    }
    wifiProductView = WifiProductView::Networks;
    if (!startProductSurvey()) {
        wifiProductView = WifiProductView::Menu;
        return false;
    }
    lastRuntimeEvent = "wifi_networks_preparing";
    return true;
}

bool startBleDevicesProduct() {
    if (surveyWorkflow.state() != SurveyWorkflowState::Setup) {
        surveyPipeline.resetToSetup();
    }
    closeProductSurveyBackend();
    bleDeviceCatalog.reset();
    bleDeviceNavigationOrder.reset();
    bleDeviceSelection = 0;
    bleDeviceDetail = {};
    bleDeviceRenderedDetail = {};
    bleDeviceDetailSignal = {};
    if (airspaceGuardBleControl() !=
            AirspaceGuardBleWorkerControl::Idle) {
        productSurveyRuntime = {};
        productSurveyRuntime.selected = true;
        productSurveyRuntime.status = "ble_workspace_busy";
        lastRuntimeEvent = productSurveyRuntime.status;
        return false;
    }
    if (!prepareBleProductSurveyMemory()) {
        productSurveyRuntime = {};
        productSurveyRuntime.selected = true;
        productSurveyRuntime.status = "ble_memory_unavailable";
        lastRuntimeEvent = productSurveyRuntime.status;
        return false;
    }
    if (!activateBleInspectorWorkspace()) {
        (void)restoreBleProductSurveyMemory();
        productSurveyRuntime = {};
        productSurveyRuntime.selected = true;
        productSurveyRuntime.status = "ble_workspace_unavailable";
        lastRuntimeEvent = productSurveyRuntime.status;
        return false;
    }
    resetBleInspectorCapture();
    bleDeviceRenderedRadar = {};
    nextBleDeviceUiRefreshUs = 0U;
    bleDeviceUiRefreshPending = false;
    resetBleDeviceListRenderCache();
    bleDeviceListRowRepaints = 0U;
    bleDeviceListContentClears = 0U;
    bleDeviceDetailContentClears = 0U;
    bleDeviceRadarFullRepaints = 0U;
    bleDeviceRadarDeltaRepaints = 0U;
    bleDeviceDetailRefreshes = 0U;
    bleDeviceDetailRefreshesDeferred = 0U;
    bleDeviceAtomicTextRowPushes = 0U;
    bleDeviceAtomicTextRowAllocationFailures = 0U;
    bleDeviceDirectTextRowFallbacks = 0U;
    productSurveyRuntime = {};
    productSurveyRuntime.selected = true;
    productSurveyRuntime.workerReady = productSurveyWorkerReady;
    surveySourceController.rebuild(inventory, false,
                                   SurveySourceScope::BleOnly);
    const SurveyWorkflowStatus configured =
        surveyWorkflow.configure(true, false);
    bleProductView = BleProductView::Devices;
    if (configured != SurveyWorkflowStatus::Ready) {
        productSurveyRuntime.status = "workflow_config_failed";
        lastRuntimeEvent = productSurveyRuntime.status;
        return true;
    }
    if (!startProductSurvey()) return true;
    lastRuntimeEvent = "ble_devices_preparing";
    return true;
}

bool bleSelectedDeviceConnectable() {
    const Observation* device = liveBleDeviceDetail();
    return device != nullptr && device->identityLength == 6U &&
        device->bleAdvertisement.present &&
        device->bleAdvertisement.connectable;
}

bool requestBleGattFromDetail() {
    const Observation* device = liveBleDeviceDetail();
    if (device == nullptr || !bleSelectedDeviceConnectable() ||
        productSurveyControl() == ProductSurveyWorkerControl::Idle ||
        !activateBleGattWorkspace(*device)) {
        lastRuntimeEvent = "ble_gatt_target_unavailable";
        return false;
    }
    bleGattWaitingForSurveyStop = false;
    bleGattReturnAfterCleanup = false;
    bleGattConfirmationToken = 0U;
    bleGattFactSelection = 0U;
    bleProductView = BleProductView::InspectorGatt;
    lastRuntimeEvent = "ble_gatt_permission_review";
    return true;
}

