anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
bool finishBleGattToHome() {
    if (!bleGattTransport.cleanupComplete()) return false;
    if (appRuntime.running()) appRuntime.stop();
    if (!releaseBleGattWorkspace()) return false;
    bleProductView = BleProductView::None;
    surveyPipeline.resetToSetup();
    const bool moved = uiController.apply(
        UiAction::Back, static_cast<std::uint8_t>(appCatalog.size()),
        false, 2);
    const bool memoryRestored = restoreBleProductSurveyMemory();
    lastRuntimeEvent = moved && memoryRestored
        ? "ble_gatt_home"
        : (moved ? "ble_memory_restore_failed" : "ble_gatt_home_failed");
    return moved && memoryRestored;
}

bool beginBleGattAfterSurvey() {
    if (!bleGattWaitingForSurveyStop || bleGattInspector == nullptr ||
        productSurveyControl() != ProductSurveyWorkerControl::Idle ||
        !productSurveyRuntime.scannerCleanupComplete ||
        !productSurveyRuntime.cleanupComplete ||
        productSurveyRuntime.sourceActive ||
        resourceBroker.ownerOf(Resource::EspRf) !=
            AppRuntime::kForegroundOwner) {
        return false;
    }
    const auto radio =
        leshy1::kernel::runtime::resourceMask(Resource::EspRf);
    resourceBroker.release(AppRuntime::kForegroundOwner, radio);
    if (resourceBroker.ownerOf(Resource::EspRf) !=
        leshy1::kernel::runtime::kNoOwner) {
        return false;
    }
    bleGattWaitingForSurveyStop = false;
    std::uint64_t nowUs = static_cast<std::uint64_t>(esp_timer_get_time());
    if (nowUs == 0U) nowUs = 1U;
    if (bleGattReturnAfterCleanup) {
        const bool closed = bleGattTransport.back(nowUs);
        return closed && finishBleGattToHome();
    }
    const bool injectResourceConflict = bleGattTransport.consumeHilFault(
        BoardBleGattHilFault::ResourceConflict);
    const bool conflictLeaseHeld = injectResourceConflict &&
        resourceBroker.acquire(kBleGattHilConflictOwner, radio);
    const bool started = bleGattTransport.confirm(
        bleGattConfirmationToken, nowUs);
    if (injectResourceConflict) {
        resourceBroker.releaseAll(kBleGattHilConflictOwner);
    }
    lastRuntimeEvent = started ? "ble_gatt_connecting"
        : (injectResourceConflict && conflictLeaseHeld
            ? "ble_gatt_resource_conflict_injected"
            : "ble_gatt_connect_start_failed");
    return started;
}

void serviceBleGattProduct() {
    if (bleProductView != BleProductView::InspectorGatt ||
        bleGattInspector == nullptr || bleGattWaitingForSurveyStop) {
        return;
    }
    std::uint64_t nowUs = static_cast<std::uint64_t>(esp_timer_get_time());
    if (nowUs == 0U) nowUs = 1U;
    bool changed = bleGattTransport.service(nowUs);
    const BleGattInspectorState after = bleGattTransport.state();
    const std::size_t servicesAfter = bleGattTransport.serviceCount();
    const std::size_t characteristicsAfter =
        bleGattTransport.characteristicCount();
    // GAP/GATT callbacks can complete between loop iterations. Compare the
    // transport snapshot with the last pixels actually presented, rather than
    // two samples taken after the callback, so an asynchronous state change
    // can never remain invisible.
    changed = changed || after != bleGattRenderedState ||
        servicesAfter != bleGattRenderedServices ||
        characteristicsAfter != bleGattRenderedCharacteristics ||
        bleGattFactSelection != bleGattRenderedSelection;
    const std::size_t totalFacts = servicesAfter + characteristicsAfter;
    if (totalFacts == 0U) {
        bleGattFactSelection = 0U;
    } else if (bleGattFactSelection >= totalFacts) {
        bleGattFactSelection = totalFacts - 1U;
    }
    if (bleGattReturnAfterCleanup &&
        after == BleGattInspectorState::Complete &&
        bleGattTransport.cleanupComplete()) {
        if (finishBleGattToHome()) {
            renderInteractiveScreen(true);
            return;
        }
    }
    if (bleGattReturnAfterCleanup &&
        after == BleGattInspectorState::Failed &&
        bleGattTransport.cleanupComplete()) {
        // A failed disconnect must remain visible. Releasing the lease is
        // necessary, but silently returning Home would hide the failure the
        // user (and release HIL) needs to diagnose. A second Back performs the
        // ordinary clean return after the failure card has been observable.
        bleGattReturnAfterCleanup = false;
        lastRuntimeEvent = "ble_gatt_cleanup_failed_visible";
        changed = true;
    }
    if (changed && bleProductView == BleProductView::InspectorGatt) {
        renderInteractiveScreen(false);
    }
}

void quiesceBleGattOnSafetyStop() {
    if (bleProductView != BleProductView::InspectorGatt ||
        bleGattInspector == nullptr) {
        return;
    }
    bleGattReturnAfterCleanup = true;
    if (bleGattWaitingForSurveyStop) {
        const ProductSurveyWorkerControl control = productSurveyControl();
        if (control == ProductSurveyWorkerControl::Starting ||
            control == ProductSurveyWorkerControl::Running) {
            (void)requestProductSurveyWorkerStop(true);
        }
        // Consume the same cancellation event as the ordinary Back path. It
        // proves worker, scanner, source and deadline quiescence before the
        // foreground lease is handed off or released.
        serviceProductSurveyWorker();
        if (bleProductView != BleProductView::InspectorGatt ||
            !bleGattWaitingForSurveyStop) {
            return;
        }
        lastRuntimeEvent = "ble_gatt_safety_survey_cleanup_pending";
        return;
    }

    std::uint64_t nowUs = static_cast<std::uint64_t>(esp_timer_get_time());
    if (nowUs == 0U) nowUs = 1U;
    const BleGattInspectorState state = bleGattTransport.state();
    if (state == BleGattInspectorState::PermissionReview ||
        state == BleGattInspectorState::AwaitingConfirmation ||
        state == BleGattInspectorState::Connecting ||
        state == BleGattInspectorState::Discovering ||
        state == BleGattInspectorState::Ready) {
        (void)bleGattTransport.back(nowUs);
    }
    (void)bleGattTransport.service(nowUs);
    const BleGattInspectorState after = bleGattTransport.state();
    if ((after == BleGattInspectorState::Complete ||
         after == BleGattInspectorState::Failed) &&
        bleGattTransport.cleanupComplete()) {
        const bool finished = finishBleGattToHome();
        lastRuntimeEvent = finished ? "ble_gatt_safety_stop"
                                    : "ble_gatt_safety_release_failed";
    } else {
        lastRuntimeEvent = "ble_gatt_safety_cleanup_pending";
    }
}

bool startWifiDevicesProduct() {
    wifiFrameCapture.reset();
    wifiDeviceCatalog.reset();
    wifiDeviceNavigationOrder.reset();
    wifiDeviceSelection = 0;
    wifiDeviceDetail = {};
    std::uint64_t startedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (startedUs == 0U) startedUs = 1U;
    const bool started = wifiFrameCapture.beginDeviceMonitor(startedUs);
    wifiProductView = WifiProductView::Devices;
    nextWifiDeviceUiRefreshUs = startedUs + 250000ULL;
    lastRuntimeEvent = started ? "wifi_devices_listening"
                               : "wifi_devices_start_failed";
    return true;
}

bool stopWifiDevicesProduct() {
    std::uint64_t endedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (endedUs == 0U) endedUs = 1U;
    const bool cleanup = wifiFrameCapture.stop(endedUs);
    wifiProductView = WifiProductView::Menu;
    wifiProductSelection = 1;
    nextWifiDeviceUiRefreshUs = 0;
    lastRuntimeEvent = cleanup ? "wifi_menu" : "wifi_devices_cleanup_failed";
    return true;
}

void serviceWifiDevicesProduct() {
    const auto before = wifiFrameCapture.deviceMonitorStats();
    if (!before.active) return;
    std::uint64_t nowUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (nowUs == 0U) nowUs = 1U;
    wifiFrameCapture.service(nowUs);
    bool changed = false;
    const WifiDeviceRecord* selected = wifiDeviceAt(wifiDeviceSelection);
    const std::array<std::uint8_t, 6> selectionAnchor = selected == nullptr
        ? std::array<std::uint8_t, 6>{} : selected->address;
    const bool selectionAnchored = selected != nullptr;
    WifiDeviceObservation observation{};
    while (wifiFrameCapture.pollDevice(&observation)) {
        const std::size_t existingIndex =
            wifiDeviceCatalog.indexOfAddress(observation.address);
        if (wifiDeviceNavigationOrder.locked() &&
            existingIndex >= wifiDeviceCatalog.size()) {
            observation = {};
            continue;
        }
        if (!observation.locallyAdministered &&
            observation.wpsManufacturerLength == 0U) {
            const WifiDeviceRecord* existing =
                wifiDeviceCatalog.at(existingIndex);
            const bool needsVendor = existing == nullptr ||
                (existing->wpsManufacturerLength == 0U &&
                 existing->ouiVendorLength == 0U);
            if (needsVendor) {
                char vendor[WifiDeviceObservation::kWpsTextCapacity] = {};
                if (wifiOuiDatabase.lookup(observation.address.data(), vendor,
                                           sizeof(vendor))) {
                    std::snprintf(observation.ouiVendor.data(),
                                  observation.ouiVendor.size(), "%s", vendor);
                    observation.ouiVendorLength = static_cast<std::uint8_t>(
                        std::strlen(observation.ouiVendor.data()));
                }
            }
        }
        changed = wifiDeviceCatalog.upsert(observation) || changed;
        observation = {};
    }
    if (changed && selectionAnchored &&
        !wifiDeviceNavigationOrder.locked()) {
        const std::size_t anchored =
            wifiDeviceCatalog.indexOfAddress(selectionAnchor);
        wifiDeviceSelection = anchored < wifiDeviceCatalog.size()
            ? anchored : wifiDeviceCatalog.size() - 1U;
    }
    if (changed &&
        wifiProductView == WifiProductView::DeviceDetail) {
        const std::size_t detailIndex =
            wifiDeviceCatalog.indexOfAddress(wifiDeviceDetail.address);
        const WifiDeviceRecord* current = wifiDeviceCatalog.at(detailIndex);
        if (current != nullptr) wifiDeviceDetail = *current;
    }
    const auto after = wifiFrameCapture.deviceMonitorStats();
    const bool terminal = before.active && !after.active;
    if (terminal) lastRuntimeEvent = "wifi_devices_failed";
    // At most four data-only refreshes per second. Device identity remains
    // stable while the integrated selected-channel radar updates in place.
    if ((changed || terminal) && uiController.page() == 2 &&
        (wifiProductView == WifiProductView::Devices ||
         wifiProductView == WifiProductView::DeviceDetail) &&
        (terminal || nowUs >= nextWifiDeviceUiRefreshUs)) {
        nextWifiDeviceUiRefreshUs = nowUs + 250000ULL;
        renderInteractiveScreen(false);
    }
}

bool startWifiChannelsProduct() {
    wifiFrameCapture.reset();
    wifiChannelRenderedLoads.fill(0xffffU);
    wifiChannelRenderedAverages.fill(0xffffU);
    wifiChannelRenderedBest = 0xffU;
    std::uint64_t startedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (startedUs == 0U) startedUs = 1U;
    const bool started = wifiFrameCapture.beginChannelMonitor(startedUs);
    wifiProductView = WifiProductView::Channels;
    lastRuntimeEvent = started ? "wifi_channels_measuring"
                               : "wifi_channels_start_failed";
    return true;
}

bool openWifiVisitProduct() {
    if (surveyWorkflow.state() != SurveyWorkflowState::Setup) {
        surveyPipeline.resetToSetup();
    }
    const bool cleanup = closeProductSurveyBackend();
    if (!cleanup) {
        lastRuntimeEvent = "wifi_visit_cleanup_failed";
        return false;
    }
    productSurveyRuntime = {};
    productSurveyRuntime.selected = true;
    productSurveyRuntime.workerReady = productSurveyWorkerReady;
    productSurveyRuntime.cleanupComplete = true;
    // Only an exact retained Field Survey is eligible as an automatic
    // baseline. A generic Wi-Fi/BLE scan must never silently become a visit
    // comparison merely because it happens to be the newest library entry.
    captureFieldSurveyPrevious(librarySession);
    // A retained visit is a device-level observation source, not merely a
    // Wi-Fi list refresh. Listen with every available built-in receiver by
    // default so consecutive visits can support cross-radio Target review.
    surveySourceController.rebuild(inventory, false,
                                   SurveySourceScope::All);
    const SurveyWorkflowStatus configured =
        surveyWorkflow.configure(true, false);
    if (configured != SurveyWorkflowStatus::Ready) {
        productSurveyRuntime.status = "workflow_config_failed";
        lastRuntimeEvent = productSurveyRuntime.status;
        return false;
    }
    wifiProductView = WifiProductView::Visit;
    lastRuntimeEvent = "wifi_visit_setup";
    return true;
}

