anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
bool openAirspaceGuardProduct() {
    wifiFrameCapture.reset();
    airspaceGuardController.reset();
    wifiProductView = WifiProductView::AirspaceGuard;
    ++airspaceGuardGeneration;
    if (airspaceGuardGeneration == 0U) ++airspaceGuardGeneration;
    resetAirspaceGuardWifiReport();
    airspaceGuardBleStartedUs = 0U;
    if (!productSurveyWorkerReady ||
        productSurveyWorkerTaskHandle == nullptr ||
        productSurveyControl() != ProductSurveyWorkerControl::Idle ||
        airspaceGuardBleControl() != AirspaceGuardBleWorkerControl::Idle ||
        airspaceGuardBleWorkerEvents == nullptr ||
        airspaceGuardSurveyQueueRestorePending) {
        airspaceGuardController.load(airspaceGuardWifiReport);
        airspaceGuardCaptureState = AirspaceGuardCaptureState::Failed;
        lastRuntimeEvent = "airspace_guard_worker_unavailable";
        return true;
    }
    xQueueReset(airspaceGuardBleWorkerEvents);
    if (!releaseProductSurveyQueuesForAirspaceGuard()) {
        airspaceGuardController.load(airspaceGuardWifiReport);
        airspaceGuardCaptureState = AirspaceGuardCaptureState::Failed;
        lastRuntimeEvent = "airspace_guard_memory_unavailable";
        return true;
    }
    std::uint64_t startedUs = static_cast<std::uint64_t>(esp_timer_get_time());
    if (startedUs == 0U) startedUs = 1U;
    const bool started = wifiFrameCapture.beginAirspaceGuardMonitor(
        startedUs, kAirspaceGuardCaptureDurationMs,
        kAirspaceGuardChannelDwellMs);
    nextAirspaceGuardUiRefreshUs = startedUs + 250000ULL;
    airspaceGuardResultNeedsContentClear = false;
    if (started) {
        airspaceGuardCaptureState =
            AirspaceGuardCaptureState::WifiRunning;
        lastRuntimeEvent = "airspace_guard_listening";
        return true;
    }
    const bool queuesRestored =
        restoreProductSurveyQueuesAfterAirspaceGuard();
    airspaceGuardController.load(airspaceGuardWifiReport);
    airspaceGuardCaptureState = AirspaceGuardCaptureState::Failed;
    lastRuntimeEvent = queuesRestored
        ? "airspace_guard_start_failed"
        : "airspace_guard_queue_restore_failed";
    return true;
}

bool stopAirspaceGuardProduct() {
    std::uint64_t endedUs = static_cast<std::uint64_t>(esp_timer_get_time());
    if (endedUs == 0U) endedUs = 1U;
    bool cleanup = true;
    bool deferQueueRestore = false;
    if (airspaceGuardCaptureState ==
        AirspaceGuardCaptureState::WifiRunning) {
        cleanup = wifiFrameCapture.stop(endedUs);
    } else if (airspaceGuardCaptureState ==
               AirspaceGuardCaptureState::BleRunning) {
        const bool cancelRequested = requestAirspaceGuardBleWorkerCancel();
        const bool workerIdle = airspaceGuardBleControl() ==
            AirspaceGuardBleWorkerControl::Idle;
        cleanup = cancelRequested || workerIdle;
        deferQueueRestore = cancelRequested && !workerIdle;
        airspaceGuardSurveyQueueRestorePending = deferQueueRestore;
    }
    ++airspaceGuardGeneration;
    if (airspaceGuardGeneration == 0U) ++airspaceGuardGeneration;
    wifiFrameCapture.reset();
    const bool queuesRestored = deferQueueRestore
        ? true : restoreProductSurveyQueuesAfterAirspaceGuard();
    cleanup = cleanup && queuesRestored;
    airspaceGuardController.reset();
    airspaceGuardCaptureState = AirspaceGuardCaptureState::Idle;
    nextAirspaceGuardUiRefreshUs = 0;
    airspaceGuardBleStartedUs = 0;
    resetAirspaceGuardWifiReport();
    airspaceGuardResultNeedsContentClear = false;
    wifiProductView = WifiProductView::Menu;
    wifiProductSelection = 4;
    lastRuntimeEvent = cleanup ? "wifi_menu"
                               : "airspace_guard_cleanup_failed";
    return true;
}

__attribute__((noinline)) bool finalizeAirspaceGuardWifiEvidence(
    const BoardWifiPassiveCapture::AirspaceGuardMonitorStats& monitor,
    bool complete) {
    // Write directly into static report storage. A value-returning detector
    // call would materialize a ~4.6-KiB ABI temporary in this loop-stack frame.
    resetAirspaceGuardWifiReport();
    if (complete) {
        const std::size_t dropped =
            static_cast<std::size_t>(monitor.disconnectFramesDropped) +
            static_cast<std::size_t>(monitor.identityProfilesDropped) +
            static_cast<std::size_t>(monitor.invalidFrames);
        AirspaceGuardPolicy policy{};
        policy.ssidSecurityConflictEnabled =
            monitor.identityRetentionComplete;
        policy.ssidChurnEnabled = monitor.identityRetentionComplete;
        policy.elevatedNoiseEnabled = monitor.noiseRetentionComplete;
        const leshy1::services::guard::CompositeWifiFrameSource source(
            wifiFrameCapture.capture(),
            wifiFrameCapture.airspaceGuardIdentitySource());
        complete = airspaceGuardDetector.writeWifiReport(
            source, policy, dropped,
            static_cast<std::size_t>(monitor.framesReported),
            monitor.noiseSamples.data(),
            static_cast<std::size_t>(monitor.noiseSamplesRetained),
            static_cast<std::size_t>(monitor.noiseSamplesDropped),
            static_cast<std::size_t>(monitor.noiseSamplesObserved),
            &airspaceGuardWifiReport);
    } else {
        airspaceGuardWifiReport.status =
            AirspaceGuardStatus::Inconclusive;
    }
    const auto& report = airspaceGuardWifiReport;
    return complete &&
        (report.status == AirspaceGuardStatus::Clear ||
         report.status == AirspaceGuardStatus::Finding) &&
        report.sourceReadFailures == 0U &&
        report.sourceFramesDropped == 0U &&
        report.malformedFrames == 0U &&
        report.wifiNoiseSamplesDropped == 0U &&
        report.wifiNoiseSamplesMalformed == 0U &&
        !report.inspectionTruncated && report.findingsDropped == 0U;
}

void serviceAirspaceGuardProduct() {
    if (airspaceGuardSurveyQueueRestorePending &&
        airspaceGuardBleControl() ==
            AirspaceGuardBleWorkerControl::Idle) {
        if (!restoreProductSurveyQueuesAfterAirspaceGuard()) {
            lastRuntimeEvent = "airspace_guard_queue_restore_retry";
        }
    }
    const bool captureRoute = uiController.page() == 2 &&
        wifiProductView == WifiProductView::AirspaceGuard;
    if (airspaceGuardCaptureState ==
        AirspaceGuardCaptureState::BleRunning) {
        std::uint32_t completedGeneration = 0U;
        auto& event = airspaceGuardBleEventWorkspace;
        if (airspaceGuardBleWorkerEvents != nullptr &&
            xQueueReceive(airspaceGuardBleWorkerEvents,
                          &completedGeneration, 0) ==
                pdTRUE &&
            completedGeneration == event.generation &&
            event.generation == airspaceGuardGeneration) {
            const bool mergedComplete = event.valid &&
                event.cleanupComplete &&
                leshy1::services::guard::mergeAirspaceGuardReports(
                    airspaceGuardWifiReport, event.report,
                    &airspaceGuardWifiReport);
            if (!mergedComplete) {
                resetAirspaceGuardWifiReport();
            }
            const bool loaded =
                airspaceGuardController.load(airspaceGuardWifiReport) ==
                leshy1::apps::guard::AirspaceGuardLoadStatus::Ready;
            airspaceGuardCaptureState = loaded && mergedComplete
                ? AirspaceGuardCaptureState::Result
                : AirspaceGuardCaptureState::Failed;
            nextAirspaceGuardUiRefreshUs = 0;
            airspaceGuardBleStartedUs = 0;
            airspaceGuardResultNeedsContentClear = true;
            lastRuntimeEvent = loaded && mergedComplete
                ? "airspace_guard_report_ready"
                : "airspace_guard_ble_failed";
            if (captureRoute) renderInteractiveScreen(false);
            return;
        }
        std::uint64_t nowUs =
            static_cast<std::uint64_t>(esp_timer_get_time());
        if (nowUs == 0U) nowUs = 1U;
        if (captureRoute && nowUs >= nextAirspaceGuardUiRefreshUs) {
            nextAirspaceGuardUiRefreshUs = nowUs + 250000ULL;
            display.startWrite();
            renderAirspaceGuardPage(false, true);
            display.endWrite();
        }
        return;
    }
    if (airspaceGuardCaptureState !=
        AirspaceGuardCaptureState::WifiRunning) {
        return;
    }
    const auto before = wifiFrameCapture.stats();
    if (before.state != WifiFrameCaptureState::Running) return;
    std::uint64_t nowUs = static_cast<std::uint64_t>(esp_timer_get_time());
    if (nowUs == 0U) nowUs = 1U;
    wifiFrameCapture.service(nowUs);
    const auto after = wifiFrameCapture.stats();
    const bool terminal = after.state != WifiFrameCaptureState::Running;
    if (terminal) {
        const auto monitor = wifiFrameCapture.airspaceGuardMonitorStats();
        const bool complete = after.state == WifiFrameCaptureState::Complete &&
            monitor.cleanupComplete && wifiFrameCapture.cleanupComplete();
        const bool wifiEvidenceComplete =
            finalizeAirspaceGuardWifiEvidence(monitor, complete);
        // The complete Wi-Fi report already occupies the retained merge input.
        // No evidence-rich loop-stack copy is needed here.
        // A structurally malformed over-the-air advertisement makes the Wi-Fi
        // conclusion honestly inconclusive, but it is not a local receiver or
        // cleanup failure. Continue the independent BLE observation so the
        // user gets the maximum safe read-only evidence from one bounded run.
        const bool bleRequested = complete &&
            requestAirspaceGuardBleWorker(airspaceGuardGeneration);
        if (bleRequested) {
            airspaceGuardCaptureState =
                AirspaceGuardCaptureState::BleRunning;
            airspaceGuardBleStartedUs = nowUs;
            nextAirspaceGuardUiRefreshUs = nowUs + 250000ULL;
            airspaceGuardResultNeedsContentClear = true;
            lastRuntimeEvent = wifiEvidenceComplete
                ? "airspace_guard_ble_listening"
                : "airspace_guard_ble_listening_after_incomplete_wifi";
        } else {
            airspaceGuardWifiReport.status =
                AirspaceGuardStatus::Inconclusive;
            airspaceGuardController.load(airspaceGuardWifiReport);
            airspaceGuardCaptureState = AirspaceGuardCaptureState::Failed;
            nextAirspaceGuardUiRefreshUs = 0;
            airspaceGuardResultNeedsContentClear = true;
            lastRuntimeEvent = "airspace_guard_capture_failed";
        }
        if (captureRoute) renderInteractiveScreen(false);
        return;
    }
    if (captureRoute && nowUs >= nextAirspaceGuardUiRefreshUs) {
        nextAirspaceGuardUiRefreshUs = nowUs + 250000ULL;
        display.startWrite();
        renderAirspaceGuardPage(false, true);
        display.endWrite();
    }
}

