anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void quiesceAirspaceGuardOnSafetyStop() {
    const bool wifiRunning = airspaceGuardCaptureState ==
        AirspaceGuardCaptureState::WifiRunning;
    const bool bleRunning = airspaceGuardCaptureState ==
        AirspaceGuardCaptureState::BleRunning;
    if (!wifiRunning && !bleRunning &&
        !airspaceGuardSurveyQueuesReleased) {
        return;
    }
    std::uint64_t endedUs = static_cast<std::uint64_t>(esp_timer_get_time());
    if (endedUs == 0U) endedUs = 1U;
    bool cleanup = true;
    bool deferQueueRestore = false;
    if (wifiRunning) {
        cleanup = wifiFrameCapture.stop(endedUs);
    } else if (bleRunning) {
        const bool cancelRequested = requestAirspaceGuardBleWorkerCancel();
        const bool workerIdle = airspaceGuardBleControl() ==
            AirspaceGuardBleWorkerControl::Idle;
        cleanup = cancelRequested || workerIdle;
        deferQueueRestore = cancelRequested && !workerIdle;
        airspaceGuardSurveyQueueRestorePending = deferQueueRestore;
    }
    const bool queuesRestored = deferQueueRestore
        ? true : restoreProductSurveyQueuesAfterAirspaceGuard();
    ++airspaceGuardGeneration;
    if (airspaceGuardGeneration == 0U) ++airspaceGuardGeneration;
    resetAirspaceGuardWifiReport();
    airspaceGuardController.load(airspaceGuardWifiReport);
    airspaceGuardCaptureState = AirspaceGuardCaptureState::Failed;
    nextAirspaceGuardUiRefreshUs = 0;
    airspaceGuardBleStartedUs = 0;
    airspaceGuardResultNeedsContentClear = true;
    lastRuntimeEvent = cleanup && queuesRestored
        ? "airspace_guard_safety_stop"
        : "airspace_guard_safety_cleanup_failed";
}

void quiesceWifiAuthenticationOnSafetyStop() {
    const bool waitingForSurvey = wifiAuthenticationProductState ==
        WifiAuthenticationProductState::WaitingForSurveyStop;
    const bool running = wifiAuthenticationProductState ==
        WifiAuthenticationProductState::Running;
    const auto initialIngress =
        wifiFrameCapture.authenticationCaptureStats();
    const bool boardDirty = !wifiFrameCapture.cleanupComplete() ||
        !initialIngress.cleanupComplete || initialIngress.active;
    const WorkerDeadlineSnapshot initialWorker = workerDeadlineSnapshot();
    const bool surveyDirty =
        productSurveyControl() != ProductSurveyWorkerControl::Idle ||
        !productSurveyRuntime.identityCleanupComplete ||
        !productSurveyRuntime.scannerCleanupComplete ||
        !productSurveyRuntime.cleanupComplete ||
        productSurveyRuntime.sourceActive || productSurveyScanActive() ||
        initialWorker.armed;
    const bool failedCleanup = wifiAuthenticationProductState ==
            WifiAuthenticationProductState::Failed &&
        (boardDirty || surveyDirty);
    if (!waitingForSurvey && !running && !failedCleanup) return;

    bool surveyCleanup = true;
    if (waitingForSurvey || surveyDirty) {
        const ProductSurveyWorkerControl control = productSurveyControl();
        if (control == ProductSurveyWorkerControl::Starting ||
            control == ProductSurveyWorkerControl::Running) {
            requestProductSurveyWorkerStop(true);
        }
        // Reuse the ordinary terminal consumer, but force its Back branch so
        // a cancelled survey can never start authentication after the latch.
        wifiAuthenticationReturnAfterSurveyStop = true;
        wifiAuthenticationSafetyCleanupActive = true;
        serviceProductSurveyWorker();
        wifiAuthenticationSafetyCleanupActive = false;
        const WorkerDeadlineSnapshot worker = workerDeadlineSnapshot();
        const bool terminalOrAlreadyReleased =
            productSurveyTimeline.state() ==
                SourceTimelineState::Cancelled ||
            productSurveyControl() == ProductSurveyWorkerControl::Idle;
        const leshy1::platform::arduino::
            WifiAuthenticationSurveyTeardownState surveyTeardown{
                terminalOrAlreadyReleased,
                productSurveyRuntime.timelineHealthy,
                productSurveyRuntime.identityCleanupComplete,
                productSurveyRuntime.scannerCleanupComplete,
                productSurveyRuntime.sourceActive,
                productSurveyScanActive(),
                worker.armed,
            };
        const bool backendClosePermitted =
            leshy1::platform::arduino::
                wifiAuthenticationSurveyBackendClosePermitted(
                    surveyTeardown);
        const bool backendCleanup = backendClosePermitted &&
            closeProductSurveyBackend();
        surveyCleanup = backendClosePermitted && backendCleanup &&
            productSurveyRuntime.cleanupComplete;
        if (surveyCleanup) {
            setProductSurveyControl(ProductSurveyWorkerControl::Idle);
            surveyPipeline.resetToSetup();
            productSurveyTimeline.reset();
        }
    }

    const auto ingress = wifiFrameCapture.authenticationCaptureStats();
    bool cleanup = surveyCleanup && wifiFrameCapture.cleanupComplete() &&
        ingress.cleanupComplete && !ingress.active;
    if (!cleanup) {
        std::uint64_t endedUs =
            static_cast<std::uint64_t>(esp_timer_get_time());
        if (endedUs == 0U) endedUs = 1U;
        const bool captureCleanup = wifiFrameCapture.stop(endedUs) &&
            wifiFrameCapture.cleanupComplete();
        cleanup = surveyCleanup && captureCleanup;
    }

    // Release the foreground RF lease only after the receiver has proven
    // exact quiescence. If a worker-deadline path already stopped the app this
    // remains idempotent; any inconsistent retained lease keeps the product in
    // ResultBeforeCleanup for a later bounded retry.
    if (cleanup && appRuntime.running()) appRuntime.stop();
    const bool runtimeReleased = cleanup && !appRuntime.running() &&
        appRuntime.activeResources() == 0U;

    wifiAuthenticationProductState = WifiAuthenticationProductState::Failed;
    wifiAuthenticationFailure = runtimeReleased
        ? WifiAuthenticationCaptureUiFailure::RuntimeFailed
        : WifiAuthenticationCaptureUiFailure::ResultBeforeCleanup;
    nextWifiAuthenticationUiRefreshUs = 0U;
    lastRuntimeEvent = runtimeReleased
        ? "authentication_safety_stop"
        : "authentication_safety_cleanup_failed";
}

bool stopWifiChannelsProduct() {
    std::uint64_t endedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (endedUs == 0U) endedUs = 1U;
    const bool cleanup = wifiFrameCapture.stop(endedUs);
    wifiProductView = WifiProductView::Menu;
    wifiProductSelection = 2;
    lastRuntimeEvent = cleanup ? "wifi_menu" : "wifi_channels_cleanup_failed";
    return true;
}

void serviceWifiChannelsProduct() {
    const auto beforeStats = wifiFrameCapture.channelMonitorStats();
    if (!beforeStats.active) return;
    const auto before = wifiFrameCapture.channelLoadSnapshot();
    std::uint64_t nowUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (nowUs == 0U) nowUs = 1U;
    wifiFrameCapture.service(nowUs);
    const auto afterStats = wifiFrameCapture.channelMonitorStats();
    const auto after = wifiFrameCapture.channelLoadSnapshot();
    const bool terminal = beforeStats.active && !afterStats.active;
    if (terminal) lastRuntimeEvent = "wifi_channels_failed";
    if ((terminal || after.revision != before.revision) &&
        uiController.page() == 2 &&
        wifiProductView == WifiProductView::Channels) {
        renderInteractiveScreen(false);
    }
}

