anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
bool selectionCanRepaintInPlace(UiAction action) {
    if (uiController.page() == 5 &&
        (action == UiAction::Up || action == UiAction::Down ||
         action == UiAction::Select || action == UiAction::Right)) {
        return true;
    }
    if (uiController.page() == 2 &&
        wifiProductView == WifiProductView::AuthenticationCapture) {
        return true;
    }
    if (uiController.page() == 2 &&
        bleProductView == BleProductView::InspectorGatt) {
        return true;
    }
    if (uiController.page() == 2 &&
        bleProductView == BleProductView::InspectorRaw &&
        (action == UiAction::Select || action == UiAction::Right)) {
        return true;
    }
    if (uiController.page() == kDeviceLockPage) {
        const DeviceLockView view = deviceLockController.view();
        return (view == DeviceLockView::EnterPin ||
                view == DeviceLockView::ConfirmPin) &&
            (action == UiAction::Up || action == UiAction::Down ||
             action == UiAction::Select || action == UiAction::Right);
    }
    if (uiController.page() == kSerialConsolePage) {
        return action == UiAction::Up || action == UiAction::Down ||
            action == UiAction::Select || action == UiAction::Right;
    }
    if (action != UiAction::Up && action != UiAction::Down) return false;
    if (uiController.isRoot()) return true;
    if (uiController.page() == 8U) return true;
    if (uiController.page() == 2) {
        if (bleProductView == BleProductView::InspectorMenu) return true;
        if (bleProductView == BleProductView::Devices) return true;
        if (wifiProductView == WifiProductView::Menu) return true;
        if (wifiProductView == WifiProductView::AirspaceGuard &&
            airspaceGuardController.view() ==
                AirspaceGuardView::EvidenceList) return true;
        if (wifiProductView == WifiProductView::Networks &&
            surveyWorkflow.state() == SurveyWorkflowState::Running) {
            return true;
        }
        if (wifiProductView == WifiProductView::Devices) return true;
        if (rfSpectrumView == RfSpectrumView::Live) return false;
        if (rfSpectrumView == RfSpectrumView::SourceMenu ||
            rfSpectrumView == RfSpectrumView::Nrf24Menu ||
            rfSpectrumView == RfSpectrumView::SubGhzMenu ||
            rfSpectrumView == RfSpectrumView::SubGhzCaptureModeMenu ||
            rfSpectrumView == RfSpectrumView::CcBandMenu ||
            rfSpectrumView == RfSpectrumView::SubGhzCaptureBandMenu) return true;
        return surveyWorkflow.state() == SurveyWorkflowState::Setup ||
               (surveyWorkflow.state() == SurveyWorkflowState::Running &&
                (surveyController.view() == SurveyView::List ||
                 surveyController.view() == SurveyView::Filter));
    }
    if (uiController.page() == 3) {
        return libraryController.view() == LibraryView::SessionList;
    }
    if (uiController.page() == 7) {
        return targetsProductRuntime != nullptr &&
            (targetsProductRuntime->controller.view() == TargetsView::List ||
             targetsProductRuntime->controller.view() == TargetsView::Compare);
    }
    if (uiController.page() == 4) {
        return captureView == CaptureView::SourceMenu;
    }
    if (uiController.page() == kDevicePage) return true;
    return uiController.page() == 6 &&
           selfTestController.view() == SelfTestView::ModeMenu;
}

bool openCurrentFieldSurveyExport() {
    if (!deviceLockOperationAllowed(
            leshy1::services::security::DeviceLockOperation::Export)) {
        noteDeviceLockAdmissionBlocked();
        return false;
    }
    const LibraryEntry* entry = libraryController.selected();
    if (entry == nullptr || entry->session == nullptr ||
        std::strcmp(entry->session->id(), FieldSurveyTracker::kSessionId) != 0 ||
        entry->session->state() != SessionState::Stopped) {
        return false;
    }
    if (libraryController.view() == LibraryView::ExportReady &&
        !libraryController.back()) {
        return false;
    }
    if (libraryController.view() == LibraryView::SessionDetail &&
        !libraryController.back()) {
        return false;
    }
    if (libraryController.view() != LibraryView::SessionList ||
        !libraryController.openSelected() ||
        !libraryController.requestExport()) {
        return false;
    }
    if (uiController.openChild(3U)) return true;
    (void)libraryController.back();
    (void)libraryController.back();
    return false;
}

bool applyUiAction(UiAction action, bool render = true) {
    const bool incrementalCandidate = selectionCanRepaintInPlace(action);
    lastUiActionUsedIncrementalRender = false;
    const auto finish = [&](bool changed) {
        lastUiActionUsedIncrementalRender = changed && incrementalCandidate;
        if (changed && render) {
            renderInteractiveScreen(!lastUiActionUsedIncrementalRender);
        }
        return changed;
    };
    if (safetySupervisor.latched()) {
        bool changed = false;
        if (action == UiAction::Select || action == UiAction::Right) {
            if (safetySupervisor.clearPending()) {
                clearSafetyStopAndRestart();
            }
            changed = safetySupervisor.requestClear();
        } else if ((action == UiAction::Back || action == UiAction::Left) &&
                   safetySupervisor.clearPending()) {
            changed = safetySupervisor.cancelClear();
        }
        if (action != UiAction::Unknown) {
            uiController.recordHandledAction(action);
        }
        return finish(changed);
    }
    if (deviceLockWorkerTaskHandle == nullptr &&
        deviceLock.state() ==
            leshy1::services::security::DeviceLockState::Unlocked &&
        action != UiAction::Unknown) {
        const std::uint64_t nowUs =
            static_cast<std::uint64_t>(esp_timer_get_time());
        if (!deviceLock.recordActivity(nowUs) &&
            uiController.page() == kDeviceLockPage) {
            deviceLockController.enter(deviceLock.audit(nowUs));
        }
    }
    const AppMenuItem* selected = appCatalog.get(uiController.selection());
    const bool wasRoot = uiController.isRoot();
    const std::uint8_t pageBefore = uiController.page();
    if (!wasRoot && deviceLockProtectedPage(pageBefore) &&
        !deviceLockOperationAllowed(
            leshy1::services::security::DeviceLockOperation::ProtectedUi) &&
        action != UiAction::Back && action != UiAction::Left) {
        noteDeviceLockAdmissionBlocked();
        uiController.recordHandledAction(action);
        return finish(false);
    }
    if (!wasRoot && uiController.page() == 8U &&
        action != UiAction::Back && action != UiAction::Left) {
        bool changed = false;
        if (action == UiAction::Up) {
            changed = automationPackageCatalog.previous();
        } else if (action == UiAction::Down) {
            changed = automationPackageCatalog.next();
        } else if ((action == UiAction::Select || action == UiAction::Right) &&
                   !automationCatalogRefreshPending &&
                   automationPackageCatalog.selected() != nullptr) {
            automationInspectorController.clear();
            automationInspectionPending = true;
            changed = uiController.openChild(kAutomationInspectorPage);
            if (!changed) automationInspectionPending = false;
            lastRuntimeEvent = changed ? "automation_inspector_loading"
                                       : "automation_inspector_open_failed";
        }
        uiController.recordHandledAction(action);
        return finish(changed);
    }
    if (!wasRoot && uiController.page() == 2) {
        bool handled = false;
        bool changed = false;
        if (bleProductView == BleProductView::InspectorGatt) {
            handled = true;
            std::uint64_t nowUs = static_cast<std::uint64_t>(
                esp_timer_get_time());
            if (nowUs == 0U) nowUs = 1U;
            const BleGattInspectorState state = bleGattTransport.state();
            if (action == UiAction::Back || action == UiAction::Left) {
                if (bleGattWaitingForSurveyStop) {
                    bleGattReturnAfterCleanup = true;
                    lastRuntimeEvent = "ble_gatt_cancel_pending";
                    changed = true;
                } else if (state == BleGattInspectorState::PermissionReview ||
                           state ==
                               BleGattInspectorState::AwaitingConfirmation) {
                    changed = bleGattTransport.back(nowUs);
                    if (changed && bleGattTransport.cleanupComplete()) {
                        changed = releaseBleGattWorkspace() &&
                            activateBleInspectorWorkspace();
                        if (changed) {
                            bleProductView = BleProductView::InspectorMenu;
                            lastRuntimeEvent = "ble_inspector_modes";
                        }
                    }
                } else if (state == BleGattInspectorState::Connecting ||
                           state == BleGattInspectorState::Discovering ||
                           state == BleGattInspectorState::Ready) {
                    bleGattReturnAfterCleanup = true;
                    changed = bleGattTransport.back(nowUs);
                    lastRuntimeEvent = changed
                        ? "ble_gatt_cleanup" : "ble_gatt_cleanup_failed";
                } else if (state ==
                           BleGattInspectorState::CleanupPending) {
                    bleGattReturnAfterCleanup = true;
                    changed = true;
                } else if (bleGattTransport.cleanupComplete()) {
                    changed = finishBleGattToHome();
                }
            } else if ((action == UiAction::Select ||
                        action == UiAction::Right) &&
                       !bleGattWaitingForSurveyStop) {
                if (state == BleGattInspectorState::PermissionReview) {
                    changed = bleGattTransport.reviewPermission(
                        BleGattInspectorPermission::
                            EnumerateServicesAndCharacteristics);
                    if (changed) {
                        bleGattConfirmationToken =
                            bleGattTransport.confirmationToken();
                        lastRuntimeEvent = "ble_gatt_awaiting_confirmation";
                    }
                } else if (state ==
                           BleGattInspectorState::AwaitingConfirmation) {
                    bleGattWaitingForSurveyStop =
                        requestProductSurveyWorkerStop(true);
                    changed = bleGattWaitingForSurveyStop;
                    lastRuntimeEvent = changed
                        ? "ble_gatt_stopping_passive"
                        : "ble_gatt_survey_stop_failed";
                }
            } else if (state == BleGattInspectorState::Ready) {
                const std::size_t total = bleGattTransport.serviceCount() +
                    bleGattTransport.characteristicCount();
                if (action == UiAction::Up && bleGattFactSelection > 0U) {
                    --bleGattFactSelection;
                    changed = true;
                } else if (action == UiAction::Down &&
                           bleGattFactSelection + 1U < total) {
                    ++bleGattFactSelection;
                    changed = true;
                }
            }
        } else if (bleProductView == BleProductView::InspectorMenu) {
            handled = true;
            if (action == UiAction::Up && bleInspectorModeSelection > 0U) {
                --bleInspectorModeSelection;
                changed = true;
            } else if (action == UiAction::Down &&
                       bleInspectorModeSelection < 1U) {
                ++bleInspectorModeSelection;
                changed = true;
            } else if (action == UiAction::Back ||
                       action == UiAction::Left) {
                bleProductView = BleProductView::DeviceDetail;
                lastRuntimeEvent = "ble_device_detail";
                changed = true;
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                if (bleInspectorModeSelection == 0U) {
                    changed = beginBleInspectorCapture(
                        *liveBleDeviceDetail());
                    if (changed) {
                        bleInspectorRenderedRevision = UINT32_MAX;
                        bleProductView = BleProductView::InspectorRaw;
                        lastRuntimeEvent = "ble_inspector_receiving";
                    }
                } else if (bleSelectedDeviceConnectable()) {
                    changed = requestBleGattFromDetail();
                }
            }
        } else if (bleProductView == BleProductView::InspectorRaw) {
            handled = true;
            if (action == UiAction::Back || action == UiAction::Left) {
                (void)freezeBleInspectorCapture();
                bleProductView = BleProductView::InspectorMenu;
                bleInspectorModeSelection = 0U;
                lastRuntimeEvent = "ble_inspector_modes";
                changed = true;
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                const BleInspectorCaptureSummary summary =
                    bleInspectorCaptureSnapshot();
                if (summary.state == BleInspectorCaptureState::Running) {
                    changed = freezeBleInspectorCapture();
                    if (changed) lastRuntimeEvent = "ble_inspector_frozen";
                } else {
                    changed = beginBleInspectorCapture(*liveBleDeviceDetail());
                    if (changed) lastRuntimeEvent = "ble_inspector_receiving";
                }
            }
        } else if (bleProductView == BleProductView::DeviceDetail) {
            handled = true;
            if (action == UiAction::Back || action == UiAction::Left) {
                bleProductView = BleProductView::Devices;
                lastRuntimeEvent = "ble_devices";
                changed = true;
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                bleInspectorModeSelection = 0U;
                bleProductView = BleProductView::InspectorMenu;
                lastRuntimeEvent = "ble_inspector_modes";
                changed = true;
            }
        } else if (bleProductView == BleProductView::Devices) {
            handled = true;
            if (action == UiAction::Up || action == UiAction::Down ||
                action == UiAction::Select || action == UiAction::Right) {
                bleDeviceNavigationOrder.lock(bleDeviceCatalog);
            }
            if (action == UiAction::Up && bleDeviceSelection > 0U) {
                --bleDeviceSelection;
                changed = true;
            } else if (action == UiAction::Down &&
                       bleDeviceSelection + 1U < bleDeviceVisibleSize()) {
                ++bleDeviceSelection;
                changed = true;
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                const Observation* device = bleDeviceAt(bleDeviceSelection);
                if (device != nullptr) {
                    bleDeviceDetail = *device;
                    const std::size_t catalogIndex =
                        bleDeviceCatalog.indexOfIdentity(*device);
                    const BleDeviceSignalStats* signal =
                        bleDeviceCatalog.signalAt(catalogIndex);
                    bleDeviceDetailSignal = signal == nullptr
                        ? BleDeviceSignalStats{} : *signal;
                    bleDeviceRenderedDetail = {};
                    bleDeviceRenderedRadar = {};
                    std::uint64_t nowUs = static_cast<std::uint64_t>(
                        esp_timer_get_time());
                    if (nowUs == 0U) nowUs = 1U;
                    nextBleDeviceUiRefreshUs =
                        nowUs + kBleDeviceUiRefreshPeriodUs;
                    bleDeviceUiRefreshPending = false;
                    bleProductView = BleProductView::DeviceDetail;
                    lastRuntimeEvent = "ble_device_detail";
                    changed = true;
                }
            } else if (action == UiAction::Back ||
                       action == UiAction::Left) {
                const auto control = productSurveyControl();
                if (control == ProductSurveyWorkerControl::Starting ||
                    control == ProductSurveyWorkerControl::Running) {
                    changed = requestProductSurveyWorkerStop(true);
                } else {
                    // A terminal unavailable BLE view owns no worker or lease;
                    // only this explicit user Back action closes it.
                    bleProductView = BleProductView::None;
                    releaseBleInspectorWorkspace();
                    surveyPipeline.resetToSetup();
                    changed = uiController.apply(
                        action,
                        static_cast<std::uint8_t>(appCatalog.size()),
                        true, 2);
                    if (changed) appRuntime.stop();
                    const bool memoryRestored =
                        restoreBleProductSurveyMemory();
                    lastRuntimeEvent = memoryRestored
                        ? "ble_home" : "ble_memory_restore_failed";
                    changed = changed && memoryRestored;
                }
            }
        } else if (wifiProductView == WifiProductView::AirspaceGuard) {
            handled = true;
            if (airspaceGuardCaptureRunning()) {
                if (action == UiAction::Back || action == UiAction::Left) {
                    changed = stopAirspaceGuardProduct();
                }
            } else if (action == UiAction::Up) {
                changed = airspaceGuardController.previous();
            } else if (action == UiAction::Down) {
                changed = airspaceGuardController.next();
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                changed = airspaceGuardController.view() ==
                        AirspaceGuardView::Outcome
                    ? openAirspaceGuardProduct()
                    : airspaceGuardController.openSelected();
            } else if (action == UiAction::Back || action == UiAction::Left) {
                changed = airspaceGuardController.back();
                if (!changed) {
                    changed = stopAirspaceGuardProduct();
                }
            }
        } else if (wifiProductView == WifiProductView::Menu) {
            if (action == UiAction::Up && wifiProductSelection > 0) {
                handled = true;
                --wifiProductSelection;
                changed = true;
            } else if (action == UiAction::Down &&
                       wifiProductSelection + 1U < kWifiProductTaskCount) {
                handled = true;
                ++wifiProductSelection;
                changed = true;
            } else if ((action == UiAction::Select ||
                        action == UiAction::Right) &&
                       wifiProductTaskReady(wifiProductSelection)) {
                handled = true;
                if (wifiProductSelection == 0) {
                    changed = startWifiNetworksProduct();
                } else if (wifiProductSelection == 1) {
                    changed = startWifiDevicesProduct();
                } else if (wifiProductSelection == 2) {
                    changed = startWifiChannelsProduct();
                } else if (wifiProductSelection == 3) {
                    changed = openWifiVisitProduct();
                } else if (wifiProductSelection == 4) {
                    changed = openAirspaceGuardProduct();
                }
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                handled = true;
                lastRuntimeEvent = "wifi_task_not_ready";
            } else if (action == UiAction::Back || action == UiAction::Left) {
                handled = true;
                wifiProductView = WifiProductView::None;
                changed = uiController.apply(
                    action, static_cast<std::uint8_t>(appCatalog.size()),
                    true, 2);
                if (changed) appRuntime.stop();
                const bool memoryRestored = !changed ||
                    restoreBleProductSurveyMemory();
                lastRuntimeEvent = changed && memoryRestored
                    ? "wifi_home" : "ble_memory_restore_failed";
                changed = changed && memoryRestored;
            }
        } else if (rfSpectrumView == RfSpectrumView::SourceMenu) {
            handled = true;
            if (action == UiAction::Up && rfSpectrumSelection != 0) {
                rfSpectrumSelection = 0;
                changed = true;
            } else if (action == UiAction::Down && rfSpectrumSelection != 1) {
                rfSpectrumSelection = 1;
                changed = true;
            } else if ((action == UiAction::Select ||
                        action == UiAction::Right) &&
                       rfSpectrumSelection == 0) {
                changed = startNrf24Spectrum();
            } else if ((action == UiAction::Select ||
                        action == UiAction::Right) &&
                       rfSpectrumSelection == 1) {
                rfCcBandSelection =
                    leshy1::drivers::radio::Cc1101SpectrumBand::Band433;
                rfSpectrumView = RfSpectrumView::CcBandMenu;
                lastRuntimeEvent = "cc1101_spectrum_band_menu";
                changed = true;
            } else if (action == UiAction::Back || action == UiAction::Left) {
                rfSpectrumView = RfSpectrumView::None;
                lastRuntimeEvent = "survey_spectrum_plan";
                changed = true;
            }
        } else if (rfSpectrumView == RfSpectrumView::Nrf24Menu) {
            handled = true;
            if (action == UiAction::Up && nrf24ModeSelection != 0U) {
                nrf24ModeSelection = 0U;
                changed = true;
            } else if (action == UiAction::Down &&
                       nrf24ModeSelection != 1U) {
                nrf24ModeSelection = 1U;
                changed = true;
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                changed = nrf24ModeSelection == 0U
                    ? startNrf24Spectrum() : startNrf24Finder();
            } else if (action == UiAction::Back ||
                       action == UiAction::Left) {
                rfSpectrumView = RfSpectrumView::None;
                changed = uiController.apply(
                    action, static_cast<std::uint8_t>(appCatalog.size()),
                    true, 2);
                if (changed) appRuntime.stop();
                lastRuntimeEvent = "nrf24_home";
            }
        } else if (rfSpectrumView == RfSpectrumView::Nrf24Finder) {
            handled = true;
            if (action == UiAction::Back || action == UiAction::Left) {
                changed = stopNrf24Spectrum(false);
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                std::uint64_t nowUs =
                    static_cast<std::uint64_t>(esp_timer_get_time());
                if (nowUs == 0U) nowUs = 1U;
                changed = nrf24SignalFinder.restart(nowUs);
                if (changed) {
                    nrf24FinderRenderedRevision = UINT32_MAX;
                    nrf24FinderRenderedState = Nrf24SignalFinderState::Idle;
