anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
                    nrf24FinderRenderedChannel = 0xffU;
                    nrf24FinderRenderedFound = false;
                    nrf24FinderRenderedHeights.fill(0);
                    lastRuntimeEvent = "nrf24_finder_calibrating";
                }
            }
        } else if (rfSpectrumView == RfSpectrumView::SubGhzMenu) {
            handled = true;
            if (action == UiAction::Up && subGhzModeSelection != 0U) {
                --subGhzModeSelection;
                changed = true;
            } else if (action == UiAction::Down &&
                       subGhzModeSelection != 2U) {
                ++subGhzModeSelection;
                changed = true;
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                rfCcBandSelection =
                    leshy1::drivers::radio::Cc1101SpectrumBand::Band433;
                if (subGhzModeSelection == 0U) {
                    rfSpectrumView = RfSpectrumView::CcBandMenu;
                    lastRuntimeEvent = "cc1101_spectrum_band_menu";
                    changed = true;
                } else if (subGhzModeSelection == 1U) {
                    changed = startCc1101Finder();
                } else {
                    subGhzCaptureModeSelection = 0;
                    subGhzCaptureModulation =
                        leshy1::domain::captures::
                            SubGhzRawModulation::OokEnvelope;
                    rfSpectrumView = RfSpectrumView::SubGhzCaptureModeMenu;
                    lastRuntimeEvent = "subghz_raw_mode_menu";
                    changed = true;
                }
            } else if (action == UiAction::Back ||
                       action == UiAction::Left) {
                rfSpectrumView = RfSpectrumView::None;
                changed = uiController.apply(
                    action, static_cast<std::uint8_t>(appCatalog.size()),
                    true, 2);
                if (changed) appRuntime.stop();
                lastRuntimeEvent = "subghz_home";
            }
        } else if (rfSpectrumView == RfSpectrumView::CcFinder) {
            handled = true;
            if (action == UiAction::Back || action == UiAction::Left) {
                changed = stopCc1101Finder();
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                std::uint64_t nowUs =
                    static_cast<std::uint64_t>(esp_timer_get_time());
                if (nowUs == 0U) nowUs = 1U;
                changed = cc1101SignalFinder.restart(nowUs);
                if (changed) {
                    ccFinderRenderedRevision = UINT32_MAX;
                    ccFinderRenderedState = Cc1101SignalFinderState::Idle;
                    ccFinderRenderedFrequencyKHz = UINT32_MAX;
                    ccFinderRenderedFound = false;
                    ccFinderRenderedHeights.fill(0);
                    lastRuntimeEvent = "cc1101_finder_calibrating";
                }
            }
        } else if (rfSpectrumView ==
                   RfSpectrumView::SubGhzCaptureModeMenu) {
            handled = true;
            if (action == UiAction::Up &&
                subGhzCaptureModeSelection != 0U) {
                subGhzCaptureModeSelection = 0U;
                changed = true;
            } else if (action == UiAction::Down &&
                       subGhzCaptureModeSelection != 1U) {
                subGhzCaptureModeSelection = 1U;
                changed = true;
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                subGhzCaptureModulation = subGhzCaptureModeSelection == 0U
                    ? leshy1::domain::captures::
                          SubGhzRawModulation::OokEnvelope
                    : leshy1::domain::captures::
                          SubGhzRawModulation::FskAsync;
                rfSpectrumView = RfSpectrumView::SubGhzCaptureBandMenu;
                lastRuntimeEvent = "subghz_raw_band_menu";
                changed = true;
            } else if (action == UiAction::Back ||
                       action == UiAction::Left) {
                rfSpectrumView = RfSpectrumView::SubGhzMenu;
                lastRuntimeEvent = "subghz_modes";
                changed = true;
            }
        } else if (rfSpectrumView ==
                   RfSpectrumView::SubGhzCaptureBandMenu) {
            handled = true;
            std::uint8_t selection = ccBandSelectionIndex();
            if (action == UiAction::Up && selection != 0) {
                --selection;
                rfCcBandSelection = ccBandFromIndex(selection);
                changed = true;
            } else if (action == UiAction::Down && selection != 3) {
                ++selection;
                rfCcBandSelection = ccBandFromIndex(selection);
                changed = true;
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                changed = startSubGhzRawCapture(rfCcBandSelection);
            } else if (action == UiAction::Back ||
                       action == UiAction::Left) {
                rfSpectrumView = RfSpectrumView::SubGhzCaptureModeMenu;
                lastRuntimeEvent = "subghz_raw_mode_menu";
                changed = true;
            }
        } else if (rfSpectrumView == RfSpectrumView::SubGhzCaptureLive) {
            handled = true;
            if (subGhzRawCapture.stats().state ==
                    SubGhzRawCaptureState::Complete &&
                subGhzCapturePersistState == CapturePersistState::Result &&
                (action == UiAction::Select || action == UiAction::Right)) {
                changed = requestSubGhzRawCapturePersist();
            } else if (subGhzCapturePersistState ==
                           CapturePersistState::Saving) {
                changed = false;
            } else if (subGhzRawCapture.stats().state !=
                           SubGhzRawCaptureState::Waiting &&
                       subGhzRawCapture.stats().state !=
                           SubGhzRawCaptureState::Capturing &&
                       (action == UiAction::Select ||
                        action == UiAction::Right)) {
                changed = startSubGhzRawCapture(rfCcBandSelection);
            } else if (action == UiAction::Back || action == UiAction::Left) {
                changed = stopSubGhzRawCapture(true);
                subGhzRawCapture.reset();
                subGhzCapturePersistState = CapturePersistState::Result;
                subGhzCapturePersistStatus = "volatile";
                subGhzCapturePersistGeneration = 0;
            }
        } else if (rfSpectrumView == RfSpectrumView::CcBandMenu) {
            handled = true;
            std::uint8_t selection = ccBandSelectionIndex();
            if (action == UiAction::Up && selection != 0) {
                --selection;
                rfCcBandSelection = ccBandFromIndex(selection);
                changed = true;
            } else if (action == UiAction::Down && selection != 3) {
                ++selection;
                rfCcBandSelection = ccBandFromIndex(selection);
                changed = true;
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                changed = startCc1101Spectrum(rfCcBandSelection);
            } else if (action == UiAction::Back || action == UiAction::Left) {
                const bool direct = std::strcmp(appRuntime.activeApp(),
                                                "subghz") == 0;
                if (direct) {
                    rfSpectrumView = RfSpectrumView::SubGhzMenu;
                    lastRuntimeEvent = "subghz_modes";
                    changed = true;
                } else {
                    rfSpectrumView = RfSpectrumView::SourceMenu;
                    lastRuntimeEvent = "spectrum_source_menu";
                    changed = true;
                }
            }
        } else if (rfSpectrumView == RfSpectrumView::Live) {
            handled = true;
            if (action == UiAction::Back || action == UiAction::Left) {
                const bool directNrf =
                    rfSpectrumKind == RfSpectrumKind::Nrf24 &&
                    std::strcmp(appRuntime.activeApp(), "spectrum24") == 0;
                changed = stopCurrentSpectrum(!directNrf);
            } else if (action == UiAction::Up || action == UiAction::Down) {
                const bool fault = rfSpectrumKind == RfSpectrumKind::Cc1101
                    ? cc1101SpectrumController.state() ==
                          Cc1101SpectrumViewState::Fault
                    : nrf24SpectrumController.state() ==
                          Nrf24SpectrumViewState::Fault;
                changed = !fault &&
                    (action == UiAction::Up
                         ? spectrumViewport.previousMode()
                         : spectrumViewport.nextMode());
                if (changed) {
                    if (spectrumViewport.mode() ==
                        SpectrumDisplayMode::Waterfall) {
                        const std::size_t bins = activeSpectrumBins();
                        spectrumViewport.reset(bins);
                        spectrumViewport.setMode(
                            SpectrumDisplayMode::Waterfall);
                        resetSpectrumWaterfallTiming();
                        armSpectrumWaterfallForCurrentReceiver();
                    }
                    nextSpectrumUiRefreshUs = 0;
                    lastRuntimeEvent = spectrumViewport.mode() ==
                        SpectrumDisplayMode::Waterfall
                            ? "spectrum_waterfall_view"
                            : "spectrum_bar_view";
                }
            } else if (rfSpectrumKind == RfSpectrumKind::Cc1101) {
                if ((action == UiAction::Select ||
                     action == UiAction::Right) &&
                    cc1101SpectrumController.togglePause()) {
                    changed = true;
                    if (cc1101SpectrumController.state() ==
                        Cc1101SpectrumViewState::Paused) {
                        if (!boardCc1101Spectrum.idle()) {
                            boardCc1101Spectrum.end();
                            cc1101SpectrumController.fail();
                            releaseSpectrumViewportWorkspace();
                            lastRuntimeEvent =
                                "cc1101_spectrum_pause_failed";
                        } else {
                            lastRuntimeEvent = "cc1101_spectrum_paused";
                        }
                    } else {
                        lastRuntimeEvent = "cc1101_spectrum_running";
                    }
                }
            } else if ((action == UiAction::Select ||
                        action == UiAction::Right) &&
                       nrf24SpectrumController.toggleMetric()) {
                const SpectrumDisplayMode displayMode =
                    spectrumViewport.mode();
                changed = spectrumViewport.reset(
                    Nrf24SpectrumController::kChannelCount);
                if (changed && displayMode ==
                        SpectrumDisplayMode::Waterfall) {
                    changed = spectrumViewport.nextMode();
                }
                resetSpectrumWaterfallTiming();
                armSpectrumWaterfallForCurrentReceiver();
                nextSpectrumUiRefreshUs = 0;
                lastRuntimeEvent = nrf24SpectrumController.metric() ==
                    Nrf24SpectrumMetric::Traffic
                        ? "nrf24_spectrum_traffic"
                        : "nrf24_spectrum_signal";
            }
        } else if (wifiProductView == WifiProductView::Networks &&
                   surveyWorkflow.state() != SurveyWorkflowState::Running &&
                   productSurveyControl() == ProductSurveyWorkerControl::Idle &&
                   (action == UiAction::Back || action == UiAction::Left)) {
            handled = true;
            closeProductSurveyBackend();
            surveyPipeline.resetToSetup();
            wifiProductView = WifiProductView::Menu;
            wifiProductSelection = 0;
            lastRuntimeEvent = "wifi_menu";
            changed = true;
        } else if (wifiProductView ==
                   WifiProductView::AuthenticationCapture) {
            handled = true;
            WifiAuthenticationCaptureController& controller =
                activeWifiAuthenticationCaptureController();
            const bool terminal = wifiAuthenticationProductState ==
                WifiAuthenticationProductState::Result &&
                controller.ready();
            const bool persistDialog =
                (!wifiAuthenticationSynthetic ||
                 wifiAuthenticationPersistenceHil) &&
                (wifiAuthenticationPersistState ==
                     CapturePersistState::Confirm ||
                 wifiAuthenticationPersistState ==
                     CapturePersistState::Saving);
            if (persistDialog &&
                (action == UiAction::Back || action == UiAction::Left) &&
                wifiAuthenticationPersistState ==
                    CapturePersistState::Confirm) {
                wifiAuthenticationPersistState = CapturePersistState::Result;
                wifiAuthenticationPersistStatus = "volatile";
                lastRuntimeEvent = "authentication_store_cancelled";
                changed = true;
            } else if (persistDialog &&
                       (action == UiAction::Select ||
                        action == UiAction::Right) &&
                       wifiAuthenticationPersistState ==
                           CapturePersistState::Confirm) {
                changed = requestWifiAuthenticationCapturePersist();
            } else if (persistDialog) {
                changed = false;
            } else if (terminal && action == UiAction::Up) {
                changed = controller.previous();
            } else if (terminal && action == UiAction::Down) {
                changed = controller.next();
            } else if (terminal &&
                       (action == UiAction::Select ||
                        action == UiAction::Right)) {
                if (controller.view() ==
                        WifiAuthenticationCaptureView::Actions &&
                    controller.selectedAction() ==
                        WifiAuthenticationCaptureAction::Repeat) {
                    changed = wifiAuthenticationSynthetic
                        ? leaveWifiAuthenticationSyntheticHilView(true)
                        : repeatWifiAuthenticationCapture();
                } else if (controller.view() ==
                               WifiAuthenticationCaptureView::Actions &&
                           controller.selectedAction() ==
                               WifiAuthenticationCaptureAction::Save) {
                    if ((!wifiAuthenticationSynthetic ||
                         wifiAuthenticationPersistenceHil) &&
                        wifiAuthenticationPersistState !=
                            CapturePersistState::Saved) {
                        wifiAuthenticationPersistState =
                            CapturePersistState::Confirm;
                        wifiAuthenticationPersistStatus =
                            "awaiting_confirmation";
                        wifiAuthenticationPersistGeneration = 0U;
                        wifiAuthenticationPcapReady = false;
                        wifiAuthenticationStandardReady = false;
                        wifiCaptureStoreKind =
                            WifiCaptureStoreKind::Authentication;
                        lastRuntimeEvent = "authentication_store_confirm";
                        changed = true;
                    }
                } else {
                    changed = controller.openSelected();
                }
            } else if (action == UiAction::Back ||
                       action == UiAction::Left) {
                changed = terminal && controller.back()
                    ? true : leaveWifiAuthenticationCapture();
            }
        } else if (wifiProductView == WifiProductView::NetworkDetail) {
            handled = true;
            if (action == UiAction::Back || action == UiAction::Left) {
                wifiProductView = WifiProductView::Networks;
                lastRuntimeEvent = "wifi_networks";
                changed = true;
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                changed = requestWifiAuthenticationCaptureFromDetail();
            }
        } else if (wifiProductView == WifiProductView::DeviceDetail) {
            handled = true;
            if (action == UiAction::Back || action == UiAction::Left) {
                std::uint64_t nowUs =
                    static_cast<std::uint64_t>(esp_timer_get_time());
                if (nowUs == 0U) nowUs = 1U;
                wifiFrameCapture.unlockDeviceChannel(nowUs);
                wifiProductView = WifiProductView::Devices;
                lastRuntimeEvent = "wifi_devices";
                changed = true;
            }
        } else if (wifiProductView == WifiProductView::Devices) {
            handled = true;
            if (action == UiAction::Up || action == UiAction::Down ||
                action == UiAction::Select || action == UiAction::Right) {
                wifiDeviceNavigationOrder.lock(wifiDeviceCatalog);
            }
            if (action == UiAction::Up && wifiDeviceSelection > 0U) {
                --wifiDeviceSelection;
                changed = true;
            } else if (action == UiAction::Down &&
                       wifiDeviceSelection + 1U < wifiDeviceVisibleSize()) {
                ++wifiDeviceSelection;
                changed = true;
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                const WifiDeviceRecord* device =
                    wifiDeviceAt(wifiDeviceSelection);
                if (device != nullptr) {
                    wifiDeviceDetail = *device;
                    std::uint64_t nowUs =
                        static_cast<std::uint64_t>(esp_timer_get_time());
                    if (nowUs == 0U) nowUs = 1U;
                    const bool locked = wifiFrameCapture.lockDeviceChannel(
                        wifiDeviceDetail.channel, nowUs);
                    wifiProductView = WifiProductView::DeviceDetail;
                    nextWifiDeviceUiRefreshUs = nowUs;
                    lastRuntimeEvent = locked
                        ? "wifi_device_detail_live"
                        : "wifi_device_detail_live_unavailable";
                    changed = true;
                }
            } else if (action == UiAction::Back ||
                       action == UiAction::Left) {
                changed = stopWifiDevicesProduct();
            }
        } else if (wifiProductView == WifiProductView::Channels) {
            handled = true;
            if (action == UiAction::Back || action == UiAction::Left) {
                changed = stopWifiChannelsProduct();
            }
        } else if (wifiProductView == WifiProductView::Networks &&
                   surveyWorkflow.state() == SurveyWorkflowState::Running) {
            handled = true;
            if (action == UiAction::Up || action == UiAction::Down ||
                action == UiAction::Select || action == UiAction::Right) {
                wifiNetworkNavigationOrder.lock(wifiNetworkCatalog);
            }
            if (action == UiAction::Up && wifiNetworkSelection > 0) {
                --wifiNetworkSelection;
                changed = true;
            } else if (action == UiAction::Down &&
                       wifiNetworkSelection + 1U <
                           wifiNetworkVisibleSize()) {
                ++wifiNetworkSelection;
                changed = true;
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                const Observation* observation = wifiNetworkAt(
                    wifiNetworkSelection);
                if (observation != nullptr) {
                    wifiNetworkDetail = *observation;
                    const std::size_t catalogIndex =
                        wifiNetworkCatalog.indexOfIdentity(*observation);
                    const WifiNetworkSignalStats* signal =
                        wifiNetworkCatalog.signalAt(catalogIndex);
                    wifiNetworkDetailSignal = signal == nullptr
                        ? WifiNetworkSignalStats{
                            1U, observation->rssiDbm,
                            observation->rssiDbm, 0}
                        : *signal;
                    wifiProductView = WifiProductView::NetworkDetail;
                    lastRuntimeEvent = "wifi_network_detail";
                    changed = true;
                }
            } else if (action == UiAction::Back ||
                       action == UiAction::Left) {
                changed = requestProductSurveyWorkerStop(true);
            }
        } else if (wifiProductView == WifiProductView::Visit &&
                   (surveyWorkflow.state() == SurveyWorkflowState::Result ||
                    surveyWorkflow.state() == SurveyWorkflowState::Error)) {
            if (action == UiAction::Back || action == UiAction::Left) {
                handled = true;
                surveyPipeline.resetToSetup();
                wifiProductView = WifiProductView::Menu;
                wifiProductSelection = 3;
                lastRuntimeEvent = "wifi_menu";
                changed = true;
            } else if ((action == UiAction::Select ||
                        action == UiAction::Right) &&
                       fieldSurveyTracker.result().complete()) {
                handled = true;
                changed = openCurrentFieldSurveyExport();
                lastRuntimeEvent = changed
                    ? "field_visit_export_ready"
                    : "field_visit_export_unavailable";
            }
        } else if (surveyWorkflow.state() == SurveyWorkflowState::Setup &&
            productSurveySourceUnavailableVisible() &&
            (action == UiAction::Select || action == UiAction::Right ||
             action == UiAction::Up || action == UiAction::Down)) {
            handled = true;
            lastRuntimeEvent = "source_unavailable_waiting_back";
        } else if (surveyWorkflow.state() == SurveyWorkflowState::Setup &&
                   surveySourceController.view() ==
                       SurveySetupView::Sources) {
            if (action == UiAction::Up) {
                handled = true;
                changed = surveySourceController.previous();
            } else if (action == UiAction::Down) {
                handled = true;
                changed = surveySourceController.next();
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                handled = true;
                const SurveySetupActivation activation =
                    surveySourceController.activate();
                changed = activation ==
                    SurveySetupActivation::SourceChanged;
                lastRuntimeEvent = leshy1::apps::survey::
                    surveySetupActivationName(activation);
            } else if (action == UiAction::Back ||
                       action == UiAction::Left) {
                handled = true;
                changed = surveySourceController.back();
                if (changed) lastRuntimeEvent = "survey_source_plan";
            }
        } else if (surveyWorkflow.state() == SurveyWorkflowState::Setup &&
                   (action == UiAction::Up || action == UiAction::Down)) {
            handled = true;
            changed = action == UiAction::Up
