anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
                infraredCapturePersistState = CapturePersistState::Result;
                infraredCapturePersistStatus = "volatile";
                infraredCapturePersistGeneration = 0;
                captureView = CaptureView::SourceMenu;
                lastRuntimeEvent = "capture_source_menu";
                uiController.recordHandledAction(action);
                return finish(true);
            }
        } else {
        const auto state = wifiFrameCapture.stats().state;
        if (state == WifiFrameCaptureState::Idle &&
            (action == UiAction::Select || action == UiAction::Right)) {
            uiController.recordHandledAction(action);
            return finish(startWifiFrameCapture());
        }
        if (state == WifiFrameCaptureState::Running &&
            (action == UiAction::Select || action == UiAction::Right)) {
            uiController.recordHandledAction(action);
            return finish(stopWifiFrameCapture());
        }
        if (state == WifiFrameCaptureState::Complete &&
            capturePersistState == CapturePersistState::Result &&
            (action == UiAction::Select || action == UiAction::Right)) {
            capturePersistState = CapturePersistState::Confirm;
            capturePersistStatus = "awaiting_confirmation";
            lastRuntimeEvent = "capture_store_confirm";
            uiController.recordHandledAction(action);
            return finish(true);
        }
        if (state == WifiFrameCaptureState::Complete &&
            capturePersistState == CapturePersistState::Confirm &&
            (action == UiAction::Select || action == UiAction::Right)) {
            uiController.recordHandledAction(action);
            return finish(requestWifiFrameCapturePersist());
        }
        if (state == WifiFrameCaptureState::Complete &&
            capturePersistState == CapturePersistState::Confirm &&
            (action == UiAction::Back || action == UiAction::Left)) {
            capturePersistState = CapturePersistState::Result;
            capturePersistStatus = "volatile";
            lastRuntimeEvent = "capture_store_cancelled";
            uiController.recordHandledAction(action);
            return finish(true);
        }
        if (state == WifiFrameCaptureState::Complete &&
            capturePersistState == CapturePersistState::Saving) {
            uiController.recordHandledAction(action);
            return finish(false);
        }
        if (action == UiAction::Back || action == UiAction::Left) {
            if (state == WifiFrameCaptureState::Running) {
                stopWifiFrameCapture();
            }
            wifiFrameCapture.reset();
            capturePersistState = CapturePersistState::Result;
            capturePersistStatus = "volatile";
            capturePersistGeneration = 0;
            nextCaptureUiRefreshUs = 0;
            captureView = CaptureView::SourceMenu;
            lastRuntimeEvent = "capture_source_menu";
            uiController.recordHandledAction(action);
            return finish(true);
        }
        }
    }
    if (!wasRoot && uiController.page() == kSerialConsolePage) {
        bool handled = true;
        bool changed = false;
        if (serialConsoleUiView == SerialConsoleUiView::Running) {
            if (action == UiAction::Back || action == UiAction::Left) {
                serialConsoleUiActionStatus =
                    serialConsoleActionDispatcher.cancel();
                clearSerialConsoleLivePreview();
                serialConsoleUiView = SerialConsoleUiView::Result;
                lastRuntimeEvent = "serial_console_cancelled";
                changed = true;
            } else {
                handled = false;
            }
        } else if (serialConsoleUiView == SerialConsoleUiView::Confirm) {
            if (action == UiAction::Back || action == UiAction::Left) {
                serialConsoleUiView = SerialConsoleUiView::Setup;
                lastRuntimeEvent = "serial_console_confirmation_cancelled";
                changed = true;
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                refreshSerialConsoleUiConfig();
                const auto descriptor =
                    leshy1::services::serial::serialConsoleActionDescriptor(
                        serialConsoleLastConfig);
                const auto context =
                    serialConsoleActionContext(descriptor, true);
                serialConsoleLastPreflight = serialConsoleEndpoint.configure(
                    serialConsoleLastConfig, serialConsoleHardware());
                serialConsoleUiActionStatus =
                    serialConsoleLastPreflight ==
                            leshy1::services::serial::
                                SerialConsolePreflightStatus::Ready
                        ? serialConsoleActionDispatcher.invoke(
                              descriptor, context, serialConsoleEndpoint,
                              millis())
                        : leshy1::services::actions::ActionStatus::
                              CapabilityUnavailable;
                if (serialConsoleUiActionStatus ==
                    leshy1::services::actions::ActionStatus::Running) {
                    serialConsoleUiView = SerialConsoleUiView::Running;
                    serialConsoleNextUiRefreshMs = 0U;
                    lastRuntimeEvent = "serial_console_started";
                } else {
                    // configure() never touches pins.  Scrub even that staged
                    // state when admission (lock, permission, lease) fails.
                    serialConsoleEndpoint.cancel();
                    serialConsoleUiView = SerialConsoleUiView::Result;
                    lastRuntimeEvent = "serial_console_start_rejected";
                }
                changed = true;
            } else {
                handled = false;
            }
        } else if (serialConsoleUiView == SerialConsoleUiView::Result) {
            if (action == UiAction::Select || action == UiAction::Right) {
                enterSerialConsoleUi();
                lastRuntimeEvent = "serial_console_setup";
                changed = true;
            } else if (action == UiAction::Back || action == UiAction::Left) {
                changed = uiController.apply(
                    action, static_cast<std::uint8_t>(appCatalog.size()),
                    true, kSerialConsolePage);
                lastRuntimeEvent = changed ? "serial_console_device_menu"
                                           : "serial_console_back_rejected";
            } else {
                handled = false;
            }
        } else {
            refreshSerialConsoleUiConfig();
            const bool ready = serialConsoleLastPreflight ==
                leshy1::services::serial::
                    SerialConsolePreflightStatus::Ready;
            if (action == UiAction::Back || action == UiAction::Left) {
                changed = uiController.apply(
                    action, static_cast<std::uint8_t>(appCatalog.size()),
                    true, kSerialConsolePage);
                lastRuntimeEvent = changed ? "serial_console_device_menu"
                                           : "serial_console_back_rejected";
            } else if (ready && action == UiAction::Up &&
                       serialConsoleUiSelection > 0U) {
                --serialConsoleUiSelection;
                changed = true;
            } else if (ready && action == UiAction::Down &&
                       serialConsoleUiSelection < 3U) {
                ++serialConsoleUiSelection;
                changed = true;
            } else if (ready && (action == UiAction::Select ||
                                 action == UiAction::Right)) {
                if (serialConsoleUiSelection == 0U) {
                    serialConsoleUiMode = serialConsoleUiMode ==
                            leshy1::services::serial::
                                SerialConsoleMode::Monitor
                        ? leshy1::services::serial::SerialConsoleMode::Bridge
                        : leshy1::services::serial::SerialConsoleMode::Monitor;
                } else if (serialConsoleUiSelection == 1U) {
                    serialConsoleBaudIndex = static_cast<std::uint8_t>(
                        (serialConsoleBaudIndex + 1U) %
                        kSerialConsoleUiBauds.size());
                } else if (serialConsoleUiSelection == 2U) {
                    serialConsoleDurationIndex = static_cast<std::uint8_t>(
                        (serialConsoleDurationIndex + 1U) %
                        kSerialConsoleUiDurationsMs.size());
                } else {
                    if (deviceLock.state() !=
                        leshy1::services::security::
                            DeviceLockState::Unlocked) {
                        serialConsoleUiActionStatus =
                            leshy1::services::actions::ActionStatus::
                                AuthenticationRequired;
                        serialConsoleUiView = SerialConsoleUiView::Result;
                        lastRuntimeEvent =
                            "serial_console_authentication_required";
                    } else {
                        refreshSerialConsoleUiConfig();
                        serialConsoleUiView = SerialConsoleUiView::Confirm;
                        lastRuntimeEvent = "serial_console_confirmation";
                    }
                }
                changed = true;
            } else {
                handled = ready;
            }
        }
        if (handled) {
            uiController.recordHandledAction(action);
            return finish(changed);
        }
    }
    if (!wasRoot && uiController.page() == kDeviceLockPage) {
        bool handled = true;
        bool changed = false;
        bool controllerRecorded = true;
        const DeviceLockView view = deviceLockController.view();
        if (action == UiAction::Back || action == UiAction::Left) {
            if (view == DeviceLockView::Working) {
                lastRuntimeEvent = "device_lock_operation_pending";
            } else if (deviceLockController.cancel()) {
                changed = true;
                lastRuntimeEvent = "device_lock_editor_cancelled";
            } else {
                changed = uiController.apply(
                    action, static_cast<std::uint8_t>(appCatalog.size()),
                    true, kDeviceLockPage);
                controllerRecorded = false;
                lastRuntimeEvent = changed ? "device_lock_device_menu"
                                           : "device_lock_back_rejected";
            }
        } else if (view == DeviceLockView::EnterPin ||
                   view == DeviceLockView::ConfirmPin) {
            if (action == UiAction::Up) {
                changed = deviceLockController.previousDigit();
            } else if (action == UiAction::Down) {
                changed = deviceLockController.nextDigit();
            } else if (action == UiAction::Select ||
                       action == UiAction::Right) {
                changed = deviceLockController.advance();
                if (deviceLockController.submissionReady()) {
                    const bool started = requestDeviceLockWorker();
                    lastRuntimeEvent = started
                        ? "device_lock_operation_started"
                        : "device_lock_worker_unavailable";
                }
            } else {
                handled = false;
            }
        } else if (view == DeviceLockView::Status &&
                   (action == UiAction::Select ||
                    action == UiAction::Right)) {
            const DeviceLockActivation activation =
                deviceLockController.activate();
            if (activation == DeviceLockActivation::EditorOpened) {
                changed = true;
                lastRuntimeEvent = "device_lock_editor_opened";
            } else if (activation ==
                       DeviceLockActivation::LockRequested) {
                deviceLock.lock();
                const std::uint64_t nowUs =
                    static_cast<std::uint64_t>(esp_timer_get_time());
                deviceLockController.noteLocked(deviceLock.audit(nowUs));
                changed = true;
                lastRuntimeEvent = "device_lock_locked";
            } else {
                lastRuntimeEvent = "device_lock_action_unavailable";
            }
        } else {
            handled = view == DeviceLockView::Working;
        }
        if (handled) {
            if (controllerRecorded) uiController.recordHandledAction(action);
            return finish(changed);
        }
    }
    if (!wasRoot && uiController.page() == kDevicePage) {
        bool handled = false;
        bool changed = false;
        if (action == UiAction::Up && deviceSelection > 0) {
            handled = true;
            --deviceSelection;
            changed = true;
        } else if (action == UiAction::Down &&
                   deviceSelection + 1U < kDeviceItemCount) {
            handled = true;
            ++deviceSelection;
            changed = true;
        } else if (action == UiAction::Select || action == UiAction::Right) {
            handled = true;
            constexpr std::uint8_t pages[kDeviceItemCount] = {
                kPowerPage, 5, kDeviceLockPage, kSerialConsolePage,
                kAboutPage, 1, 6,
            };
            const bool settingsAllowed = deviceSelection != 1U ||
                deviceLockOperationAllowed(
                    leshy1::services::security::
                        DeviceLockOperation::SensitiveSettings);
            changed = settingsAllowed &&
                uiController.openChild(pages[deviceSelection]);
            if (!settingsAllowed) noteDeviceLockAdmissionBlocked();
            if (changed && deviceSelection == 1) {
                interfaceSettingsController.enter();
            }
            if (changed && deviceSelection == 2) {
                const std::uint64_t nowUs =
                    static_cast<std::uint64_t>(esp_timer_get_time());
                deviceLockController.enter(deviceLock.audit(nowUs));
            }
            if (changed && deviceSelection == 3) {
                enterSerialConsoleUi();
            }
            if (settingsAllowed) {
                lastRuntimeEvent = changed ? "device_item_opened"
                                           : "device_item_rejected";
            }
        }
        if (handled) {
            if (action == UiAction::Up || action == UiAction::Down) {
                uiController.recordHandledAction(action);
            }
            return finish(changed);
        }
    }
    if (!wasRoot && uiController.page() == kPowerPage &&
        (action == UiAction::Select || action == UiAction::Right)) {
        const bool changed = performBoundedLightSleep(1000000ULL);
        lastRuntimeEvent = changed ? "power_sleep_resumed"
                                   : "power_sleep_rejected";
        uiController.recordHandledAction(action);
        return finish(changed);
    }
    if (!wasRoot && uiController.page() == 5) {
        bool handled = false;
        bool changed = false;
        if (action == UiAction::Up) {
            handled = true;
            changed = interfaceSettingsController.previous();
        } else if (action == UiAction::Down) {
            handled = true;
            changed = interfaceSettingsController.next();
        } else if (action == UiAction::Select || action == UiAction::Right) {
            handled = true;
            switch (interfaceSettingsController.selected()) {
                case InterfaceSetting::Language: {
                    const UiLanguage requested =
                        languageController.active() == UiLanguage::English
                            ? UiLanguage::Russian : UiLanguage::English;
                    const bool persisted = saveUiLanguage(requested);
                    if (persisted) languageController.restore(requested);
                    changed = persisted;
                    lastRuntimeEvent = persisted ? "language_persisted"
                                                 : "language_persist_failed";
                    break;
                }
                case InterfaceSetting::Brightness: {
                    const std::uint8_t previous =
                        interfaceSettingsController.brightnessIndex();
                    const InterfaceTheme theme =
                        interfaceSettingsController.theme();
                    interfaceSettingsController.cycleBrightness();
                    const bool persisted = saveUiBrightnessIndex(
                        interfaceSettingsController.brightnessIndex());
                    if (!persisted) {
                        interfaceSettingsController.restore(previous, theme);
                    } else {
                        ledcWrite(BoardProfile::kBacklightPin,
                                  interfaceSettingsController.brightnessDuty());
                    }
                    changed = persisted;
                    lastRuntimeEvent = persisted ? "brightness_persisted"
                                                 : "brightness_persist_failed";
                    break;
                }
                case InterfaceSetting::Theme: {
                    const std::uint8_t brightness =
                        interfaceSettingsController.brightnessIndex();
                    const InterfaceTheme previous =
                        interfaceSettingsController.theme();
                    interfaceSettingsController.cycleTheme();
                    const bool persisted = saveUiTheme(
                        interfaceSettingsController.theme());
                    if (!persisted) {
                        interfaceSettingsController.restore(brightness, previous);
                    } else {
                        leshy1::ui::visual::applyTheme(
                            interfaceSettingsController.theme());
                    }
                    changed = persisted;
                    lastRuntimeEvent = persisted ? "theme_persisted"
                                                 : "theme_persist_failed";
                    break;
                }
                case InterfaceSetting::AntennaLeds: {
                    const std::uint8_t previous =
                        antennaStatusController.brightnessIndex();
                    antennaStatusController.cycleBrightness();
                    const bool persisted = saveStatusLedBrightnessIndex(
                        antennaStatusController.brightnessIndex());
                    if (!persisted) {
                        antennaStatusController.restoreBrightness(previous);
                    }
                    changed = persisted;
                    lastRuntimeEvent = persisted
                        ? "antenna_led_brightness_persisted"
                        : "antenna_led_brightness_persist_failed";
                    break;
                }
                case InterfaceSetting::Sound:
                    changed = false;
                    lastRuntimeEvent = "sound_locked_hw_t09";
                    break;
            }
        }
        if (handled) {
            uiController.recordHandledAction(action);
            return finish(changed);
        }
    }
    if (!wasRoot && uiController.page() == 6) {
        bool handled = false;
        bool changed = false;
        if (selfTestController.view() == SelfTestView::ModeMenu &&
            action == UiAction::Up) {
            handled = true;
            changed = selfTestController.previousMode();
        } else if (selfTestController.view() == SelfTestView::ModeMenu &&
                   action == UiAction::Down) {
            handled = true;
            changed = selfTestController.nextMode();
        } else if (action == UiAction::Select || action == UiAction::Right) {
            handled = true;
            const std::uint64_t startedUs =
                static_cast<std::uint64_t>(esp_timer_get_time());
            const bool completesFullPlan =
                selfTestController.view() == SelfTestView::VisualCheck &&
                selfTestController.visualState() + 1U >=
                    SelfTestController::kVisualStateCount;
            if (completesFullPlan) runShieldReceiverSelfTestProbe();
            changed = selfTestController.activate(snapshotSelfTestFacts(),
                                                   startedUs);
            if (changed &&
                selfTestController.view() == SelfTestView::ActiveChecks) {
                fullGuidedRfState = {};
                fullGuidedArtifactState = {};
                fullGuidedNrf24Report = {};
                fullGuidedCc1101Report = {};
                fullGuidedRfStartAfterUs = startedUs + 500000ULL;
                lastRuntimeEvent = "self_test_active_rf_pending";
            }
            if (selfTestController.runAwaitingFinish() &&
                selfTestController.view() == SelfTestView::Result) {
                selfTestController.finishRun(
                    static_cast<std::uint64_t>(esp_timer_get_time()));
                lastRuntimeEvent = leshy1::apps::self_test::
                    selfTestResultStatusName(selfTestController.report().status);
            } else if (selfTestController.view() == SelfTestView::VisualCheck) {
                lastRuntimeEvent = "self_test_visual_check";
            } else if (selfTestController.view() ==
                       SelfTestView::ActiveChecks) {
                lastRuntimeEvent = "self_test_active_rf_pending";
            } else if (changed) {
                lastRuntimeEvent = "self_test_preflight";
            }
        } else if (action == UiAction::Back || action == UiAction::Left) {
            bool cleanupReady = true;
            if (selfTestController.view() == SelfTestView::ActiveChecks) {
                cleanupReady = cancelFullGuidedRfChecks();
            }
            changed = cleanupReady && selfTestController.back();
            handled = changed;
            if (changed) {
                lastRuntimeEvent = "self_test_modes";
            } else if (!cleanupReady) {
                handled = true;
                lastRuntimeEvent = "self_test_cancel_cleanup_failed";
            }
        }
        if (handled) {
            uiController.recordHandledAction(action);
            return finish(changed);
        }
    }
    const bool wantsLaunch = wasRoot && (action == UiAction::Select || action == UiAction::Right);
    bool openable = selected != nullptr && selected->enabled;
    LaunchStatus launchStatus = LaunchStatus::InvalidDescriptor;
    if (wantsLaunch) {
        const bool protectedLaunch = selected != nullptr &&
            std::strcmp(selected->id, "device") != 0;
        const bool admissionAllowed = !protectedLaunch ||
            deviceLockOperationAllowed(
                leshy1::services::security::
                    DeviceLockOperation::ProtectedUi);
        launchStatus = selected == nullptr
                           ? LaunchStatus::InvalidDescriptor
                           : admissionAllowed
                                 ? appRuntime.launch(
                                       selected->id, selected->enabled,
                                       selected->resources)
                                 : LaunchStatus::InvalidDescriptor;
        lastRuntimeEvent = admissionAllowed
            ? leshy1::kernel::runtime::launchStatusName(launchStatus)
            : leshy1::services::security::deviceLockAccessName(
                  deviceLockLastAdmissionAccess);
        openable = launchStatus == LaunchStatus::Started;
        if (openable && selected != nullptr &&
            std::strcmp(selected->id, "language") == 0) {
            languageController.enter();
        }
