anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
        if (openable && selected != nullptr &&
            std::strcmp(selected->id, "device") == 0) {
            deviceSelection = 0;
        }
        if (openable && selected != nullptr &&
            std::strcmp(selected->id, "lab") == 0) {
            automationPackageCatalog.clear();
            automationInspectorController.clear();
            automationCatalogStatus =
                BoardAutomationPackageStatus::DirectoryUnavailable;
            automationCatalogOmittedEntries = 0U;
            automationCatalogRefreshPending = true;
            automationInspectionPending = false;
            lastRuntimeEvent = "automation_library_loading";
        }
        if (openable && selected != nullptr &&
            std::strcmp(selected->id, "capture") == 0) {
            captureView = CaptureView::SourceMenu;
            captureSourceSelection = 0;
            wifiFrameCapture.reset();
            capturePersistState = CapturePersistState::Result;
            capturePersistStatus = "volatile";
            capturePersistGeneration = 0;
            infraredCapture.reset();
            infraredReceiverReport = {};
            infraredCapturePersistState = CapturePersistState::Result;
            infraredCapturePersistStatus = "volatile";
            infraredCapturePersistGeneration = 0;
            nextCaptureUiRefreshUs = 0;
        }
        if (openable && selected != nullptr &&
            std::strcmp(selected->id, "targets") == 0) {
            openable = loadTargetsProduct(*selected);
        }
        const bool surveyApp = selected != nullptr &&
            (std::strcmp(selected->id, "wifi") == 0 ||
             std::strcmp(selected->id, "ble") == 0);
        const bool spectrumApp = selected != nullptr &&
            (std::strcmp(selected->id, "spectrum24") == 0 ||
             std::strcmp(selected->id, "subghz") == 0);
        if (openable && selected != nullptr && (surveyApp || spectrumApp)) {
            if (rfSpectrumView != RfSpectrumView::None ||
                boardNrf24Spectrum.active() ||
                boardCc1101Spectrum.active()) {
                stopCurrentSpectrum(false);
            } else {
                nrf24SpectrumController.reset();
                nrf24SignalFinder.reset();
                nrf24SpectrumReport = {};
                cc1101SignalFinder.reset();
                cc1101SpectrumController.reset();
                cc1101SpectrumReport = {};
            }
            rfSpectrumKind = RfSpectrumKind::Nrf24;
            rfSpectrumSelection = 0;
            nrf24ModeSelection = 0;
            subGhzModeSelection = 0;
            subGhzCaptureModeSelection = 0;
            subGhzCaptureModulation = leshy1::domain::captures::
                SubGhzRawModulation::OokEnvelope;
            rfCcBandSelection =
                leshy1::drivers::radio::Cc1101SpectrumBand::Band433;
            nextSpectrumUiRefreshUs = 0;
            if (surveyApp) {
                const bool wifiApp = std::strcmp(selected->id, "wifi") == 0;
                if (wifiApp) {
                    wifiFrameCapture.reset();
                    resetWifiAuthenticationCaptureProduct();
                    airspaceGuardController.reset();
                    airspaceGuardCaptureState =
                        AirspaceGuardCaptureState::Idle;
                    nextAirspaceGuardUiRefreshUs = 0;
                    airspaceGuardResultNeedsContentClear = false;
                    wifiDeviceCatalog.reset();
                    wifiDeviceNavigationOrder.reset();
                    wifiDeviceSelection = 0;
                    wifiDeviceDetail = {};
                    nextWifiDeviceUiRefreshUs = 0;
                }
                wifiProductView = wifiApp ? WifiProductView::Menu
                                          : WifiProductView::None;
                wifiProductSelection = 0;
                if (!wifiApp) {
                    bleProductView = BleProductView::None;
                    startBleDevicesProduct();
                } else {
                    bleProductView = BleProductView::None;
                }
            } else if (std::strcmp(selected->id, "spectrum24") == 0) {
                wifiProductView = WifiProductView::None;
                rfSpectrumView = RfSpectrumView::Nrf24Menu;
                lastRuntimeEvent = "nrf24_modes";
            } else {
                wifiProductView = WifiProductView::None;
                rfSpectrumKind = RfSpectrumKind::Cc1101;
                rfSpectrumView = RfSpectrumView::SubGhzMenu;
                subGhzRawCapture.reset();
                subGhzCapturePersistState = CapturePersistState::Result;
                subGhzCapturePersistStatus = "volatile";
                subGhzCapturePersistGeneration = 0;
                lastRuntimeEvent = "subghz_modes";
            }
        }
    }
    const bool changed = uiController.apply(
        action, static_cast<std::uint8_t>(appCatalog.size()), openable,
        selected == nullptr ? UiController::kRootPage : selected->page);
    if (wantsLaunch && launchStatus == LaunchStatus::Started && !changed) {
        const char* rollbackEvent = "launch_rolled_back";
        if (selected != nullptr &&
            std::strcmp(selected->id, "targets") == 0) {
            // Preserve the exact fail-closed load cause for UI/HIL telemetry;
            // releaseTargetsProduct() intentionally resets the product status.
            rollbackEvent = lastRuntimeEvent;
            releaseTargetsProduct();
        }
        appRuntime.stop();
        lastRuntimeEvent = rollbackEvent;
    } else if (!wasRoot && uiController.isRoot() && changed) {
        if (pageBefore == 7) releaseTargetsProduct();
        if (pageBefore == 8U) {
            automationCatalogRefreshPending = false;
            automationInspectionPending = false;
            automationPackageCatalog.clear();
            automationInspectorController.clear();
        }
        appRuntime.stop();
        lastRuntimeEvent = "stopped";
    }
    return finish(changed);
}

struct TouchDispatchTarget final {
    TouchTarget target{};
    std::uint8_t current = 0;
};

TouchDispatchTarget touchDispatchTarget(TouchPoint point) {
    if (uiController.isRoot()) {
        const std::uint8_t first = homeFirstVisible(uiController.selection());
        return {
            leshy1::ui::hitTouchTarget(
                TouchTargetLayout::HomeRows, point, first,
                static_cast<std::uint8_t>(appCatalog.size())),
            uiController.selection(),
        };
    }
    if (uiController.page() == 8U &&
        !automationCatalogRefreshPending &&
        automationCatalogStatus == BoardAutomationPackageStatus::Ready &&
        automationPackageCatalog.size() != 0U) {
        return {
            leshy1::ui::hitTouchTarget(
                TouchTargetLayout::HomeRows, point, 0U,
                static_cast<std::uint8_t>(automationPackageCatalog.size())),
            static_cast<std::uint8_t>(automationPackageCatalog.selection()),
        };
    }
    if (uiController.page() == 2) {
        if (bleProductView == BleProductView::InspectorMenu) {
            return {leshy1::ui::hitTouchTarget(
                        TouchTargetLayout::TwoChoices, point),
                    bleInspectorModeSelection};
        }
        if (bleProductView == BleProductView::Devices) {
            const std::size_t first =
                bleDeviceFirstVisible(bleDeviceSelection);
            return {leshy1::ui::hitTouchTarget(
                        TouchTargetLayout::HomeRows, point,
                        static_cast<std::uint8_t>(first),
                        static_cast<std::uint8_t>(bleDeviceCatalog.size())),
                    static_cast<std::uint8_t>(bleDeviceSelection)};
        }
        if (wifiProductView == WifiProductView::Menu) {
            const std::uint8_t first =
                wifiProductFirstVisible(wifiProductSelection);
            return {leshy1::ui::hitTouchTarget(
                        TouchTargetLayout::HomeRows, point, first,
                        kWifiProductTaskCount),
                    wifiProductSelection};
        }
        if (wifiProductView == WifiProductView::AirspaceGuard &&
            (airspaceGuardController.view() == AirspaceGuardView::Finding ||
             airspaceGuardController.view() ==
                 AirspaceGuardView::EvidenceList)) {
            const AirspaceGuardUiModel model =
                leshy1::ui::presentAirspaceGuard(
                    airspaceGuardController, languageController.active());
            if (airspaceGuardController.view() == AirspaceGuardView::Finding) {
                for (std::uint8_t row = 0; row < model.rowCount; ++row) {
                    if (leshy1::ui::visual::containsPoint(
                            airspaceGuardRowBounds(row),
                            static_cast<std::int16_t>(point.x),
                            static_cast<std::int16_t>(point.y))) {
                        // Every finding row describes the same selected burst;
                        // tapping any of them is the touch equivalent of Enter.
                        return {{true, 0}, 0};
                    }
                }
                return {};
            }
            const std::size_t selection =
                airspaceGuardController.evidenceSelection();
            const std::size_t first =
                selection < AirspaceGuardUiModel::kVisibleRowCapacity
                    ? 0U
                    : selection -
                          AirspaceGuardUiModel::kVisibleRowCapacity + 1U;
            for (std::uint8_t row = 0; row < model.rowCount; ++row) {
                if (leshy1::ui::visual::containsPoint(
                        airspaceGuardRowBounds(row),
                        static_cast<std::int16_t>(point.x),
                        static_cast<std::int16_t>(point.y))) {
                    return {{true, static_cast<std::uint8_t>(first + row)},
                            static_cast<std::uint8_t>(selection)};
                }
            }
            return {};
        }
        if (wifiProductView == WifiProductView::AuthenticationCapture &&
            wifiAuthenticationProductState ==
                WifiAuthenticationProductState::Result &&
            activeWifiAuthenticationCaptureController().ready() &&
            (activeWifiAuthenticationCaptureController().view() ==
                 WifiAuthenticationCaptureView::Actions ||
             activeWifiAuthenticationCaptureController().view() ==
                 WifiAuthenticationCaptureView::EvidenceList)) {
            const WifiAuthenticationCaptureController& controller =
                activeWifiAuthenticationCaptureController();
            const bool actions = controller.view() ==
                WifiAuthenticationCaptureView::Actions;
            const std::size_t selection = actions
                ? controller.actionSelection()
                : controller.evidenceSelection();
            const std::size_t count = actions
                ? controller.actionCount()
                : controller.evidenceCount();
            const std::size_t first =
                selection < WifiAuthenticationCaptureUiModel::
                                kVisibleRowCapacity
                    ? 0U
                    : selection -
                          WifiAuthenticationCaptureUiModel::
                              kVisibleRowCapacity + 1U;
            const std::size_t visible = std::min<std::size_t>(
                count - first,
                WifiAuthenticationCaptureUiModel::kVisibleRowCapacity);
            for (std::size_t row = 0U; row < visible; ++row) {
                if (leshy1::ui::visual::containsPoint(
                        Components::metricRow(
                            static_cast<std::uint8_t>(row + 1U)),
                        static_cast<std::int16_t>(point.x),
                        static_cast<std::int16_t>(point.y))) {
                    return {
                        {true, static_cast<std::uint8_t>(first + row)},
                        static_cast<std::uint8_t>(selection)};
                }
            }
            return {};
        }
        if (wifiProductView == WifiProductView::Networks &&
            surveyWorkflow.state() == SurveyWorkflowState::Running) {
            const std::size_t first =
                wifiNetworkFirstVisible(wifiNetworkSelection);
            return {leshy1::ui::hitTouchTarget(
                        TouchTargetLayout::HomeRows, point,
                        static_cast<std::uint8_t>(first),
                        static_cast<std::uint8_t>(wifiNetworkVisibleSize())),
                    static_cast<std::uint8_t>(wifiNetworkSelection)};
        }
        if (wifiProductView == WifiProductView::Devices) {
            const std::size_t first =
                wifiDeviceFirstVisible(wifiDeviceSelection);
            return {leshy1::ui::hitTouchTarget(
                        TouchTargetLayout::HomeRows, point,
                        static_cast<std::uint8_t>(first),
                        static_cast<std::uint8_t>(wifiDeviceVisibleSize())),
                    static_cast<std::uint8_t>(wifiDeviceSelection)};
        }
        if (rfSpectrumView == RfSpectrumView::SourceMenu) {
            return {leshy1::ui::hitTouchTarget(
                        TouchTargetLayout::TwoChoices, point),
                    rfSpectrumSelection};
        }
        if (rfSpectrumView == RfSpectrumView::Nrf24Menu) {
            return {leshy1::ui::hitTouchTarget(
                        TouchTargetLayout::TwoChoices, point),
                    nrf24ModeSelection};
        }
        if (rfSpectrumView == RfSpectrumView::SubGhzMenu) {
            return {leshy1::ui::hitTouchTarget(
                        TouchTargetLayout::ThreeChoices, point, 0, 3),
                    subGhzModeSelection};
        }
        if (rfSpectrumView == RfSpectrumView::SubGhzCaptureModeMenu) {
            return {leshy1::ui::hitTouchTarget(
                        TouchTargetLayout::TwoChoices, point),
                    subGhzCaptureModeSelection};
        }
        if (rfSpectrumView == RfSpectrumView::CcBandMenu ||
            rfSpectrumView == RfSpectrumView::SubGhzCaptureBandMenu) {
            return {leshy1::ui::hitTouchTarget(
                        TouchTargetLayout::HomeRows, point, 0, 4),
                    ccBandSelectionIndex()};
        }
        if (rfSpectrumView == RfSpectrumView::None &&
            surveyWorkflow.state() == SurveyWorkflowState::Setup &&
            !productSurveySourceUnavailableVisible()) {
            const bool sources = surveySourceController.view() ==
                                 SurveySetupView::Sources;
            return {leshy1::ui::hitTouchTarget(
                        sources ? TouchTargetLayout::TwoChoices
                                : TouchTargetLayout::ThreeChoices,
                        point, 0,
                        sources
                            ? static_cast<std::uint8_t>(
                                  SurveySourceController::kSourceCount)
                            : surveySourceController.planItemCount()),
                    surveySourceController.selection()};
        }
        if (rfSpectrumView == RfSpectrumView::None &&
            surveyWorkflow.state() == SurveyWorkflowState::Running &&
            surveyController.view() == SurveyView::Filter) {
            return {leshy1::ui::hitTouchTarget(
                        TouchTargetLayout::ThreeChoices, point),
                    static_cast<std::uint8_t>(surveyController.draftFilter())};
        }
    }
    if (uiController.page() == 7 && webCompanionOverlay) {
        return {leshy1::ui::hitTouchTarget(
                    TouchTargetLayout::HomeRows, point, 0, 1),
                0};
    }
    if (uiController.page() == 7 && targetsProductRuntime != nullptr &&
        (targetsProductRuntime->controller.view() == TargetsView::List ||
         targetsProductRuntime->controller.view() == TargetsView::Compare)) {
        const TargetsController& controller =
            targetsProductRuntime->controller;
        const std::size_t first = targetsFirstVisible(
            controller.navigationSelection());
        return {leshy1::ui::hitTouchTarget(
                    TouchTargetLayout::HomeRows, point,
                    static_cast<std::uint8_t>(first),
                    static_cast<std::uint8_t>(
                        controller.navigationCount())),
                static_cast<std::uint8_t>(
                    controller.navigationSelection())};
    }
    if (uiController.page() == 7 && targetsProductRuntime != nullptr &&
        targetsProductRuntime->controller.view() == TargetsView::Actions) {
        const std::size_t first = targetsFirstVisible(
            targetsProductRuntime->controller.actionSelection());
        return {leshy1::ui::hitTouchTarget(
                    TouchTargetLayout::HomeRows, point,
                    static_cast<std::uint8_t>(first),
                    static_cast<std::uint8_t>(
                        TargetsController::kActionCount)),
                static_cast<std::uint8_t>(
                    targetsProductRuntime->controller.actionSelection())};
    }
    if (uiController.page() == 7 && targetsProductRuntime != nullptr &&
        targetsProductRuntime->controller.view() == TargetsView::MergeList) {
        const TargetsController& controller =
            targetsProductRuntime->controller;
        const std::size_t first = targetsFirstVisible(
            controller.mergeSelection());
        return {leshy1::ui::hitTouchTarget(
                    TouchTargetLayout::HomeRows, point,
                    static_cast<std::uint8_t>(first),
                    static_cast<std::uint8_t>(
                        controller.mergeCandidateCount())),
                static_cast<std::uint8_t>(controller.mergeSelection())};
    }
    if (uiController.page() == 7 && targetsProductRuntime != nullptr &&
        (targetsProductRuntime->controller.view() == TargetsView::MergeConfirm ||
         targetsProductRuntime->controller.view() == TargetsView::SplitConfirm)) {
        return leshy1::ui::visual::containsPoint(
                   Components::homeRow(3), point.x, point.y)
            ? TouchDispatchTarget{{true, 3}, 3}
            : TouchDispatchTarget{};
    }
    if (uiController.page() == 7 && targetsProductRuntime != nullptr &&
        targetsProductRuntime->controller.view() ==
            TargetsView::CorrelationList) {
        const TargetsController& controller =
            targetsProductRuntime->controller;
        const std::size_t first = targetsFirstVisible(
            controller.correlationSelection());
        return {leshy1::ui::hitTouchTarget(
                    TouchTargetLayout::HomeRows, point,
                    static_cast<std::uint8_t>(first),
                    static_cast<std::uint8_t>(
                        controller.selectedCorrelationCount())),
                static_cast<std::uint8_t>(controller.correlationSelection())};
    }
    if (uiController.page() == 7 && targetsProductRuntime != nullptr &&
        targetsProductRuntime->controller.view() ==
            TargetsView::CorrelationReview) {
        return {leshy1::ui::hitTouchTarget(
                    TouchTargetLayout::HomeRows, point, 0,
                    static_cast<std::uint8_t>(
                        TargetsController::kCorrelationReviewControlCount)),
                static_cast<std::uint8_t>(targetsProductRuntime->controller
                                              .correlationReviewSelection())};
    }
    if (uiController.page() == 7 && targetsProductRuntime != nullptr &&
        targetsProductRuntime->controller.view() == TargetsView::NameEdit) {
        return {leshy1::ui::hitTouchTarget(
                    TouchTargetLayout::HomeRows, point, 0,
                    static_cast<std::uint8_t>(
                        TargetsController::kNameEditControlCount)),
                static_cast<std::uint8_t>(
                    targetsProductRuntime->controller.nameEditorSelection())};
    }
    if (uiController.page() == 7 && targetsProductRuntime != nullptr &&
        targetsProductRuntime->controller.view() == TargetsView::TagList) {
        const TargetsController& controller =
            targetsProductRuntime->controller;
        const std::size_t first = targetsFirstVisible(
            controller.tagSelection());
        return {leshy1::ui::hitTouchTarget(
                    TouchTargetLayout::HomeRows, point,
                    static_cast<std::uint8_t>(first),
                    static_cast<std::uint8_t>(controller.tagEntryCount())),
                static_cast<std::uint8_t>(controller.tagSelection())};
    }
    if (uiController.page() == 7 && targetsProductRuntime != nullptr &&
        targetsProductRuntime->controller.view() == TargetsView::TagEdit) {
        return {leshy1::ui::hitTouchTarget(
                    TouchTargetLayout::HomeRows, point, 0,
                    static_cast<std::uint8_t>(
                        TargetsController::kTagEditControlCount)),
                static_cast<std::uint8_t>(
                    targetsProductRuntime->controller.tagEditorSelection())};
    }
    if (uiController.page() == 7 && targetsProductRuntime != nullptr &&
        targetsProductRuntime->controller.view() == TargetsView::NotesEdit) {
        return {leshy1::ui::hitTouchTarget(
                    TouchTargetLayout::HomeRows, point, 0,
                    static_cast<std::uint8_t>(
                        TargetsController::kNotesEditControlCount)),
                static_cast<std::uint8_t>(
                    targetsProductRuntime->controller.notesEditorSelection())};
    }
    if (uiController.page() == 4 &&
        captureView == CaptureView::SourceMenu) {
        return {leshy1::ui::hitTouchTarget(
                    TouchTargetLayout::TwoChoices, point),
                captureSourceSelection};
    }
    if (uiController.page() == 5) {
        const std::uint8_t first = settingsFirstVisible(
            interfaceSettingsController.selection());
        return {
            leshy1::ui::hitTouchTarget(
                TouchTargetLayout::HomeRows, point, first,
                InterfaceSettingsController::kItemCount),
            interfaceSettingsController.selection(),
        };
    }
    if (uiController.page() == kDevicePage) {
        const std::uint8_t first = deviceFirstVisible(deviceSelection);
        return {
            leshy1::ui::hitTouchTarget(
                TouchTargetLayout::HomeRows, point, first, kDeviceItemCount),
            deviceSelection,
        };
    }
    if (uiController.page() == 6 &&
        selfTestController.view() == SelfTestView::ModeMenu) {
        return {leshy1::ui::hitTouchTarget(
                    TouchTargetLayout::TwoChoices, point),
                selfTestController.selection()};
    }
    return {};
}

