anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
bool dispatchTouchPoint(TouchPoint point, bool synthetic = false) {
    lastTouchPoint = point;
    lastTouchChanged = false;
    if (synthetic) ++syntheticTouchPresses;
    if (uiController.page() == kDeviceLockPage) {
        UiAction action = UiAction::Unknown;
        const DeviceLockView view = deviceLockController.view();
        if (view == DeviceLockView::Status &&
            leshy1::ui::visual::containsPoint(
                Components::homeRow(3), point.x, point.y)) {
            action = UiAction::Select;
        } else if ((view == DeviceLockView::EnterPin ||
                    view == DeviceLockView::ConfirmPin) &&
                   point.x >= 15U && point.x < 225U &&
                   point.y >= 84U && point.y < 134U) {
            // The complete six-cell strip is one generous touch target: each
            // tap increments the active digit while keys retain both
            // directions. This avoids six tiny, error-prone targets.
            action = UiAction::Down;
        } else if ((view == DeviceLockView::EnterPin ||
                    view == DeviceLockView::ConfirmPin) &&
                   leshy1::ui::visual::containsPoint(
                       Components::homeRow(2), point.x, point.y)) {
            action = UiAction::Select;
        } else if ((view == DeviceLockView::EnterPin ||
                    view == DeviceLockView::ConfirmPin) &&
                   leshy1::ui::visual::containsPoint(
                       Components::homeRow(3), point.x, point.y)) {
            action = UiAction::Back;
        }
        if (action == UiAction::Unknown) {
            ++touchMissedPresses;
            return false;
        }
        ++touchHandledPresses;
        const bool changed = applyUiAction(action, false);
        lastTouchChanged = changed;
        if (changed) {
            renderInteractiveScreen(!lastUiActionUsedIncrementalRender);
        }
        return changed;
    }
    const TouchDispatchTarget dispatch = touchDispatchTarget(point);
    if (!dispatch.target.hit) {
        ++touchMissedPresses;
        return false;
    }

    ++touchHandledPresses;
    std::uint8_t current = dispatch.current;
    bool changed = false;
    while (current > dispatch.target.index) {
        if (!applyUiAction(UiAction::Up, false)) break;
        --current;
        changed = true;
    }
    while (current < dispatch.target.index) {
        if (!applyUiAction(UiAction::Down, false)) break;
        ++current;
        changed = true;
    }
    if (current == dispatch.target.index) {
        changed = applyUiAction(UiAction::Select, false) || changed;
    }
    lastTouchChanged = changed;
    const bool authenticationIncremental =
        uiController.page() == 2 &&
        wifiProductView == WifiProductView::AuthenticationCapture;
    if (changed) renderInteractiveScreen(!authenticationIncremental);
    return changed;
}

void emitTouchState(Stream& reply) {
    const auto& metrics = boardTouchInput.metrics();
    const std::uint16_t rawPressure = boardTouchInput.rawPressure();
    const std::uint16_t* calibration = boardTouchInput.calibration();
    char line[640] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.touch.frontend.v1\",\"kind\":\"state\","
        "\"status\":\"%s\",\"calibration_source\":\"%s\","
        "\"calibration_required_at_boot\":%s,"
        "\"calibration_succeeded_at_boot\":%s,"
        "\"pressure_threshold\":%u,\"raw_pressure\":%u,"
        "\"calibration\":[%u,%u,%u,%u,%u],"
        "\"release_debounce_ms\":%lu,"
        "\"samples\":%lu,\"touched_samples\":%lu,"
        "\"press_events\":%lu,\"release_events\":%lu,"
        "\"rejected_coordinates\":%lu,\"pressed\":%s,"
        "\"last_x\":%u,\"last_y\":%u,"
        "\"handled_presses\":%lu,\"missed_presses\":%lu,"
        "\"synthetic_presses\":%lu,\"last_changed\":%s,"
        "\"footer_interactive\":false,\"touch_back_enabled\":false}",
        boardTouchInput.ready() ? "ready" : "calibration_required",
        leshy1::platform::arduino::touchCalibrationSourceName(
            boardTouchInput.calibrationSource()),
        touchCalibrationRequiredAtBoot ? "true" : "false",
        touchCalibrationSucceededAtBoot ? "true" : "false",
        static_cast<unsigned>(BoardTouchInput::pressureThreshold()),
        static_cast<unsigned>(rawPressure),
        static_cast<unsigned>(calibration[0]),
        static_cast<unsigned>(calibration[1]),
        static_cast<unsigned>(calibration[2]),
        static_cast<unsigned>(calibration[3]),
        static_cast<unsigned>(calibration[4]),
        static_cast<unsigned long>(leshy1::ui::TouchInput::kReleaseDebounceMs),
        static_cast<unsigned long>(metrics.samples),
        static_cast<unsigned long>(metrics.touchedSamples),
        static_cast<unsigned long>(metrics.pressEvents),
        static_cast<unsigned long>(metrics.releaseEvents),
        static_cast<unsigned long>(metrics.rejectedCoordinates),
        boardTouchInput.pressed() ? "true" : "false",
        static_cast<unsigned>(metrics.lastX),
        static_cast<unsigned>(metrics.lastY),
        static_cast<unsigned long>(touchHandledPresses),
        static_cast<unsigned long>(touchMissedPresses),
        static_cast<unsigned long>(syntheticTouchPresses),
        lastTouchChanged ? "true" : "false");
    reply.println(line);
}

void handleSyntheticTouch(Stream& reply, const char* command) {
    unsigned x = 0;
    unsigned y = 0;
    char trailing = '\0';
    if (std::sscanf(command + std::strlen("ui.touch "), "%u %u %c", &x, &y,
                    &trailing) != 2 ||
        x >= static_cast<unsigned>(Layout::ScreenWidth) ||
        y >= static_cast<unsigned>(Layout::ScreenHeight)) {
        reply.println("{\"schema\":\"leshy.touch.frontend.v1\","
                      "\"kind\":\"error\","
                      "\"reason\":\"invalid_screen_coordinate\"}");
        return;
    }
    dispatchTouchPoint(
        {static_cast<std::uint16_t>(x), static_cast<std::uint16_t>(y)}, true);
    emitTouchState(reply);
}

void calibrateTouch(Stream& reply) {
    reply.println("{\"schema\":\"leshy.touch.calibration.v1\","
                  "\"kind\":\"started\",\"points\":4}");
    reply.flush();
    const bool saved = boardTouchInput.calibrateAndSave(millis());
    renderInteractiveScreen(true);
    reply.println(saved
        ? "{\"schema\":\"leshy.touch.calibration.v1\","
          "\"kind\":\"result\",\"status\":\"pass\","
          "\"stored\":true}"
        : "{\"schema\":\"leshy.touch.calibration.v1\","
          "\"kind\":\"result\",\"status\":\"fail\","
          "\"stored\":false}");
}

void captureDisplay(Stream& reply) {
    static std::uint16_t pixels[kScreenWidth * kCaptureRows] = {};
    char line[256] = {};
    const std::uint32_t byteCount =
        static_cast<std::uint32_t>(kScreenWidth * kScreenHeight * 2);
    std::snprintf(line, sizeof(line),
                  "{\"schema\":\"leshy.ui.capture.v1\",\"kind\":\"frame_begin\","
                  "\"width\":%ld,\"height\":%ld,\"format\":\"rgb565be\","
                  "\"bytes\":%lu,\"revision\":%lu}",
                  static_cast<long>(kScreenWidth), static_cast<long>(kScreenHeight),
                  static_cast<unsigned long>(byteCount),
                  static_cast<unsigned long>(uiController.revision()));
    reply.println(line);
    reply.flush();
    for (std::int32_t y = 0; y < kScreenHeight; y += kCaptureRows) {
        display.readRect(0, y, kScreenWidth, kCaptureRows, pixels);
        reply.write(reinterpret_cast<const std::uint8_t*>(pixels), sizeof(pixels));
        delay(0);
    }
    reply.print('\n');
    std::snprintf(line, sizeof(line),
                  "{\"schema\":\"leshy.ui.capture.v1\",\"kind\":\"frame_end\","
                  "\"bytes\":%lu,\"revision\":%lu}",
                  static_cast<unsigned long>(byteCount),
                  static_cast<unsigned long>(uiController.revision()));
    reply.println(line);
    reply.flush();
}

