anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    for (std::size_t index = 0; index < result.identity.cid.size(); ++index) {
        std::snprintf(cidHex + index * 2, sizeof(cidHex) - index * 2, "%02X",
                      static_cast<unsigned>(result.identity.cid[index]));
        std::snprintf(csdHex + index * 2, sizeof(csdHex) - index * 2, "%02X",
                      static_cast<unsigned>(result.identity.csd[index]));
    }
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.storage.sd.physical.v1\",\"kind\":\"result\","
        "\"status\":\"%s\",\"parse_status\":\"%s\","
        "\"wire_status\":\"%s\",\"explicitly_selected\":true,"
        "\"identification_only\":true,\"resource_required\":%lu,"
        "\"resource_acquired\":%s,\"owned_during\":%lu,\"owned_after\":%lu,"
        "\"spi_hz\":%lu,\"detect_level\":%d,"
        "\"detect_authoritative\":false,\"physical_spi_started\":%s,"
        "\"bytes_clocked\":%lu,\"transport_exchanges\":%u,"
        "\"commands_attempted\":%u,\"commands_completed\":%u,"
        "\"init_attempts\":%u,\"ocr\":%lu,\"capacity_bytes\":%llu,"
        "\"cid_hex\":\"%s\",\"csd_hex\":\"%s\","
        "\"gpio21_stable_high\":%s,\"cleanup_complete\":%s,"
        "\"mount_attempted\":false,\"filesystem_touched\":false,"
        "\"write_commands\":false,\"format_allowed\":false,"
        "\"nrf_ce_high_events\":0,\"radio_tx_commands\":0}",
        leshy1::storage::sdTransportRunStatusName(result.status),
        leshy1::storage::sdIdentificationStatusName(result.parseStatus),
        leshy1::storage::sdWireStatusName(transport.lastWireStatus()),
        static_cast<unsigned long>(leshy1::storage::kSdIdentificationResources),
        resourcesAcquired ? "true" : "false",
        static_cast<unsigned long>(ownedDuring),
        static_cast<unsigned long>(ownedAfter),
        static_cast<unsigned long>(BoardProfile::kSdIdentificationSpiHz),
        static_cast<int>(storageDiscovery.detectLevel),
        transport.physicalSpiStarted() ? "true" : "false",
        static_cast<unsigned long>(transport.bytesClocked()),
        static_cast<unsigned>(transport.exchanges()),
        static_cast<unsigned>(result.commandsAttempted),
        static_cast<unsigned>(result.commandsCompleted),
        static_cast<unsigned>(result.identity.initAttempts),
        static_cast<unsigned long>(result.identity.ocr),
        static_cast<unsigned long long>(result.identity.capacityBytes),
        cidHex, csdHex,
        transport.gpio21StableHigh() ? "true" : "false",
        transport.cleanupComplete() ? "true" : "false");
    reply.println(line);
}

void emitPhysicalSdSector0(Stream& reply) {
    auto& line = sdPhysicalEvidence.line;
    auto& summary = sdPhysicalEvidence.summaryA;
    auto& cidHex = sdPhysicalEvidence.cidHex;
    auto& sector = sdPhysicalEvidence.sectorA;
    cidHex[0] = '\0';
    std::strcpy(summary, "{}");
    sector.fill(0);

    const bool idleUi = uiController.isRoot() && !appRuntime.running();
    const bool resourcesAcquired = idleUi && resourceBroker.acquire(
        kSdIdentificationOwner, leshy1::storage::kSdIdentificationResources);
    const std::uint32_t ownedDuring =
        resourceBroker.ownedBy(kSdIdentificationOwner);
    BoardSdSpiTransport transport;
    const bool adapterBegun = resourcesAcquired && transport.begin();
    leshy1::storage::SdTransportRunResult identity;
    leshy1::storage::SdSectorReadStatus permitStatus =
        leshy1::storage::SdSectorReadStatus::ExplicitTargetRequired;
    bool blockRead = false;
    std::uint16_t receivedCrc16 = 0;
    const char* status = "resource_unavailable";

    if (adapterBegun) {
        leshy1::storage::SdTransportRunPolicy identityPolicy;
        identityPolicy.allowPhysical = true;
        identityPolicy.explicitlySelected = true;
        identityPolicy.identificationOnly = true;
        identityPolicy.ownedResources = ownedDuring;
        identity = leshy1::storage::runSdIdentificationStateMachine(
            leshy1::storage::defaultSdIdentificationPlan(), transport,
            identityPolicy);
        if (identity.status == leshy1::storage::SdTransportRunStatus::Valid) {
            leshy1::storage::SdSectorReadRequest request;
            request.explicitlySelected = true;
            request.readOnly = true;
            request.highCapacity = identity.identity.highCapacity;
            request.capacityBytes = identity.identity.capacityBytes;
            request.lba = 0;
            request.blockCount = 1;
            request.ownedResources = ownedDuring;
            permitStatus = leshy1::storage::authorizeSdSector0Read(request);
            if (permitStatus == leshy1::storage::SdSectorReadStatus::Permitted) {
                blockRead = transport.readSingleBlock(0, &sector, &receivedCrc16);
                status = blockRead ? "valid" : "read_failed";
            } else {
                status = "permit_rejected";
            }
        } else {
            status = "identity_failed";
        }
        transport.end();
    } else if (!idleUi) {
        status = "ui_not_idle";
    } else if (resourcesAcquired) {
        status = "adapter_begin_failed";
    }
    resourceBroker.releaseAll(kSdIdentificationOwner);
    const std::uint32_t ownedAfter =
        resourceBroker.ownedBy(kSdIdentificationOwner);

    leshy1::storage::SdSector0Inspection inspection;
    if (blockRead) {
        inspection = leshy1::storage::inspectSdSector0(
            sector, identity.identity.capacityBytes);
        if (!leshy1::storage::formatSdSector0Json(
                inspection, summary, sizeof(summary))) {
            std::strcpy(summary, "{}");
            status = "format_failed";
        }
    }
    for (std::size_t index = 0; index < identity.identity.cid.size(); ++index) {
        std::snprintf(cidHex + index * 2, sizeof(cidHex) - index * 2, "%02X",
                      static_cast<unsigned>(identity.identity.cid[index]));
    }
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.storage.sd.sector0.v1\",\"kind\":\"result\","
        "\"status\":\"%s\",\"identity_status\":\"%s\","
        "\"permit_status\":\"%s\",\"wire_status\":\"%s\","
        "\"explicitly_selected\":true,\"read_only\":true,"
        "\"lba\":0,\"block_count_requested\":1,\"blocks_read\":%u,"
        "\"resource_acquired\":%s,\"owned_during\":%lu,\"owned_after\":%lu,"
        "\"spi_hz\":%lu,\"bytes_clocked\":%lu,"
        "\"identity_commands_completed\":%u,\"cid_hex\":\"%s\","
        "\"capacity_bytes\":%llu,\"wire_crc16\":%u,"
        "\"gpio21_stable_high\":%s,\"cleanup_complete\":%s,"
        "\"mount_attempted\":false,\"filesystem_touched\":false,"
        "\"raw_sector_retained\":false,\"write_commands\":false,"
        "\"format_allowed\":false,\"nrf_ce_high_events\":0,"
        "\"radio_tx_commands\":0,\"inspection\":%s}",
        status, leshy1::storage::sdTransportRunStatusName(identity.status),
        leshy1::storage::sdSectorReadStatusName(permitStatus),
        leshy1::storage::sdWireStatusName(transport.lastWireStatus()),
        static_cast<unsigned>(transport.dataBlockReads()),
        resourcesAcquired ? "true" : "false",
        static_cast<unsigned long>(ownedDuring),
        static_cast<unsigned long>(ownedAfter),
        static_cast<unsigned long>(BoardProfile::kSdIdentificationSpiHz),
        static_cast<unsigned long>(transport.bytesClocked()),
        static_cast<unsigned>(identity.commandsCompleted), cidHex,
        static_cast<unsigned long long>(identity.identity.capacityBytes),
        static_cast<unsigned>(receivedCrc16),
        transport.gpio21StableHigh() ? "true" : "false",
        transport.cleanupComplete() ? "true" : "false", summary);
    reply.println(line);
}

void emitPhysicalSdBoot(Stream& reply) {
    auto& line = sdPhysicalEvidence.line;
    auto& sector0Summary = sdPhysicalEvidence.summaryA;
    auto& bootSummary = sdPhysicalEvidence.summaryB;
    auto& cidHex = sdPhysicalEvidence.cidHex;
    auto& sector0 = sdPhysicalEvidence.sectorA;
    auto& bootSector = sdPhysicalEvidence.sectorB;
    cidHex[0] = '\0';
    std::strcpy(sector0Summary, "{}");
    std::strcpy(bootSummary, "{}");
    sector0.fill(0);
    bootSector.fill(0);

    const bool idleUi = uiController.isRoot() && !appRuntime.running();
    const bool resourcesAcquired = idleUi && resourceBroker.acquire(
        kSdIdentificationOwner, leshy1::storage::kSdIdentificationResources);
    const std::uint32_t ownedDuring =
        resourceBroker.ownedBy(kSdIdentificationOwner);
    BoardSdSpiTransport transport;
    const bool adapterBegun = resourcesAcquired && transport.begin();
    leshy1::storage::SdTransportRunResult identity;
    leshy1::storage::SdSectorReadStatus sector0Permit =
        leshy1::storage::SdSectorReadStatus::ExplicitTargetRequired;
    leshy1::storage::SdSectorReadStatus bootPermit =
        leshy1::storage::SdSectorReadStatus::ExplicitTargetRequired;
    leshy1::storage::SdSector0Inspection sector0Inspection;
    leshy1::storage::SdFilesystemBootInspection bootInspection;
    bool sector0Read = false;
    bool bootRead = false;
    std::uint16_t sector0WireCrc16 = 0;
    std::uint16_t bootWireCrc16 = 0;
    const char* status = "resource_unavailable";

    if (adapterBegun) {
        leshy1::storage::SdTransportRunPolicy identityPolicy;
        identityPolicy.allowPhysical = true;
        identityPolicy.explicitlySelected = true;
        identityPolicy.identificationOnly = true;
        identityPolicy.ownedResources = ownedDuring;
        identity = leshy1::storage::runSdIdentificationStateMachine(
            leshy1::storage::defaultSdIdentificationPlan(), transport,
            identityPolicy);
        if (identity.status == leshy1::storage::SdTransportRunStatus::Valid) {
            leshy1::storage::SdSectorReadRequest request;
            request.explicitlySelected = true;
            request.readOnly = true;
            request.highCapacity = identity.identity.highCapacity;
            request.capacityBytes = identity.identity.capacityBytes;
            request.lba = 0;
            request.blockCount = 1;
            request.ownedResources = ownedDuring;
            sector0Permit = leshy1::storage::authorizeSdSector0Read(request);
            if (sector0Permit == leshy1::storage::SdSectorReadStatus::Permitted) {
                sector0Read = transport.readSingleBlock(
                    0, &sector0, &sector0WireCrc16);
            }
            if (sector0Read) {
                sector0Inspection = leshy1::storage::inspectSdSector0(
                    sector0, identity.identity.capacityBytes);
                request.lba = sector0Inspection.firstPartitionLba;
                bootPermit = leshy1::storage::authorizeSdPartitionBootRead(
                    sector0Inspection, request);
                if (bootPermit == leshy1::storage::SdSectorReadStatus::Permitted) {
                    bootRead = transport.readSingleBlock(
                        request.lba, &bootSector, &bootWireCrc16);
                }
                if (bootRead) {
                    bootInspection = leshy1::storage::inspectSdFilesystemBoot(
                        bootSector, sector0Inspection.firstPartitionSectors);
                    status = bootInspection.geometryValid ? "valid" : "boot_invalid";
                } else {
                    status = "boot_read_failed";
                }
            } else {
                status = "sector0_read_failed";
            }
        } else {
            status = "identity_failed";
        }
        transport.end();
    } else if (!idleUi) {
        status = "ui_not_idle";
    } else if (resourcesAcquired) {
        status = "adapter_begin_failed";
    }
    resourceBroker.releaseAll(kSdIdentificationOwner);
    const std::uint32_t ownedAfter =
        resourceBroker.ownedBy(kSdIdentificationOwner);

    if (sector0Read && !leshy1::storage::formatSdSector0Json(
                           sector0Inspection, sector0Summary,
                           sizeof(sector0Summary))) {
        std::strcpy(sector0Summary, "{}");
        status = "format_failed";
    }
    if (bootRead && !leshy1::storage::formatSdFilesystemBootJson(
                        bootInspection, bootSummary, sizeof(bootSummary))) {
        std::strcpy(bootSummary, "{}");
        status = "format_failed";
    }
    for (std::size_t index = 0; index < identity.identity.cid.size(); ++index) {
        std::snprintf(cidHex + index * 2, sizeof(cidHex) - index * 2, "%02X",
                      static_cast<unsigned>(identity.identity.cid[index]));
    }
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.storage.sd.boot.v1\",\"kind\":\"result\","
        "\"status\":\"%s\",\"identity_status\":\"%s\","
        "\"sector0_permit\":\"%s\",\"boot_permit\":\"%s\","
        "\"wire_status\":\"%s\",\"explicitly_selected\":true,"
        "\"read_only\":true,\"blocks_requested\":2,\"blocks_read\":%u,"
        "\"sector0_lba\":0,\"boot_lba\":%lu,"
        "\"resource_acquired\":%s,\"owned_during\":%lu,\"owned_after\":%lu,"
        "\"spi_hz\":%lu,\"bytes_clocked\":%lu,"
        "\"identity_commands_completed\":%u,\"cid_hex\":\"%s\","
        "\"capacity_bytes\":%llu,\"sector0_wire_crc16\":%u,"
        "\"boot_wire_crc16\":%u,\"gpio21_stable_high\":%s,"
        "\"cleanup_complete\":%s,\"mount_attempted\":false,"
        "\"filesystem_touched\":false,\"raw_sectors_retained\":false,"
        "\"write_commands\":false,\"format_allowed\":false,"
        "\"nrf_ce_high_events\":0,\"radio_tx_commands\":0,"
        "\"sector0\":%s,\"boot\":%s}",
        status, leshy1::storage::sdTransportRunStatusName(identity.status),
        leshy1::storage::sdSectorReadStatusName(sector0Permit),
        leshy1::storage::sdSectorReadStatusName(bootPermit),
        leshy1::storage::sdWireStatusName(transport.lastWireStatus()),
        static_cast<unsigned>(transport.dataBlockReads()),
        static_cast<unsigned long>(sector0Inspection.firstPartitionLba),
        resourcesAcquired ? "true" : "false",
        static_cast<unsigned long>(ownedDuring),
        static_cast<unsigned long>(ownedAfter),
        static_cast<unsigned long>(BoardProfile::kSdIdentificationSpiHz),
        static_cast<unsigned long>(transport.bytesClocked()),
        static_cast<unsigned>(identity.commandsCompleted), cidHex,
        static_cast<unsigned long long>(identity.identity.capacityBytes),
        static_cast<unsigned>(sector0WireCrc16),
        static_cast<unsigned>(bootWireCrc16),
        transport.gpio21StableHigh() ? "true" : "false",
        transport.cleanupComplete() ? "true" : "false",
        sector0Summary, bootSummary);
    reply.println(line);
}

void emitPhysicalSdFsInfo(Stream& reply) {
    auto& line = sdPhysicalEvidence.line;
    auto& sector0Summary = sdPhysicalEvidence.summaryA;
    auto& bootSummary = sdPhysicalEvidence.summaryB;
    auto& fsInfoSummary = sdPhysicalEvidence.summaryC;
    auto& cidHex = sdPhysicalEvidence.cidHex;
    auto& sector0 = sdPhysicalEvidence.sectorA;
    auto& bootSector = sdPhysicalEvidence.sectorB;
    auto& fsInfoSector = sdPhysicalEvidence.sectorC;
    cidHex[0] = '\0';
    std::strcpy(sector0Summary, "{}");
    std::strcpy(bootSummary, "{}");
    std::strcpy(fsInfoSummary, "{}");
    sector0.fill(0);
    bootSector.fill(0);
    fsInfoSector.fill(0);

    const bool idleUi = uiController.isRoot() && !appRuntime.running();
    const bool resourcesAcquired = idleUi && resourceBroker.acquire(
        kSdIdentificationOwner, leshy1::storage::kSdIdentificationResources);
    const std::uint32_t ownedDuring =
        resourceBroker.ownedBy(kSdIdentificationOwner);
    BoardSdSpiTransport transport;
    const bool adapterBegun = resourcesAcquired && transport.begin();
    leshy1::storage::SdTransportRunResult identity;
    leshy1::storage::SdSectorReadStatus sector0Permit =
        leshy1::storage::SdSectorReadStatus::ExplicitTargetRequired;
    leshy1::storage::SdSectorReadStatus bootPermit =
        leshy1::storage::SdSectorReadStatus::ExplicitTargetRequired;
    leshy1::storage::SdSectorReadStatus fsInfoPermit =
        leshy1::storage::SdSectorReadStatus::ExplicitTargetRequired;
    leshy1::storage::SdSector0Inspection sector0Inspection;
    leshy1::storage::SdFilesystemBootInspection bootInspection;
    leshy1::storage::SdFat32FsInfoInspection fsInfoInspection;
    bool sector0Read = false;
    bool bootRead = false;
    bool fsInfoRead = false;
    bool fsInfoBufferZeroed = false;
    std::uint32_t fsInfoLba = 0;
    std::uint16_t sector0WireCrc16 = 0;
    std::uint16_t bootWireCrc16 = 0;
    std::uint16_t fsInfoWireCrc16 = 0;
    const char* status = "resource_unavailable";

    if (adapterBegun) {
        leshy1::storage::SdTransportRunPolicy identityPolicy;
        identityPolicy.allowPhysical = true;
        identityPolicy.explicitlySelected = true;
        identityPolicy.identificationOnly = true;
        identityPolicy.ownedResources = ownedDuring;
        identity = leshy1::storage::runSdIdentificationStateMachine(
            leshy1::storage::defaultSdIdentificationPlan(), transport,
            identityPolicy);
        if (identity.status == leshy1::storage::SdTransportRunStatus::Valid) {
            leshy1::storage::SdSectorReadRequest request;
            request.explicitlySelected = true;
            request.readOnly = true;
            request.highCapacity = identity.identity.highCapacity;
            request.capacityBytes = identity.identity.capacityBytes;
            request.lba = 0;
            request.blockCount = 1;
            request.ownedResources = ownedDuring;
            sector0Permit = leshy1::storage::authorizeSdSector0Read(request);
            if (sector0Permit == leshy1::storage::SdSectorReadStatus::Permitted) {
                sector0Read = transport.readSingleBlock(
                    0, &sector0, &sector0WireCrc16);
            }
            if (sector0Read) {
                sector0Inspection = leshy1::storage::inspectSdSector0(
                    sector0, identity.identity.capacityBytes);
                request.lba = sector0Inspection.firstPartitionLba;
                bootPermit = leshy1::storage::authorizeSdPartitionBootRead(
                    sector0Inspection, request);
                if (bootPermit == leshy1::storage::SdSectorReadStatus::Permitted) {
                    bootRead = transport.readSingleBlock(
                        request.lba, &bootSector, &bootWireCrc16);
                }
                if (bootRead) {
                    bootInspection = leshy1::storage::inspectSdFilesystemBoot(
                        bootSector, sector0Inspection.firstPartitionSectors);
                    if (leshy1::storage::calculateSdFat32FsInfoLba(
                            sector0Inspection, bootInspection, &fsInfoLba)) {
                        request.lba = fsInfoLba;
                        fsInfoPermit = leshy1::storage::authorizeSdFat32FsInfoRead(
                            sector0Inspection, bootInspection, request);
                        if (fsInfoPermit ==
                            leshy1::storage::SdSectorReadStatus::Permitted) {
                            fsInfoRead = transport.readSingleBlock(
                                request.lba, &fsInfoSector, &fsInfoWireCrc16);
                        }
                        if (fsInfoRead) {
                            fsInfoInspection =
                                leshy1::storage::inspectSdFat32FsInfo(
                                    fsInfoSector, bootInspection);
                            fsInfoSector.fill(0);
                            fsInfoBufferZeroed = true;
                            status = fsInfoInspection.hintsValid
                                ? "valid" : "fsinfo_invalid";
                        } else {
                            status = "fsinfo_read_failed";
                        }
                    } else {
                        status = "fsinfo_lba_invalid";
                    }
                } else {
                    status = "boot_read_failed";
                }
            } else {
                status = "sector0_read_failed";
            }
        } else {
            status = "identity_failed";
        }
        transport.end();
    } else if (!idleUi) {
        status = "ui_not_idle";
    } else if (resourcesAcquired) {
        status = "adapter_begin_failed";
    }
    fsInfoSector.fill(0);
    if (fsInfoRead) fsInfoBufferZeroed = true;
    resourceBroker.releaseAll(kSdIdentificationOwner);
    const std::uint32_t ownedAfter =
        resourceBroker.ownedBy(kSdIdentificationOwner);

