anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    char scratchPath[leshy1::storage::kScratchPathMax] = {};
    std::snprintf(scratchPath, sizeof(scratchPath), "%s%s",
                  leshy1::storage::kScratchRoot, runId);
    BoardSdFilesystem filesystem;
    const bool mountAttempted = fingerprintMatched;
    const bool mounted = fingerprintMatched && filesystem.begin();
    const std::uint64_t cardCapacity =
        mounted ? filesystem.cardCapacityBytes() : 0;
    const std::uint64_t filesystemCapacity =
        mounted ? filesystem.filesystemCapacityBytes() : 0;
    const std::uint64_t freeBytes = mounted ? filesystem.freeBytes() : 0;
    const std::uint32_t actualFilesystemSpiHz =
        mounted ? filesystem.realFrequencyHz() : 0;
    const bool capacityMatched = mounted &&
        cardCapacity == identity.identity.capacityBytes &&
        filesystemCapacity != 0 && filesystemCapacity <= cardCapacity;
    const bool scratchExists = mounted && filesystem.exists(scratchPath);

    leshy1::storage::MediaIdentity media;
    media.present = capacityMatched;
    media.kind = leshy1::storage::MediaKind::Sd;
    media.fingerprint = cidHex;
    media.capacityBytes = cardCapacity;
    media.freeBytes = freeBytes;
    leshy1::storage::ExistingScratchReadRequest request;
    request.explicitlySelected = true;
    request.expectedFingerprint = expectedFingerprint;
    request.runId = runId;
    request.scratchExists = scratchExists;
    const leshy1::storage::ReadPermit permit =
        leshy1::storage::authorizeExistingScratchRead(media, request);

    leshy1::storage::SessionStoreRecoveryResult recovery;
    StoredGenerationEvidence priorEvidence;
    bool openedReadOnly = false;
    bool priorUnchanged = false;
    std::uint64_t bytesWritten = 0;
    std::uint32_t fileSyncs = 0;
    std::uint32_t directorySyncs = 0;
    const char* ioFailure = "not_started";
    unsigned ioFresult = 0;
    const char* ioFresultName = "not_started";
    if (permit.allowed()) {
        ArduinoFsSessionStoreIo io(filesystem.driveNumber(),
                                   sdSessionStoreIoWorkspace);
        openedReadOnly = io.openExistingReadOnly(permit);
        if (openedReadOnly) {
            priorUnchanged = inspectStoredGeneration(
                io, sessionStoreWorkspace(), littleFsResetSession, 1,
                &priorEvidence);
            recovery = leshy1::storage::recoverSession(
                io, sessionStoreWorkspace(),
                &sessionStoreWorkspace().validationSession);
        }
        bytesWritten = io.bytesWritten();
        fileSyncs = io.fileSyncs();
        directorySyncs = io.directorySyncs();
        ioFailure = io.lastFailure();
        ioFresult = io.lastFresult();
        ioFresultName = io.lastFresultName();
        io.end();
    }

    if (mountAttempted) filesystem.end();
    resourceBroker.releaseAll(kSdIdentificationOwner);
    const std::uint32_t ownedAfter =
        resourceBroker.ownedBy(kSdIdentificationOwner);
    const bool cleanupComplete = identityCleanup &&
        (!mountAttempted || filesystem.cleanupComplete()) && ownedAfter == 0;
    const bool generationAllowed = recovery.valid() &&
        resetRecoveredGenerationAllowed(boundaryNumber, recovery.generation);
    const bool valid = leshy1::storage::isSessionStoreBoundary(boundary) &&
        expectedReset && fixtureReady && identityAdapterBegun &&
        fingerprintMatched && mounted &&
        capacityMatched && permit.allowed() && openedReadOnly &&
        generationAllowed && recovery.observations == 3 && priorUnchanged &&
        bytesWritten == 0 && fileSyncs == 0 && directorySyncs == 0 &&
        cleanupComplete;

    std::snprintf(
        line, sizeof(sdPhysicalEvidence.line),
        "{\"schema\":\"leshy.storage.sd.session_store_reset.v1\","
        "\"kind\":\"result\",\"mode\":\"recovery\","
        "\"status\":\"%s\",\"run_id\":\"%s\",\"boundary\":%u,"
        "\"boundary_name\":\"%s\",\"expected_recovery\":\"%s\","
        "\"reset_reason_code\":%u,\"software_reset\":%s,"
        "\"power_on_reset\":%s,"
        "\"identity_status\":\"%s\",\"cid_hex\":\"%s\","
        "\"fingerprint_matched\":%s,\"read_permit_status\":\"%s\","
        "\"scratch_path\":\"%s\",\"scratch_exists\":%s,"
        "\"opened_read_only\":%s,\"session_store_io_writable\":false,"
        "\"recovery_status\":\"%s\",\"recovered_generation\":%lu,"
        "\"generation_allowed\":%s,\"reopened_observations\":%u,"
        "\"a_status\":%u,\"b_status\":%u,\"prior_unchanged\":%s,"
        "\"prior_segment_bytes\":%u,\"prior_segment_crc32c\":%lu,"
        "\"prior_manifest_bytes\":%u,\"prior_manifest_crc32c\":%lu,"
        "\"bytes_written\":%llu,\"file_syncs\":%lu,"
        "\"directory_syncs\":%lu,\"io_failure\":\"%s\","
        "\"io_fresult\":%u,\"io_fresult_name\":\"%s\","
        "\"filesystem_driver\":\"esp_idf_sdspi\","
        "\"filesystem_spi_hz\":%lu,\"card_capacity_bytes\":%llu,"
        "\"filesystem_capacity_bytes\":%llu,\"mounted\":%s,"
        "\"owned_during\":%lu,\"owned_after\":%lu,"
        "\"cleanup_complete\":%s,\"mount_on_boot\":false,"
        "\"format_allowed\":false,\"existing_paths_deleted\":false,"
        "\"user_file_names_listed\":false,\"user_file_data_read\":false,"
        "\"reset_injection\":%s,\"physical_power_cut\":%s,"
        "\"radio_tx_commands\":0}",
        valid ? "valid" : "failed", runId, boundaryNumber,
        leshy1::storage::sessionStoreBoundaryName(boundary),
        resetExpectedRecovery(boundaryNumber),
        static_cast<unsigned>(resetReason), softwareReset ? "true" : "false",
        powerOnReset ? "true" : "false",
        leshy1::storage::sdTransportRunStatusName(identity.status), cidHex,
        fingerprintMatched ? "true" : "false",
        leshy1::storage::readPermitStatusName(permit.status),
        permit.allowed() ? permit.scratchPath : scratchPath,
        scratchExists ? "true" : "false", openedReadOnly ? "true" : "false",
        leshy1::storage::sessionStoreStatusName(recovery.status),
        static_cast<unsigned long>(recovery.generation),
        generationAllowed ? "true" : "false",
        static_cast<unsigned>(recovery.observations),
        static_cast<unsigned>(recovery.aStatus),
        static_cast<unsigned>(recovery.bStatus),
        priorUnchanged ? "true" : "false",
        static_cast<unsigned>(priorEvidence.observedSegmentSize),
        static_cast<unsigned long>(priorEvidence.observedSegmentCrc),
        static_cast<unsigned>(priorEvidence.observedManifestSize),
        static_cast<unsigned long>(priorEvidence.observedManifestCrc),
        static_cast<unsigned long long>(bytesWritten),
        static_cast<unsigned long>(fileSyncs),
        static_cast<unsigned long>(directorySyncs), ioFailure, ioFresult,
        ioFresultName, static_cast<unsigned long>(actualFilesystemSpiHz),
        static_cast<unsigned long long>(cardCapacity),
        static_cast<unsigned long long>(filesystemCapacity),
        mounted ? "true" : "false", static_cast<unsigned long>(ownedDuring),
        static_cast<unsigned long>(ownedAfter),
        cleanupComplete ? "true" : "false",
        physicalPowerCut ? "false" : "true",
        physicalPowerCut ? "true" : "false");
    reply.println(line);
}

struct WifiQueueSinkContext final {
    leshy1::services::survey::ObservationQueue* queue = nullptr;
    std::uint64_t oldestObservationUs = 0;
};

WifiRecordDisposition collectWifiQueueRecord(
    const WifiScanRecord& record, std::uint64_t monotonicUs,
    void* rawContext) {
    auto* context = static_cast<WifiQueueSinkContext*>(rawContext);
    if (context == nullptr || context->queue == nullptr) {
        return WifiRecordDisposition::Rejected;
    }
    Observation observation;
    if (!leshy1::drivers::wifi::normalizePassiveRecord(
            record, monotonicUs, &observation)) {
        return WifiRecordDisposition::Rejected;
    }
    if (!context->queue->push(observation)) {
        return WifiRecordDisposition::Dropped;
    }
    if (context->oldestObservationUs == 0 ||
        monotonicUs < context->oldestObservationUs) {
        context->oldestObservationUs = monotonicUs;
    }
    return WifiRecordDisposition::Accepted;
}

void emitProductStoreBootstrap(Stream& reply,
                               const char* expectedFingerprint) {
    const auto supervisedCheckpoint = []() {
        feedRuntimeSafetyWatchdog();
        return !safetySupervisor.latched();
    };
    supervisedCheckpoint();
    auto& line = sdPhysicalEvidence.line;
    auto& cidHex = sdPhysicalEvidence.cidHex;
    cidHex[0] = '\0';
    const bool idleUi = uiController.isRoot() && !appRuntime.running();
    const leshy1::kernel::runtime::ResourceMask requestedResources =
        leshy1::storage::kSdIdentificationResources |
        leshy1::kernel::runtime::resourceMask(Resource::EspRf);
    const bool resourcesAcquired = idleUi && resourceBroker.acquire(
        kSdIdentificationOwner, requestedResources);
    const std::uint32_t ownedDuring =
        resourceBroker.ownedBy(kSdIdentificationOwner);

    BoardSdSpiTransport identityTransport;
    const bool identityBegun = resourcesAcquired && identityTransport.begin();
    leshy1::storage::SdTransportRunResult identity;
    if (identityBegun) {
        leshy1::storage::SdTransportRunPolicy policy;
        policy.allowPhysical = true;
        policy.explicitlySelected = true;
        policy.identificationOnly = true;
        policy.ownedResources = ownedDuring;
        identity = leshy1::storage::runSdIdentificationStateMachine(
            leshy1::storage::defaultSdIdentificationPlan(), identityTransport,
            policy);
        identityTransport.end();
    }
    supervisedCheckpoint();
    const bool identityCleanup = identityTransport.cleanupComplete();
    formatCidFingerprint(identity.identity, cidHex,
                         sizeof(sdPhysicalEvidence.cidHex));
    const bool fingerprintMatched =
        identity.status == leshy1::storage::SdTransportRunStatus::Valid &&
        std::strcmp(cidHex, expectedFingerprint) == 0;

    BoardSdFilesystem filesystem;
    const bool mounted = fingerprintMatched && filesystem.begin();
    supervisedCheckpoint();
    const std::uint64_t cardCapacity =
        mounted ? filesystem.cardCapacityBytes() : 0;
    const std::uint64_t filesystemCapacity =
        mounted ? filesystem.filesystemCapacityBytes() : 0;
    const std::uint64_t freeBefore = mounted ? filesystem.freeBytes() : 0;
    const bool capacityMatched = mounted &&
        cardCapacity == identity.identity.capacityBytes &&
        filesystemCapacity != 0 && filesystemCapacity <= cardCapacity;
    const bool rootExisted = mounted && filesystem.exists(
        leshy1::storage::kProductSessionStoreRoot);

    leshy1::storage::MediaIdentity media;
    media.present = capacityMatched;
    media.kind = leshy1::storage::MediaKind::Sd;
    media.fingerprint = cidHex;
    media.capacityBytes = cardCapacity;
    media.freeBytes = freeBefore;
    leshy1::storage::ProductStoreRequest request;
    request.operation = rootExisted
        ? leshy1::storage::ProductStoreOperation::CommitSession
        : leshy1::storage::ProductStoreOperation::InitializeStore;
    request.explicitlySelected = true;
    request.expectedFingerprint = expectedFingerprint;
    request.rootPath = leshy1::storage::kProductSessionStoreRoot;
    request.rootExists = rootExisted;
    request.driverWriteEnabled = true;
    request.requiredBytes = 64U * 1024U;
    request.reserveBytes = 1024U * 1024U;
    request.ownedResources = ownedDuring;
    request.power = powerSafetyPolicy.writeDisposition();
    const leshy1::storage::ProductStorePermit permit =
        leshy1::storage::authorizeProductStore(media, request);

    ArduinoFsSessionStoreIo io(filesystem.driveNumber(),
                               sdSessionStoreIoWorkspace,
                               supervisedCheckpoint,
                               &protectedDataCipher, &deviceLock);
    const bool opened = permit.allowed() &&
        (rootExisted ? io.openExistingWritable(permit) : io.prepare(permit));
    const bool rootCreated = !rootExisted && opened && filesystem.exists(
        leshy1::storage::kProductSessionStoreRoot);

