anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    BoardWifiPassiveScanner scanner;
    const leshy1::drivers::wifi::WifiScanPlan wifiPlan =
        leshy1::drivers::wifi::defaultPassivePlan();
    std::uint64_t startedUs = static_cast<std::uint64_t>(esp_timer_get_time());
    if (startedUs == 0) startedUs = 1;
    surveyIngressQueue.reset();
    surveySession.reset();
    const bool scannerBegun = opened &&
        leshy1::drivers::wifi::validatePassivePlan(wifiPlan) &&
        surveySession.start("product-wifi-boot", startedUs) ==
            SessionStatus::Started && scanner.begin();
    WifiQueueSinkContext sink{&surveyIngressQueue, 0};
    BoardWifiPassiveScanResult scan;
    supervisedCheckpoint();
    if (scannerBegun) {
        scan = scanner.scan(wifiPlan, collectWifiQueueRecord, &sink);
    }
    supervisedCheckpoint();
    Observation observation;
    std::uint32_t appendDropped = 0;
    while (surveyIngressQueue.pop(&observation)) {
        if (surveySession.append(observation) != SessionStatus::Appended) {
            ++appendDropped;
        }
    }
    std::uint64_t stoppedUs = static_cast<std::uint64_t>(esp_timer_get_time());
    if (stoppedUs < startedUs) stoppedUs = startedUs;
    const bool stopped = scan.valid() && scan.accepted != 0 &&
        scan.dropped == 0 && appendDropped == 0 &&
        surveySession.stop(stoppedUs) == SessionStatus::Stopped;
    const bool scannerCleanup = scanner.end() && scanner.cleanupComplete();
    supervisedCheckpoint();
    const std::uint32_t queueHighWater = surveyIngressQueue.highWater();
    const std::uint32_t queueDropped = surveyIngressQueue.dropped();
    surveyIngressQueue.reset();

    leshy1::storage::SessionStoreCommitResult commit;
    leshy1::apps::library::SessionCatalogResult cataloged;
    leshy1::platform::arduino::ProtectedFileInspection protectedInspection;
    bool protectedFileInspected = false;
    if (stopped && scannerCleanup && queueDropped == 0) {
        commit = leshy1::storage::commitNextSession(
            io, sessionStoreWorkspace(), surveySession);
        if (commit.complete()) {
            supervisedCheckpoint();
            cataloged = sessionCatalog.recoverLatest(
                io, sessionStoreWorkspace(), librarySession, libraryController,
                true, false);
            char segmentPath[leshy1::storage::kSessionStorePathMax] = {};
            protectedFileInspected =
                leshy1::storage::formatSessionStorePath(
                    leshy1::storage::StoreFileKind::Segment,
                    commit.generation, segmentPath, sizeof(segmentPath)) &&
                io.inspectProtectedFile(
                    segmentPath, sessionStoreWorkspace().segment.data(),
                    sessionStoreWorkspace().segmentSize,
                    &protectedInspection);
            supervisedCheckpoint();
        }
    }
    const std::uint64_t bytesWritten = io.bytesWritten();
    const std::uint32_t fileSyncs = io.fileSyncs();
    const std::uint32_t directorySyncs = io.directorySyncs();
    const char* ioFailure = io.lastFailure();
    const char* ioResult = io.lastFresultName();
    io.end();
    supervisedCheckpoint();
    if (fingerprintMatched) filesystem.end();
    supervisedCheckpoint();
    const bool filesystemCleanup =
        !fingerprintMatched || filesystem.cleanupComplete();
    resourceBroker.releaseAll(kSdIdentificationOwner);
    const std::uint32_t ownedAfter =
        resourceBroker.ownedBy(kSdIdentificationOwner);
    const bool enrollmentSaved = cataloged.admitted() &&
        saveProductFingerprint(expectedFingerprint);
    const bool valid = idleUi && resourcesAcquired && identityBegun &&
        identityCleanup && fingerprintMatched && mounted && capacityMatched &&
        permit.allowed() && opened && (rootExisted || rootCreated) &&
        scannerBegun && stopped && scannerCleanup && queueDropped == 0 &&
        appendDropped == 0 && commit.complete() && cataloged.admitted() &&
        protectedFileInspected &&
        bytesWritten != 0 && fileSyncs != 0 && directorySyncs != 0 &&
        filesystemCleanup && ownedAfter == 0 && enrollmentSaved;

    surveyDemoReady = prepareSurveyDemo();
    if (valid) {
        libraryDemoReady = true;
        const CapabilityRecord* persistentCapability =
            inventory.find("library.persistent_session");
        if (persistentCapability == nullptr) {
            inventory.add({"library.persistent_session",
                           CapabilityState::Available,
                           "explicit_product_bootstrap",
                           "validated_session_open"});
        }
        appCatalog.rebuild(inventory, targetsMergeFixtureContinuityValid());
        renderInteractiveScreen();
    }

    std::snprintf(
        line, sizeof(sdPhysicalEvidence.line),
        "{\"schema\":\"leshy.storage.product_bootstrap.v2\","
        "\"kind\":\"result\",\"status\":\"%s\","
        "\"expected_fingerprint\":\"%s\",\"cid_hex\":\"%s\","
        "\"fingerprint_matched\":%s,\"mounted_writable\":%s,"
        "\"explicitly_selected\":true,\"format_allowed\":false,"
        "\"product_root\":\"%s\",\"root_existed\":%s,"
        "\"root_created\":%s,\"operation\":\"%s\","
        "\"permit_status\":\"%s\",\"opened\":%s,"
        "\"wifi_scan_status\":\"%s\",\"wifi_records\":%u,"
        "\"observations\":%u,\"queue_high_water\":%lu,"
        "\"queue_drops\":%lu,\"append_drops\":%lu,"
        "\"commit_status\":\"%s\",\"generation\":%lu,"
        "\"catalog_status\":\"%s\",\"catalog_admitted\":%s,"
        "\"encrypted_namespace\":%s,\"envelope_header_valid\":%s,"
        "\"physical_size_exact\":%s,\"ciphertext_differs\":%s,"
        "\"protected_plaintext_bytes\":%lu,"
        "\"protected_physical_bytes\":%llu,"
        "\"bytes_written\":%llu,\"file_syncs\":%lu,"
        "\"directory_syncs\":%lu,\"io_failure\":\"%s\","
        "\"io_result\":\"%s\",\"enrollment_saved\":%s,"
        "\"owned_during\":%lu,\"owned_after\":%lu,"
        "\"identity_cleanup\":%s,\"scanner_cleanup\":%s,"
        "\"filesystem_cleanup\":%s,\"radio_connect_calls\":0,"
        "\"application_raw_tx_calls\":0}",
        valid ? "valid" : "failed", expectedFingerprint, cidHex,
        fingerprintMatched ? "true" : "false", mounted ? "true" : "false",
        leshy1::storage::kProductSessionStoreRoot,
        rootExisted ? "true" : "false", rootCreated ? "true" : "false",
        leshy1::storage::productStoreOperationName(request.operation),
        leshy1::storage::productStoreAccessStatusName(permit.status),
        opened ? "true" : "false",
        leshy1::platform::arduino::boardWifiScanStatusName(scan.status),
        static_cast<unsigned>(scan.recordsRead),
        static_cast<unsigned>(cataloged.observations),
        static_cast<unsigned long>(queueHighWater),
        static_cast<unsigned long>(queueDropped),
        static_cast<unsigned long>(appendDropped),
        leshy1::storage::sessionStoreStatusName(commit.status),
        static_cast<unsigned long>(commit.generation),
        leshy1::apps::library::sessionCatalogStatusName(cataloged.status),
        cataloged.admitted() ? "true" : "false",
        protectedInspection.encryptedNamespace ? "true" : "false",
        protectedInspection.headerValid ? "true" : "false",
        protectedInspection.physicalSizeExact ? "true" : "false",
        protectedInspection.ciphertextDiffers ? "true" : "false",
        static_cast<unsigned long>(protectedInspection.plaintextSize),
        static_cast<unsigned long long>(protectedInspection.physicalSize),
        static_cast<unsigned long long>(bytesWritten),
        static_cast<unsigned long>(fileSyncs),
        static_cast<unsigned long>(directorySyncs), ioFailure, ioResult,
        enrollmentSaved ? "true" : "false",
        static_cast<unsigned long>(ownedDuring),
        static_cast<unsigned long>(ownedAfter),
        identityCleanup ? "true" : "false",
        scannerCleanup ? "true" : "false",
        filesystemCleanup ? "true" : "false");
    reply.println(line);
}

void emitPhysicalSdSessionStore(Stream& reply, const char* expectedFingerprint,
                                const char* runId, bool throughput,
                                bool batchThroughput, bool realWifiPipeline,
                                unsigned maximumWifiScans) {
    auto& line = sdPhysicalEvidence.line;
    auto& cidHex = sdPhysicalEvidence.cidHex;
    auto& commitUs = sdPhysicalEvidence.commitUs;
    commitUs.fill(0);
    cidHex[0] = '\0';
    std::size_t fixtureSegmentBytes = 0;
    const bool batchFixtureReady =
        !batchThroughput ||
        prepareBatchThroughputSession(&fixtureSegmentBytes);
    std::size_t fixtureObservations = librarySession.size();
    const bool idleUi = uiController.isRoot() && !appRuntime.running();
    const leshy1::kernel::runtime::ResourceMask requestedResources =
        leshy1::storage::kSdIdentificationResources |
        (realWifiPipeline
             ? leshy1::kernel::runtime::resourceMask(Resource::EspRf)
             : 0U);
    const bool resourcesAcquired = batchFixtureReady && idleUi &&
        resourceBroker.acquire(
            kSdIdentificationOwner, requestedResources);
    const std::uint32_t ownedDuring =
        resourceBroker.ownedBy(kSdIdentificationOwner);
    const char* status = "resource_unavailable";

    BoardSdSpiTransport identityTransport;
    const bool identityAdapterBegun = resourcesAcquired && identityTransport.begin();
    leshy1::storage::SdTransportRunResult identity;
    if (identityAdapterBegun) {
        leshy1::storage::SdTransportRunPolicy identityPolicy;
        identityPolicy.allowPhysical = true;
        identityPolicy.explicitlySelected = true;
        identityPolicy.identificationOnly = true;
        identityPolicy.ownedResources = ownedDuring;
        identity = leshy1::storage::runSdIdentificationStateMachine(
            leshy1::storage::defaultSdIdentificationPlan(), identityTransport,
            identityPolicy);
        identityTransport.end();
    }
    const bool identityCleanup = identityTransport.cleanupComplete();
    for (std::size_t index = 0; index < identity.identity.cid.size(); ++index) {
        std::snprintf(cidHex + index * 2, sizeof(cidHex) - index * 2, "%02X",
                      static_cast<unsigned>(identity.identity.cid[index]));
    }
    const bool fingerprintMatched =
        identity.status == leshy1::storage::SdTransportRunStatus::Valid &&
        std::strcmp(cidHex, expectedFingerprint) == 0;

