anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    char scratchPath[leshy1::storage::kScratchPathMax] = {};
    std::snprintf(scratchPath, sizeof(scratchPath), "%s%s",
                  leshy1::storage::kScratchRoot, runId);
    BoardSdFilesystem primaryFilesystem;
    const std::uint64_t mountStartedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    const bool primaryMountAttempted = fingerprintMatched;
    const bool mounted = fingerprintMatched && primaryFilesystem.begin();
    const int filesystemMountError = primaryFilesystem.mountError();
    const std::uint32_t actualFilesystemSpiHz =
        primaryFilesystem.realFrequencyHz();
    const std::uint64_t mountUs = mounted
        ? static_cast<std::uint64_t>(esp_timer_get_time()) - mountStartedUs : 0;
    const std::uint64_t cardCapacity =
        mounted ? primaryFilesystem.cardCapacityBytes() : 0;
    const std::uint64_t filesystemCapacity =
        mounted ? primaryFilesystem.filesystemCapacityBytes() : 0;
    const std::uint64_t freeBefore =
        mounted ? primaryFilesystem.freeBytes() : 0;
    const bool capacityMatched = mounted &&
        cardCapacity == identity.identity.capacityBytes &&
        filesystemCapacity != 0 && filesystemCapacity <= cardCapacity;
    const bool scratchPreexisting =
        mounted && primaryFilesystem.exists(scratchPath);

    leshy1::storage::MediaIdentity media;
    media.present = capacityMatched;
    media.kind = leshy1::storage::MediaKind::Sd;
    media.fingerprint = cidHex;
    media.capacityBytes = cardCapacity;
    media.freeBytes = freeBefore;
    leshy1::storage::WriteRequest request;
    request.explicitlyDisposable = true;
    request.expectedFingerprint = expectedFingerprint;
    request.runId = runId;
    request.scratchExists = scratchPreexisting;
    // Thirty-two immutable generations can consume one FAT allocation cluster
    // per small file. Bound the physical experiment to 4 MiB even though its
    // logical payload is much smaller; the normal two-commit probe stays 64 KiB.
    request.requiredBytes = throughput ? 4U * 1024U * 1024U : 64U * 1024U;
    request.reserveBytes = 1024U * 1024U;
    const leshy1::storage::WritePermit permit =
        leshy1::storage::authorizeScratchWrite(media, request);

    leshy1::storage::SessionStoreCommitResult commitOne;
    leshy1::storage::SessionStoreCommitResult commitTwo;
    leshy1::storage::SessionStoreRecoveryResult recoveryBeforeRemount;
    leshy1::storage::SessionStoreRecoveryResult recoveryAfterRemount;
    std::uint64_t commitOneUs = 0;
    std::uint64_t commitTwoUs = 0;
    std::size_t commitsRequested = throughput ? kSdThroughputSamples : 2U;
    std::size_t commitsCompleted = 0;
    std::uint64_t bytesWritten = 0;
    std::uint32_t fileSyncs = 0;
    std::uint32_t directorySyncs = 0;
    const char* ioFailure = "not_started";
    int ioErrno = 0;
    unsigned ioFresult = 0;
    const char* ioFresultName = "not_started";
    bool prepared = false;
    bool fatFileSyncCoversDirectory = false;
    bool scratchCreated = false;
    bool remounted = false;
    bool reopenedReadOnly = false;
    bool primaryCleanup = false;
    bool remountCleanup = false;
    bool wifiScannerBegun = false;
    bool wifiScannerCleanup = !realWifiPipeline;
    unsigned wifiScansCompleted = 0;
    std::uint64_t wifiRecordsRead = 0;
    std::uint64_t wifiRecordsAccepted = 0;
    std::uint64_t wifiRecordsRejected = 0;
    std::uint64_t wifiRecordsDropped = 0;
    std::size_t queueHighWater = 0;
    std::uint64_t queuePushed = 0;
    std::uint64_t queuePopped = 0;
    std::uint64_t queueDropped = 0;
    std::uint64_t sessionAppendDropped = 0;
    leshy1::services::survey::SessionBatchTrigger pipelineTrigger =
        leshy1::services::survey::SessionBatchTrigger::None;
    const char* pipelineStopReason = realWifiPipeline ? "not_started"
                                                      : "not_applicable";
    std::uint64_t freeAfter = freeBefore;
    const std::uint32_t heapFreeBefore = ESP.getFreeHeap();

    if (!batchFixtureReady) {
        status = "batch_fixture_prepare_failed";
    } else if (!idleUi) {
        status = "ui_not_idle";
    } else if (!resourcesAcquired) {
        status = "resources_unavailable";
    } else if (!identityAdapterBegun) {
        status = "identity_adapter_begin_failed";
    } else if (identity.status != leshy1::storage::SdTransportRunStatus::Valid) {
        status = "identity_failed";
    } else if (!fingerprintMatched) {
        status = "fingerprint_mismatch";
    } else if (!mounted) {
        status = "mount_failed";
    } else if (!capacityMatched) {
        status = "capacity_mismatch";
    } else if (!permit.allowed()) {
        status = "permit_rejected";
    } else {
        ArduinoFsSessionStoreIo io(primaryFilesystem.driveNumber(),
                                   sdSessionStoreIoWorkspace);
        prepared = io.prepare(permit);
        scratchCreated = prepared && primaryFilesystem.exists(permit.scratchPath);
        if (!prepared || !scratchCreated) {
            status = "scratch_prepare_failed";
        } else if (realWifiPipeline) {
            commitsRequested = 1;
            surveyIngressQueue.reset();
            librarySession.reset();
            std::uint64_t sessionStartedUs =
                static_cast<std::uint64_t>(esp_timer_get_time());
            if (sessionStartedUs == 0) sessionStartedUs = 1;
            const leshy1::drivers::wifi::WifiScanPlan wifiPlan =
                leshy1::drivers::wifi::defaultPassivePlan();
            BoardSdSpiTransport::holdRadioTransmitPathsInactive();
            BoardWifiPassiveScanner scanner;
            wifiScannerBegun =
                leshy1::drivers::wifi::validatePassivePlan(wifiPlan) &&
                librarySession.start("wifi-persist-e2e", sessionStartedUs) ==
                    SessionStatus::Started &&
                scanner.begin();
            bool pipelineCommitted = false;
            status = wifiScannerBegun ? "pipeline_running"
                                      : "wifi_scanner_begin_failed";
            WifiQueueSinkContext sink{&surveyIngressQueue, 0};
            const leshy1::services::survey::SessionBatchPolicy batchPolicy;
            for (unsigned sample = 0;
                 wifiScannerBegun && sample < maximumWifiScans; ++sample) {
                const BoardWifiPassiveScanResult scan =
                    scanner.scan(wifiPlan, collectWifiQueueRecord, &sink);
                if (!scan.valid()) {
                    status = "wifi_scan_failed";
                    break;
                }
                ++wifiScansCompleted;
                wifiRecordsRead += scan.recordsRead;
                wifiRecordsAccepted += scan.accepted;
                wifiRecordsRejected += scan.rejected;
                wifiRecordsDropped += scan.dropped;

                Observation observation;
                while (surveyIngressQueue.pop(&observation)) {
                    const SessionStatus appended =
                        librarySession.append(observation);
                    if (appended != SessionStatus::Appended) {
                        ++sessionAppendDropped;
                    }
                    observation = Observation{};
                }

                std::uint64_t nowUs =
                    static_cast<std::uint64_t>(esp_timer_get_time());
                if (nowUs < sessionStartedUs) nowUs = sessionStartedUs;
                surveySession = librarySession;
                if (surveySession.stop(nowUs) != SessionStatus::Stopped) {
                    status = "pipeline_snapshot_stop_failed";
                    break;
                }
                std::size_t segmentBytes = 0;
                if (leshy1::storage::encodeObservationSegment(
                        surveySession, sessionStoreWorkspace().segment.data(),
                        sessionStoreWorkspace().segment.size(), &segmentBytes) !=
                    leshy1::storage::SessionCodecStatus::Valid) {
                    status = "pipeline_snapshot_encode_failed";
                    break;
                }
                const bool scanBudgetReached =
                    wifiScansCompleted >= maximumWifiScans;
                pipelineTrigger =
                    leshy1::services::survey::sessionBatchTrigger(
                        batchPolicy, librarySession.size(), segmentBytes,
                        sink.oldestObservationUs, nowUs, scanBudgetReached,
                        false);
                if (pipelineTrigger ==
                    leshy1::services::survey::SessionBatchTrigger::None) {
                    continue;
                }

                pipelineStopReason =
                    leshy1::services::survey::sessionBatchTriggerName(
                        pipelineTrigger);
                fixtureSegmentBytes = segmentBytes;
                fixtureObservations = surveySession.size();
                librarySession.stop(nowUs);
                const std::uint64_t commitStarted =
                    static_cast<std::uint64_t>(esp_timer_get_time());
                commitOne = leshy1::storage::commitNextSession(
                    io, sessionStoreWorkspace(), surveySession);
                commitOneUs =
                    static_cast<std::uint64_t>(esp_timer_get_time()) -
                    commitStarted;
                commitUs[0] = commitOneUs;
                if (!commitOne.complete()) {
                    status = "pipeline_commit_failed";
                    break;
                }
                commitsCompleted = 1;
                pipelineCommitted = true;
                status = "pipeline_committed";
                break;
            }
            const bool scannerEnded = scanner.end();
            wifiScannerCleanup = scannerEnded && scanner.cleanupComplete();
            queueHighWater = surveyIngressQueue.highWater();
            queuePushed = surveyIngressQueue.pushed();
            queuePopped = surveyIngressQueue.popped();
            queueDropped = surveyIngressQueue.dropped();
            surveyIngressQueue.reset();

            if (pipelineCommitted && wifiScannerCleanup &&
                wifiRecordsDropped == 0 && queueDropped == 0 &&
                sessionAppendDropped == 0 && fixtureObservations != 0) {
                recoveryBeforeRemount = leshy1::storage::recoverSession(
                    io, sessionStoreWorkspace(),
                    &sessionStoreWorkspace().validationSession);
                status = recoveryBeforeRemount.valid() &&
                                 recoveryBeforeRemount.generation == 1 &&
                                 recoveryBeforeRemount.observations ==
                                     fixtureObservations
                    ? "awaiting_remount"
                    : "pre_remount_recovery_failed";
            } else if (pipelineCommitted && !wifiScannerCleanup) {
                status = "wifi_scanner_cleanup_failed";
            } else if (pipelineCommitted &&
                       (wifiRecordsDropped != 0 || queueDropped != 0 ||
                        sessionAppendDropped != 0)) {
                status = "pipeline_observation_drop";
            } else if (wifiScannerBegun &&
                       std::strcmp(status, "pipeline_running") == 0) {
                status = "pipeline_trigger_missing";
            }
        } else {
            const std::uint64_t commitOneStarted =
                static_cast<std::uint64_t>(esp_timer_get_time());
            commitOne = leshy1::storage::commitNextSession(
                io, sessionStoreWorkspace(), librarySession);
            commitOneUs = static_cast<std::uint64_t>(esp_timer_get_time()) -
                          commitOneStarted;
            commitUs[0] = commitOneUs;
            if (!commitOne.complete()) {
                status = "commit_one_failed";
            } else {
                commitsCompleted = 1;
                const std::uint64_t commitTwoStarted =
                    static_cast<std::uint64_t>(esp_timer_get_time());
                commitTwo = leshy1::storage::commitNextSession(
                    io, sessionStoreWorkspace(), librarySession);
                commitTwoUs = static_cast<std::uint64_t>(esp_timer_get_time()) -
                              commitTwoStarted;
                commitUs[1] = commitTwoUs;
                if (!commitTwo.complete()) {
                    status = "commit_two_failed";
                } else {
                    commitsCompleted = 2;
                    while (commitsCompleted < commitsRequested) {
                        const std::uint64_t commitStarted =
                            static_cast<std::uint64_t>(esp_timer_get_time());
                        const leshy1::storage::SessionStoreCommitResult next =
                            leshy1::storage::commitNextSession(
                                io, sessionStoreWorkspace(), librarySession);
                        commitUs[commitsCompleted] =
                            static_cast<std::uint64_t>(esp_timer_get_time()) -
                            commitStarted;
                        if (!next.complete()) {
                            status = "throughput_commit_failed";
                            break;
                        }
                        ++commitsCompleted;
                    }
                    if (commitsCompleted == commitsRequested) {
                        recoveryBeforeRemount = leshy1::storage::recoverSession(
                            io, sessionStoreWorkspace(),
                            &sessionStoreWorkspace().validationSession);
                        status = recoveryBeforeRemount.valid() &&
                                         recoveryBeforeRemount.generation ==
                                             commitsRequested
                            ? "awaiting_remount" : "pre_remount_recovery_failed";
                    }
                }
            }
        }
        bytesWritten = io.bytesWritten();
        fileSyncs = io.fileSyncs();
        directorySyncs = io.directorySyncs();
        fatFileSyncCoversDirectory = io.fatFileSyncCoversDirectory();
        ioFailure = io.lastFailure();
        ioErrno = io.lastErrno();
        ioFresult = io.lastFresult();
        ioFresultName = io.lastFresultName();
        io.end();
        freeAfter = primaryFilesystem.freeBytes();
    }
    if (primaryMountAttempted) {
        primaryFilesystem.end();
        primaryCleanup = primaryFilesystem.cleanupComplete();
    }

    if (std::strcmp(status, "awaiting_remount") == 0) {
        BoardSdFilesystem remountFilesystem;
        remounted = remountFilesystem.begin();
        if (remounted &&
            remountFilesystem.cardCapacityBytes() == cardCapacity &&
            remountFilesystem.exists(permit.scratchPath)) {
            ArduinoFsSessionStoreIo readOnlyIo(remountFilesystem.driveNumber(),
                                               sdSessionStoreIoWorkspace);
            reopenedReadOnly = readOnlyIo.openExistingReadOnly(permit);
            if (reopenedReadOnly) {
                recoveryAfterRemount = leshy1::storage::recoverSession(
                    readOnlyIo, sessionStoreWorkspace(),
                    &sessionStoreWorkspace().validationSession);
            }
            readOnlyIo.end();
        }
        remountFilesystem.end();
        remountCleanup = remountFilesystem.cleanupComplete();
        status = recoveryAfterRemount.valid() &&
                         recoveryAfterRemount.generation == commitsRequested &&
                         recoveryAfterRemount.observations ==
                             fixtureObservations
                     ? "valid" : "post_remount_recovery_failed";
    }

