anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    resourceBroker.releaseAll(kSdIdentificationOwner);
    const std::uint32_t ownedAfter =
        resourceBroker.ownedBy(kSdIdentificationOwner);
    const bool cleanupComplete = identityCleanup && primaryCleanup &&
        wifiScannerCleanup &&
        (std::strcmp(status, "valid") != 0 || remountCleanup);
    const leshy1::storage::StorageTimingSummary timings =
        leshy1::storage::summarizeStorageTimings(
            commitUs.data(), commitsCompleted);
    const std::uint64_t logicalBytesPerSecond =
        timings.valid && timings.totalUs != 0
            ? (bytesWritten * 1000000ULL) / timings.totalUs : 0;
    const std::uint64_t encodedPayloadBytesPerSecond =
        timings.valid && timings.totalUs != 0 && fixtureSegmentBytes != 0
            ? (static_cast<std::uint64_t>(fixtureSegmentBytes) *
               (realWifiPipeline ? 1ULL : commitsCompleted) *
               1000000ULL) / timings.totalUs
            : 0;
    const leshy1::services::survey::SessionBatchPolicy batchPolicy;
    bool fixtureRestored = true;
    bool uiStateReady = true;
    bool persistentLibraryAdmitted = false;
    if (realWifiPipeline) {
        surveyDemoReady = prepareSurveyDemo();
        fixtureRestored = false;
        const LibraryEntry* previousLibrary = libraryController.selected();
        const bool previousPersistentLibrary =
            previousLibrary != nullptr && previousLibrary->session != nullptr &&
            previousLibrary->persistent;
        if (std::strcmp(status, "valid") == 0 &&
            recoveryAfterRemount.valid()) {
            librarySession = sessionStoreWorkspace().validationSession;
            libraryController.clear();
            const leshy1::apps::library::SessionCatalogResult cataloged =
                sessionCatalog.admitRecovered(
                    librarySession, recoveryAfterRemount, libraryController,
                    true, false);
            libraryDemoReady = cataloged.admitted();
            const CapabilityRecord* persistentCapability =
                inventory.find("library.persistent_session");
            const bool persistentCapabilityReady =
                (persistentCapability != nullptr &&
                 persistentCapability->state == CapabilityState::Available) ||
                (persistentCapability == nullptr && inventory.add(
                    {"library.persistent_session", CapabilityState::Available,
                     "E-HIL-040_exact_scratch_reopen",
                     "validated_session_open"}));
            persistentLibraryAdmitted =
                libraryDemoReady && persistentCapabilityReady;
            if (persistentLibraryAdmitted) {
                appCatalog.rebuild(inventory, targetsMergeFixtureContinuityValid());
                renderInteractiveScreen();
            }
        }
        if (!persistentLibraryAdmitted) {
            const LibraryEntry* currentLibrary = libraryController.selected();
            const bool currentPersistentLibrary =
                currentLibrary != nullptr && currentLibrary->session != nullptr &&
                currentLibrary->persistent;
            if (previousPersistentLibrary || currentPersistentLibrary) {
                libraryDemoReady = true;
            } else {
                fixtureRestored = (libraryDemoReady = prepareLibraryDemo());
            }
        }
        uiStateReady = surveyDemoReady && libraryDemoReady;
    } else if (batchThroughput) {
        fixtureRestored = (libraryDemoReady = prepareLibraryDemo());
        uiStateReady = fixtureRestored;
    }
    if (!uiStateReady && std::strcmp(status, "valid") == 0) {
        status = "ui_state_prepare_failed";
    }
    const LibraryEntry* activeLibrary = libraryController.selected();
    const bool persistentLibraryAvailable =
        activeLibrary != nullptr && activeLibrary->session != nullptr &&
        activeLibrary->persistent;
    const bool storageRateTargetMet =
        (batchThroughput || realWifiPipeline) &&
        std::strcmp(status, "valid") == 0 &&
        encodedPayloadBytesPerSecond >=
            kStorageRequiredEncodedBytesPerSecond;
    const std::uint32_t heapFreeAfter = ESP.getFreeHeap();
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"%s\",\"kind\":\"result\","
        "\"mode\":\"%s\",\"status\":\"%s\",\"identity_status\":\"%s\","
        "\"permit_status\":\"%s\",\"explicitly_disposable\":true,"
        "\"expected_fingerprint\":\"%s\",\"cid_hex\":\"%s\","
        "\"fingerprint_matched\":%s,\"run_id\":\"%s\","
        "\"scratch_path\":\"%s\",\"scratch_preexisting\":%s,"
        "\"scratch_created\":%s,\"byte_limit\":%llu,"
        "\"bytes_written\":%llu,\"card_capacity_bytes\":%llu,"
        "\"filesystem_capacity_bytes\":%llu,\"free_before\":%llu,"
        "\"free_after\":%llu,\"mount_us\":%llu,"
        "\"filesystem_driver\":\"esp_idf_sdspi\","
        "\"filesystem_spi_hz\":%lu,\"filesystem_spi_limit_hz\":%lu,"
        "\"filesystem_mount_error\":%d,"
        "\"commit_one_status\":\"%s\",\"commit_one_us\":%llu,"
        "\"commit_one_generation\":%lu,\"commit_one_slot\":\"%s\","
        "\"commit_two_status\":\"%s\",\"commit_two_us\":%llu,"
        "\"commit_two_generation\":%lu,\"commit_two_slot\":\"%s\","
        "\"commit_samples_requested\":%u,\"commit_samples_completed\":%u,"
        "\"commit_total_us\":%llu,\"commit_min_us\":%llu,"
        "\"commit_p50_us\":%llu,\"commit_p95_us\":%llu,"
        "\"commit_p99_us\":%llu,\"commit_max_us\":%llu,"
        "\"logical_write_bytes_per_second\":%llu,"
        "\"fixture_observations\":%u,\"fixture_segment_bytes\":%u,"
        "\"encoded_payload_bytes_per_second\":%llu,"
        "\"required_encoded_bytes_per_second\":%llu,"
        "\"storage_rate_target_met\":%s,"
        "\"batch_target_encoded_bytes\":%u,"
        "\"batch_maximum_latency_us\":%llu,"
        "\"fixture_restored\":%s,\"ui_state_ready\":%s,"
        "\"persistent_library_admitted\":%s,"
        "\"persistent_library_available\":%s,"
        "\"persistent_library_entries\":%u,"
        "\"persistent_library_generation\":%lu,"
        "\"real_wifi_pipeline\":%s,\"passive_only\":%s,"
        "\"wifi_maximum_scans\":%u,\"wifi_scans_completed\":%u,"
        "\"wifi_records_read\":%llu,\"wifi_records_accepted\":%llu,"
        "\"wifi_records_rejected\":%llu,\"wifi_records_dropped\":%llu,"
        "\"queue_capacity\":%u,\"queue_high_water\":%u,"
        "\"queue_pushed\":%llu,\"queue_popped\":%llu,"
        "\"queue_dropped\":%llu,\"session_append_dropped\":%llu,"
        "\"batch_trigger\":\"%s\",\"pipeline_stop_reason\":\"%s\","
        "\"wifi_scanner_begun\":%s,\"wifi_scanner_cleanup\":%s,"
        "\"pre_remount_status\":\"%s\",\"pre_remount_generation\":%lu,"
        "\"pre_remount_choice\":%u,\"pre_remount_a_status\":%u,"
        "\"pre_remount_b_status\":%u,\"post_remount_generation\":%lu,"
        "\"post_remount_observations\":%u,\"file_syncs\":%lu,"
        "\"directory_syncs\":%lu,\"fat_file_sync_covers_directory\":%s,"
        "\"io_failure\":\"%s\",\"io_errno\":%d,"
        "\"io_fresult\":%u,\"io_fresult_name\":\"%s\","
        "\"mounted\":%s,\"remounted\":%s,\"reopened_read_only\":%s,"
        "\"resource_acquired\":%s,\"owned_during\":%lu,\"owned_after\":%lu,"
        "\"cleanup_complete\":%s,\"gpio21_stable_high\":%s,"
        "\"heap_free_before\":%lu,\"heap_free_after\":%lu,"
        "\"heap_min_free\":%lu,"
        "\"synthetic_fixture\":%s,\"filesystem_api_touched\":%s,"
        "\"user_identifiers_emitted\":false,"
        "\"user_identifiers_retained_in_scratch\":%s,"
        "\"wifi_application_connect_calls\":0,"
        "\"wifi_application_raw_tx_calls\":0,"
        "\"physical_wifi_no_tx_instrumented\":false,"
        "\"mount_on_boot\":false,\"format_allowed\":false,"
        "\"partition_table_modified\":false,\"writes_bounded_to_scratch\":%s,"
        "\"existing_paths_deleted\":false,\"user_file_names_listed\":false,"
        "\"user_file_data_read\":false,\"reset_injection\":false,"
        "\"physical_power_cut\":false,\"nrf_ce_high_events\":0,"
        "\"radio_tx_commands\":0}",
        realWifiPipeline
            ? "leshy.survey.wifi_passive_persist.v1"
            : (batchThroughput
            ? "leshy.storage.sd.session_store_batch_throughput.v1"
            : (throughput
                   ? "leshy.storage.sd.session_store_throughput.v1"
                   : "leshy.storage.sd.session_store.v1")),
        realWifiPipeline
            ? "wifi_passive_persist"
            : (batchThroughput
                   ? "batch_throughput"
                   : (throughput ? "throughput" : "commit_remount")),
        status, leshy1::storage::sdTransportRunStatusName(identity.status),
        leshy1::storage::permitStatusName(permit.status),
        expectedFingerprint, cidHex, fingerprintMatched ? "true" : "false",
        runId, permit.allowed() ? permit.scratchPath : scratchPath,
        scratchPreexisting ? "true" : "false",
        scratchCreated ? "true" : "false",
        static_cast<unsigned long long>(permit.byteLimit),
        static_cast<unsigned long long>(bytesWritten),
        static_cast<unsigned long long>(cardCapacity),
        static_cast<unsigned long long>(filesystemCapacity),
        static_cast<unsigned long long>(freeBefore),
        static_cast<unsigned long long>(freeAfter),
        static_cast<unsigned long long>(mountUs),
        static_cast<unsigned long>(actualFilesystemSpiHz),
        static_cast<unsigned long>(BoardSdFilesystem::kSpiHz),
        filesystemMountError,
        leshy1::storage::sessionStoreStatusName(commitOne.status),
        static_cast<unsigned long long>(commitOneUs),
        static_cast<unsigned long>(commitOne.generation),
        commitOne.publishedSlot == leshy1::storage::HeadSlot::A ? "a" : "b",
        leshy1::storage::sessionStoreStatusName(commitTwo.status),
        static_cast<unsigned long long>(commitTwoUs),
        static_cast<unsigned long>(commitTwo.generation),
        commitTwo.publishedSlot == leshy1::storage::HeadSlot::A ? "a" : "b",
        static_cast<unsigned>(commitsRequested),
        static_cast<unsigned>(commitsCompleted),
        static_cast<unsigned long long>(timings.totalUs),
        static_cast<unsigned long long>(timings.minimumUs),
        static_cast<unsigned long long>(timings.p50Us),
        static_cast<unsigned long long>(timings.p95Us),
        static_cast<unsigned long long>(timings.p99Us),
        static_cast<unsigned long long>(timings.maximumUs),
        static_cast<unsigned long long>(logicalBytesPerSecond),
        static_cast<unsigned>(fixtureObservations),
        static_cast<unsigned>(fixtureSegmentBytes),
        static_cast<unsigned long long>(encodedPayloadBytesPerSecond),
        static_cast<unsigned long long>(
            kStorageRequiredEncodedBytesPerSecond),
        storageRateTargetMet ? "true" : "false",
        static_cast<unsigned>(batchPolicy.targetEncodedBytes),
        static_cast<unsigned long long>(batchPolicy.maximumLatencyUs),
        fixtureRestored ? "true" : "false",
        uiStateReady ? "true" : "false",
        persistentLibraryAdmitted ? "true" : "false",
        persistentLibraryAvailable ? "true" : "false",
        static_cast<unsigned>(libraryController.size()),
        static_cast<unsigned long>(activeLibrary == nullptr
                                       ? 0 : activeLibrary->generation),
        realWifiPipeline ? "true" : "false",
        realWifiPipeline ? "true" : "false",
        maximumWifiScans, wifiScansCompleted,
        static_cast<unsigned long long>(wifiRecordsRead),
        static_cast<unsigned long long>(wifiRecordsAccepted),
        static_cast<unsigned long long>(wifiRecordsRejected),
        static_cast<unsigned long long>(wifiRecordsDropped),
        static_cast<unsigned>(
            leshy1::services::survey::ObservationQueue::kCapacity),
        static_cast<unsigned>(queueHighWater),
        static_cast<unsigned long long>(queuePushed),
        static_cast<unsigned long long>(queuePopped),
        static_cast<unsigned long long>(queueDropped),
        static_cast<unsigned long long>(sessionAppendDropped),
        leshy1::services::survey::sessionBatchTriggerName(pipelineTrigger),
        pipelineStopReason,
        wifiScannerBegun ? "true" : "false",
        wifiScannerCleanup ? "true" : "false",
        leshy1::storage::sessionStoreStatusName(recoveryBeforeRemount.status),
        static_cast<unsigned long>(recoveryBeforeRemount.generation),
        static_cast<unsigned>(recoveryBeforeRemount.choice),
        static_cast<unsigned>(recoveryBeforeRemount.aStatus),
        static_cast<unsigned>(recoveryBeforeRemount.bStatus),
        static_cast<unsigned long>(recoveryAfterRemount.generation),
        static_cast<unsigned>(recoveryAfterRemount.observations),
        static_cast<unsigned long>(fileSyncs),
        static_cast<unsigned long>(directorySyncs),
        fatFileSyncCoversDirectory ? "true" : "false",
        ioFailure, ioErrno, ioFresult, ioFresultName,
        mounted ? "true" : "false", remounted ? "true" : "false",
        reopenedReadOnly ? "true" : "false",
        resourcesAcquired ? "true" : "false",
        static_cast<unsigned long>(ownedDuring),
        static_cast<unsigned long>(ownedAfter),
        cleanupComplete ? "true" : "false",
        (identityTransport.gpio21StableHigh() &&
         primaryFilesystem.gpio21StableHigh()) ? "true" : "false",
        static_cast<unsigned long>(heapFreeBefore),
        static_cast<unsigned long>(heapFreeAfter),
        static_cast<unsigned long>(ESP.getMinFreeHeap()),
        realWifiPipeline ? "false" : "true",
        mounted ? "true" : "false",
        realWifiPipeline ? "true" : "false",
        prepared ? "true" : "false");
    reply.println(line);
}

struct WifiIngressSinkContext final {
    SurveySession* session = nullptr;
};

WifiRecordDisposition collectWifiIngressRecord(
    const WifiScanRecord& record, std::uint64_t monotonicUs, void* rawContext) {
    auto* context = static_cast<WifiIngressSinkContext*>(rawContext);
    if (context == nullptr || context->session == nullptr) {
        return WifiRecordDisposition::Rejected;
    }
    Observation observation;
    if (!leshy1::drivers::wifi::normalizePassiveRecord(
            record, monotonicUs, &observation)) {
        return WifiRecordDisposition::Rejected;
    }
    const SessionStatus status = context->session->append(observation);
    if (status == SessionStatus::Appended) {
        return WifiRecordDisposition::Accepted;
    }
    return status == SessionStatus::Full ? WifiRecordDisposition::Dropped
                                         : WifiRecordDisposition::Rejected;
}

bool parseWifiIngressCommand(const char* command, unsigned* samples) {
    if (command == nullptr || samples == nullptr ||
        std::strncmp(command, kWifiIngressPrefix,
                     std::strlen(kWifiIngressPrefix)) != 0) {
        return false;
    }
    unsigned parsedSamples = 0;
    char extra = '\0';
    const int parsed = std::sscanf(
        command + std::strlen(kWifiIngressPrefix), "%u %c",
        &parsedSamples, &extra);
    if (parsed != 1 || parsedSamples == 0 ||
        parsedSamples > kWifiIngressMaxSamples) {
        return false;
    }
    *samples = parsedSamples;
    return true;
}

void emitPhysicalWifiPassiveIngress(Stream& reply, unsigned samplesRequested) {
    auto& line = sdPhysicalEvidence.line;
    auto& rates = sdPhysicalEvidence.commitUs;
    rates.fill(0);
    const leshy1::drivers::wifi::WifiScanPlan plan =
        leshy1::drivers::wifi::defaultPassivePlan();
    const bool planValid = leshy1::drivers::wifi::validatePassivePlan(plan);
    const bool idleUi = uiController.isRoot() && !appRuntime.running();
    const std::uint32_t heapFreeBefore = ESP.getFreeHeap();
    const bool resourcesAcquired = idleUi && planValid && resourceBroker.acquire(
        kWifiIngressOwner,
        leshy1::kernel::runtime::resourceMask(Resource::EspRf));
    const std::uint32_t ownedDuring = resourceBroker.ownedBy(kWifiIngressOwner);
    BoardSdSpiTransport::holdRadioTransmitPathsInactive();

