anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void emitLibraryCsvExport(Stream& reply) {
    const LibraryEntry* entry = libraryController.selected();
    if (libraryController.view() != LibraryView::ExportReady || entry == nullptr ||
        entry->session == nullptr) {
        reply.println(
            "{\"schema\":\"leshy.library.csv.v1\",\"kind\":\"begin\","
            "\"status\":\"not_requested\",\"radio_touched\":false}");
        return;
    }
    const auto& capture = entry->session->captureMetadata();
    if (capture.subGhzRawCaptured) {
        if (entry->generation != sessionStoreWorkspace().generation) {
            reply.println(
                "{\"schema\":\"leshy.library.csv.v1\",\"kind\":\"error\","
                "\"reason\":\"generation_not_loaded\","
                "\"radio_touched\":false}");
            return;
        }
        leshy1::storage::PersistedSubGhzRawCaptureView persisted;
        const auto opened =
            leshy1::storage::openPersistedSubGhzRawCapture(
                *entry->session, sessionStoreWorkspace().segment.data(),
                sessionStoreWorkspace().segmentSize, &persisted);
        if (opened != leshy1::storage::SessionCodecStatus::Valid) {
            std::snprintf(
                diagnosticJson, sizeof(diagnosticJson),
                "{\"schema\":\"leshy.library.csv.v1\",\"kind\":\"error\","
                "\"reason\":\"%s\",\"radio_touched\":false}",
                leshy1::storage::sessionCodecStatusName(opened));
            reply.println(diagnosticJson);
            return;
        }
        std::snprintf(
            diagnosticJson, sizeof(diagnosticJson),
            "{\"schema\":\"leshy.library.csv.v1\",\"kind\":\"begin\","
            "\"status\":\"valid\",\"format\":\"subghz_raw_pulses\","
            "\"generation\":%lu,\"session_id\":\"%s\","
            "\"records\":%u,\"columns\":3,\"line_endings\":\"crlf\","
            "\"radio_touched\":false}",
            static_cast<unsigned long>(entry->generation),
            entry->session->id(),
            static_cast<unsigned>(persisted.pulseCount()));
        reply.println(diagnosticJson);
        reply.flush();
        char row[64] = {};
        const auto header =
            leshy1::apps::capture::formatSubGhzRawCsvHeader(
                row, sizeof(row));
        bool valid = header.valid &&
            reply.write(reinterpret_cast<const std::uint8_t*>(row),
                        header.bytes) == header.bytes;
        std::size_t bytes = valid ? header.bytes : 0U;
        std::size_t records = 0;
        for (std::size_t index = 0;
             valid && index < persisted.pulseCount(); ++index) {
            const auto formatted =
                leshy1::apps::capture::formatSubGhzRawCsvRow(
                    persisted, index, capture.subGhzStartLevel,
                    row, sizeof(row));
            valid = formatted.valid &&
                reply.write(reinterpret_cast<const std::uint8_t*>(row),
                            formatted.bytes) == formatted.bytes;
            if (valid) {
                bytes += formatted.bytes;
                ++records;
            }
        }
        std::snprintf(
            diagnosticJson, sizeof(diagnosticJson),
            "{\"schema\":\"leshy.library.csv.v1\",\"kind\":\"end\","
            "\"status\":\"%s\",\"format\":\"subghz_raw_pulses\","
            "\"records\":%u,\"bytes\":%u,"
            "\"persistent\":true,\"radio_touched\":false}",
            valid ? "complete" : "stream_failed",
            static_cast<unsigned>(records),
            static_cast<unsigned>(bytes));
        reply.println(diagnosticJson);
        reply.flush();
        return;
    }
    if (capture.infraredRawCaptured) {
        if (entry->generation != sessionStoreWorkspace().generation) {
            reply.println(
                "{\"schema\":\"leshy.library.csv.v1\",\"kind\":\"error\","
                "\"reason\":\"generation_not_loaded\","
                "\"radio_touched\":false}");
            return;
        }
        leshy1::storage::PersistedInfraredRawCaptureView persisted;
        const auto opened = leshy1::storage::openPersistedInfraredRawCapture(
            *entry->session, sessionStoreWorkspace().segment.data(),
            sessionStoreWorkspace().segmentSize, &persisted);
        if (opened != leshy1::storage::SessionCodecStatus::Valid) {
            std::snprintf(
                diagnosticJson, sizeof(diagnosticJson),
                "{\"schema\":\"leshy.library.csv.v1\",\"kind\":\"error\","
                "\"reason\":\"%s\",\"radio_touched\":false}",
                leshy1::storage::sessionCodecStatusName(opened));
            reply.println(diagnosticJson);
            return;
        }
        std::snprintf(
            diagnosticJson, sizeof(diagnosticJson),
            "{\"schema\":\"leshy.library.csv.v1\",\"kind\":\"begin\","
            "\"status\":\"valid\",\"format\":\"infrared_raw_pulses\","
            "\"generation\":%lu,\"session_id\":\"%s\","
            "\"records\":%u,\"columns\":3,\"line_endings\":\"crlf\","
            "\"radio_touched\":false}",
            static_cast<unsigned long>(entry->generation),
            entry->session->id(),
            static_cast<unsigned>(persisted.pulseCount()));
        reply.println(diagnosticJson);
        reply.flush();
        char row[64] = {};
        const auto header = leshy1::apps::capture::formatInfraredCsvHeader(
            row, sizeof(row));
        bool valid = header.valid &&
            reply.write(reinterpret_cast<const std::uint8_t*>(row),
                        header.bytes) == header.bytes;
        std::size_t bytes = valid ? header.bytes : 0U;
        std::size_t records = 0;
        for (std::size_t index = 0;
             valid && index < persisted.pulseCount(); ++index) {
            const auto formatted =
                leshy1::apps::capture::formatInfraredCsvRow(
                    persisted, index, capture.infraredStartLevel,
                    row, sizeof(row));
            valid = formatted.valid &&
                reply.write(reinterpret_cast<const std::uint8_t*>(row),
                            formatted.bytes) == formatted.bytes;
            if (valid) {
                bytes += formatted.bytes;
                ++records;
            }
        }
        std::snprintf(
            diagnosticJson, sizeof(diagnosticJson),
            "{\"schema\":\"leshy.library.csv.v1\",\"kind\":\"end\","
            "\"status\":\"%s\",\"format\":\"infrared_raw_pulses\","
            "\"records\":%u,\"bytes\":%u,"
            "\"persistent\":true,\"radio_touched\":false}",
            valid ? "complete" : "stream_failed",
            static_cast<unsigned>(records), static_cast<unsigned>(bytes));
        reply.println(diagnosticJson);
        reply.flush();
        return;
    }
    char row[256] = {};
    const auto header = libraryController.formatSelectedCsvHeader(
        row, sizeof(row));
    if (!header.valid()) {
        std::snprintf(
            diagnosticJson, sizeof(diagnosticJson),
            "{\"schema\":\"leshy.library.csv.v1\",\"kind\":\"begin\","
            "\"status\":\"%s\",\"radio_touched\":false}",
            leshy1::apps::library::libraryExportStatusName(header.status));
        reply.println(diagnosticJson);
        return;
    }
    std::snprintf(
        diagnosticJson, sizeof(diagnosticJson),
        "{\"schema\":\"leshy.library.csv.v1\",\"kind\":\"begin\","
        "\"status\":\"valid\",\"generation\":%lu,\"session_id\":\"%s\","
        "\"records\":%u,\"columns\":9,\"line_endings\":\"crlf\","
        "\"identity_encoding\":\"lower_hex\",\"label_encoding\":\"lower_hex\","
        "\"radio_touched\":false}",
        static_cast<unsigned long>(entry->generation), entry->session->id(),
        static_cast<unsigned>(entry->session->size()));
    reply.println(diagnosticJson);
    reply.print(row);
    std::size_t bytes = header.bytes;
    std::size_t records = 0;
    for (std::size_t index = 0; index < entry->session->size(); ++index) {
        const auto formatted = libraryController.formatSelectedCsvRow(
            index, row, sizeof(row));
        if (!formatted.valid()) {
            std::snprintf(
                diagnosticJson, sizeof(diagnosticJson),
                "{\"schema\":\"leshy.library.csv.v1\",\"kind\":\"end\","
                "\"status\":\"%s\",\"records\":%u,\"bytes\":%u,"
                "\"radio_touched\":false}",
                leshy1::apps::library::libraryExportStatusName(formatted.status),
                static_cast<unsigned>(records), static_cast<unsigned>(bytes));
            reply.println(diagnosticJson);
            return;
        }
        reply.print(row);
        bytes += formatted.bytes;
        ++records;
    }
    std::snprintf(
        diagnosticJson, sizeof(diagnosticJson),
        "{\"schema\":\"leshy.library.csv.v1\",\"kind\":\"end\","
        "\"status\":\"complete\",\"records\":%u,\"bytes\":%u,"
        "\"radio_touched\":false}",
        static_cast<unsigned>(records), static_cast<unsigned>(bytes));
    reply.println(diagnosticJson);
}

void emitLibraryFieldSurveyNative(Stream& reply) {
    const LibraryEntry* entry = libraryController.selected();
    if (libraryController.view() != LibraryView::ExportReady ||
        entry == nullptr || entry->session == nullptr ||
        std::strcmp(entry->session->id(), FieldSurveyTracker::kSessionId) != 0) {
        reply.println(
            "{\"schema\":\"leshy.field_survey.native_csv.v1\","
            "\"kind\":\"begin\",\"status\":\"not_requested\","
            "\"radio_touched\":false}");
        return;
    }
    FieldSurveyCatalog* catalog = acquireFieldSurveyScratch();
    if (catalog == nullptr) {
        reply.println(
            "{\"schema\":\"leshy.field_survey.native_csv.v1\","
            "\"kind\":\"begin\",\"status\":\"workspace_unavailable\","
            "\"radio_touched\":false}");
        return;
    }
    const auto build = catalog->build(*entry->session);
    if (build != leshy1::apps::survey::FieldSurveyBuildStatus::Complete ||
        !catalog->complete()) {
        std::snprintf(
            diagnosticJson, sizeof(diagnosticJson),
            "{\"schema\":\"leshy.field_survey.native_csv.v1\","
            "\"kind\":\"begin\",\"status\":\"%s\","
            "\"radio_touched\":false}",
            fieldSurveyBuildStatusName(build));
        releaseFieldSurveyScratch(catalog);
        reply.println(diagnosticJson);
        return;
    }
    char row[512] = {};
    const auto header = leshy1::apps::survey::formatFieldSurveyNativeHeader(
        row, sizeof(row));
    if (!header.valid()) {
        releaseFieldSurveyScratch(catalog);
        reply.println(
            "{\"schema\":\"leshy.field_survey.native_csv.v1\","
            "\"kind\":\"begin\",\"status\":\"buffer_too_small\","
            "\"radio_touched\":false}");
        return;
    }
    std::snprintf(
        diagnosticJson, sizeof(diagnosticJson),
        "{\"schema\":\"leshy.field_survey.native_csv.v1\","
        "\"kind\":\"begin\",\"status\":\"valid\","
        "\"generation\":%lu,\"session_id\":\"%s\","
        "\"records\":%u,\"columns\":14,\"line_endings\":\"crlf\","
        "\"deduplicated\":true,\"persistent\":%s,"
        "\"radio_touched\":false}",
        static_cast<unsigned long>(entry->generation), entry->session->id(),
        static_cast<unsigned>(catalog->size()),
        entry->persistent ? "true" : "false");
    reply.println(diagnosticJson);
    reply.flush();
    bool valid = reply.write(reinterpret_cast<const std::uint8_t*>(row),
                             header.bytes) == header.bytes;
    std::size_t bytes = valid ? header.bytes : 0U;
    std::size_t records = 0U;
    const char* failure = valid ? "valid" : "stream_failed";
    for (std::size_t index = 0U;
         valid && index < catalog->size(); ++index) {
        const auto* record = catalog->get(index);
        const auto formatted = record == nullptr
            ? leshy1::apps::survey::FieldSurveyNativeResult{}
            : leshy1::apps::survey::formatFieldSurveyNativeRow(
                  *record, row, sizeof(row));
        if (!formatted.valid()) {
            valid = false;
            failure = leshy1::apps::survey::fieldSurveyNativeStatusName(
                formatted.status);
        } else if (reply.write(reinterpret_cast<const std::uint8_t*>(row),
                               formatted.bytes) != formatted.bytes) {
            valid = false;
            failure = "stream_failed";
        } else {
            bytes += formatted.bytes;
            ++records;
        }
    }
    releaseFieldSurveyScratch(catalog);
    std::snprintf(
        diagnosticJson, sizeof(diagnosticJson),
        "{\"schema\":\"leshy.field_survey.native_csv.v1\","
        "\"kind\":\"end\",\"status\":\"%s\","
        "\"records\":%u,\"bytes\":%u,\"radio_touched\":false}",
        valid ? "complete" : failure, static_cast<unsigned>(records),
        static_cast<unsigned>(bytes));
    reply.println(diagnosticJson);
    reply.flush();
}

void emitLibraryFieldSurveyWigle(Stream& reply) {
    const LibraryEntry* entry = libraryController.selected();
    if (libraryController.view() != LibraryView::ExportReady ||
        entry == nullptr || entry->session == nullptr ||
        std::strcmp(entry->session->id(), FieldSurveyTracker::kSessionId) != 0) {
        reply.println(
            "{\"schema\":\"leshy.field_survey.wigle_csv.v1\","
            "\"kind\":\"begin\",\"status\":\"not_requested\","
            "\"radio_touched\":false}");
        return;
    }
    FieldSurveyCatalog* catalog = acquireFieldSurveyScratch();
    if (catalog == nullptr) {
        reply.println(
            "{\"schema\":\"leshy.field_survey.wigle_csv.v1\","
            "\"kind\":\"begin\",\"status\":\"workspace_unavailable\","
            "\"radio_touched\":false}");
        return;
    }
    const auto build = catalog->build(*entry->session);
    if (build != leshy1::apps::survey::FieldSurveyBuildStatus::Complete ||
        !catalog->complete()) {
        std::snprintf(
            diagnosticJson, sizeof(diagnosticJson),
            "{\"schema\":\"leshy.field_survey.wigle_csv.v1\","
            "\"kind\":\"begin\",\"status\":\"%s\","
            "\"radio_touched\":false}",
            fieldSurveyBuildStatusName(build));
        releaseFieldSurveyScratch(catalog);
        reply.println(diagnosticJson);
        return;
    }
    std::size_t wifiStations = 0U;
    for (std::size_t index = 0U; index < catalog->size(); ++index) {
        const auto* record = catalog->get(index);
        if (record != nullptr &&
            record->kind == leshy1::apps::survey::
                FieldSurveyEntityKind::WifiStation) {
            ++wifiStations;
        }
    }
    const std::size_t wigleRecords = catalog->size() - wifiStations;
    const auto& trusted = entry->session->trustedSurveyContext();
    leshy1::apps::survey::FieldSurveyWigleContext context;
    context.firstSeenUtc = trusted.utcPresent
        ? trusted.firstSeenUtc.data() : nullptr;
    context.location.present = trusted.locationPresent;
    context.location.latitudeE7 = trusted.latitudeE7;
    context.location.longitudeE7 = trusted.longitudeE7;
    context.location.altitudeCentimeters = trusted.altitudeCentimeters;
    context.location.accuracyCentimeters = trusted.accuracyCentimeters;
    const auto expectedReadiness = trusted.utcPresent
        ? trusted.locationPresent
            ? leshy1::apps::survey::FieldSurveyWigleReadiness::Located
            : leshy1::apps::survey::FieldSurveyWigleReadiness::Unlocated
        : trusted.locationPresent
            ? leshy1::apps::survey::FieldSurveyWigleReadiness::UntimedLocated
            : leshy1::apps::survey::FieldSurveyWigleReadiness::UntimedUnlocated;
    const bool uploadReady = expectedReadiness ==
        leshy1::apps::survey::FieldSurveyWigleReadiness::Located;
    const char* readinessName = leshy1::apps::survey::
        fieldSurveyWigleReadinessName(expectedReadiness);
    char row[512] = {};
    const auto metadata = leshy1::apps::survey::
        formatFieldSurveyWigleMetadata(LESHY1_VERSION, row, sizeof(row));
    if (!metadata.valid()) {
        releaseFieldSurveyScratch(catalog);
        reply.println(
            "{\"schema\":\"leshy.field_survey.wigle_csv.v1\","
            "\"kind\":\"begin\",\"status\":\"metadata_failed\","
            "\"radio_touched\":false}");
        return;
    }
    std::snprintf(
        diagnosticJson, sizeof(diagnosticJson),
        "{\"schema\":\"leshy.field_survey.wigle_csv.v1\","
        "\"kind\":\"begin\",\"status\":\"valid\","
        "\"generation\":%lu,\"session_id\":\"%s\","
        "\"format\":\"wigle_wifi_1.6\",\"records\":%u,"
        "\"skipped_wifi_stations\":%u,\"readiness\":\"%s\","
        "\"trusted_utc\":%s,\"trusted_location\":%s,"
        "\"trusted_source\":\"%s\",\"fix_age_ms\":%lu,"
        "\"upload_ready\":%s,\"persistent\":%s,"
        "\"radio_touched\":false}",
        static_cast<unsigned long>(entry->generation), entry->session->id(),
        static_cast<unsigned>(wigleRecords),
        static_cast<unsigned>(wifiStations),
        readinessName, trusted.utcPresent ? "true" : "false",
        trusted.locationPresent ? "true" : "false",
        trusted.present ? "gps_nmea" : "none",
        static_cast<unsigned long>(trusted.ageMs),
        uploadReady ? "true" : "false",
        entry->persistent ? "true" : "false");
    reply.println(diagnosticJson);
    reply.flush();
    bool valid = reply.write(reinterpret_cast<const std::uint8_t*>(row),
                             metadata.bytes) == metadata.bytes;
    std::size_t bytes = valid ? metadata.bytes : 0U;
    std::size_t records = 0U;
    const auto columns = leshy1::apps::survey::formatFieldSurveyWigleColumns(
        row, sizeof(row));
    valid = valid && columns.valid() &&
        reply.write(reinterpret_cast<const std::uint8_t*>(row),
                    columns.bytes) == columns.bytes;
    if (valid) bytes += columns.bytes;
    const char* failure = valid ? "valid" : "stream_failed";
    for (std::size_t index = 0U;
         valid && index < catalog->size(); ++index) {
        const auto* record = catalog->get(index);
        if (record != nullptr &&
            record->kind == leshy1::apps::survey::
                FieldSurveyEntityKind::WifiStation) {
            continue;
        }
        const auto formatted = record == nullptr
            ? leshy1::apps::survey::FieldSurveyWigleResult{}
            : leshy1::apps::survey::formatFieldSurveyWigleRow(
                  *record, context, row, sizeof(row));
        if (!formatted.valid() || formatted.uploadReady != uploadReady ||
            formatted.readiness != expectedReadiness) {
            valid = false;
            failure = leshy1::apps::survey::fieldSurveyWigleStatusName(
                formatted.status);
        } else if (reply.write(reinterpret_cast<const std::uint8_t*>(row),
                               formatted.bytes) != formatted.bytes) {
            valid = false;
            failure = "stream_failed";
        } else {
            bytes += formatted.bytes;
            ++records;
        }
    }
    releaseFieldSurveyScratch(catalog);
    std::snprintf(
        diagnosticJson, sizeof(diagnosticJson),
        "{\"schema\":\"leshy.field_survey.wigle_csv.v1\","
        "\"kind\":\"end\",\"status\":\"%s\","
        "\"records\":%u,\"bytes\":%u,"
        "\"skipped_wifi_stations\":%u,"
        "\"readiness\":\"%s\",\"upload_ready\":%s,"
        "\"radio_touched\":false}",
        valid ? "complete" : failure, static_cast<unsigned>(records),
        static_cast<unsigned>(bytes), static_cast<unsigned>(wifiStations),
        readinessName, uploadReady ? "true" : "false");
    reply.println(diagnosticJson);
    reply.flush();
}

void emitLibraryPcapStatus(Stream& reply) {
    if (libraryController.view() != LibraryView::ExportReady) {
        reply.println(
            "{\"schema\":\"leshy.library.pcap.v1\",\"kind\":\"artifact\","
            "\"status\":\"not_requested\",\"radio_touched\":false}");
        return;
    }
    const LibraryEntry* entry = libraryController.selected();
    if (entry == nullptr || entry->session == nullptr ||
        !entry->session->captureMetadata().framePayloadCaptured) {
        const auto result = libraryController.formatSelectedPcapStatus(
            diagnosticJson, sizeof(diagnosticJson));
        if (result.valid()) {
            reply.println(diagnosticJson);
        } else {
            std::snprintf(
                diagnosticJson, sizeof(diagnosticJson),
                "{\"schema\":\"leshy.library.pcap.v1\",\"kind\":\"artifact\","
                "\"status\":\"%s\",\"radio_touched\":false}",
                leshy1::apps::library::libraryExportStatusName(result.status));
            reply.println(diagnosticJson);
        }
        return;
    }
    if (entry->generation != sessionStoreWorkspace().generation) {
        reply.println(
            "{\"schema\":\"leshy.library.pcap.v1\",\"kind\":\"error\","
            "\"reason\":\"generation_not_loaded\",\"radio_touched\":false}");
        return;
    }
    leshy1::storage::PersistedWifiFrameCaptureView persisted;
    const auto opened = leshy1::storage::openPersistedWifiFrameCapture(
        *entry->session, sessionStoreWorkspace().segment.data(),
        sessionStoreWorkspace().segmentSize, &persisted);
    if (opened != leshy1::storage::SessionCodecStatus::Valid) {
        std::snprintf(
            diagnosticJson, sizeof(diagnosticJson),
            "{\"schema\":\"leshy.library.pcap.v1\",\"kind\":\"error\","
            "\"reason\":\"%s\",\"radio_touched\":false}",
            leshy1::storage::sessionCodecStatusName(opened));
        reply.println(diagnosticJson);
        return;
    }
    const auto& source = static_cast<
        const leshy1::domain::captures::WifiFrameSource&>(persisted);
    const std::size_t expected =
        leshy1::apps::capture::radiotapPcapSize(source);
    std::snprintf(
        diagnosticJson, sizeof(diagnosticJson),
        "{\"schema\":\"leshy.library.pcap.v1\",\"kind\":\"pcap_begin\","
        "\"status\":\"valid\",\"generation\":%lu,\"session_id\":\"%s\","
        "\"bytes\":%u,\"frames\":%u,\"linktype\":127,"
        "\"timebase\":\"monotonic_us\",\"streaming\":true,"
        "\"persistent\":true,\"radio_touched\":false}",
        static_cast<unsigned long>(entry->generation), entry->session->id(),
        static_cast<unsigned>(expected),
        static_cast<unsigned>(persisted.frameCount()));
    reply.println(diagnosticJson);
    reply.flush();
    StreamPcapSink sink{&reply};
    const PcapExportResult pcap = leshy1::apps::capture::writeRadiotapPcap(
        source, writePcapBytes, &sink);
    std::snprintf(
        diagnosticJson, sizeof(diagnosticJson),
        "{\"schema\":\"leshy.library.pcap.v1\",\"kind\":\"pcap_end\","
        "\"status\":\"%s\",\"bytes\":%u,\"frames\":%u,"
        "\"persistent\":true,\"radio_touched\":false}",
        pcap.valid ? "valid" : "stream_failed",
        static_cast<unsigned>(pcap.bytesWritten),
        static_cast<unsigned>(pcap.framesWritten));
    reply.println(diagnosticJson);
    reply.flush();
}

