anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void emitFullGuidedRfReport(Stream& reply) {
    const std::uint32_t ccTxStrobes =
        fullGuidedCc1101Report.txStrobes +
        fullGuidedCc1101OokReport.txStrobes +
        fullGuidedCc1101FskReport.txStrobes;
    const std::uint32_t ccPaTableWrites =
        fullGuidedCc1101Report.paTableWrites +
        fullGuidedCc1101OokReport.paTableWrites +
        fullGuidedCc1101FskReport.paTableWrites;
    const std::uint32_t ccFifoWrites =
        fullGuidedCc1101Report.fifoWrites +
        fullGuidedCc1101OokReport.fifoWrites +
        fullGuidedCc1101FskReport.fifoWrites;
    const std::uint32_t ccRejectedStrobes =
        fullGuidedCc1101Report.rejectedStrobes +
        fullGuidedCc1101OokReport.rejectedStrobes +
        fullGuidedCc1101FskReport.rejectedStrobes;
    const std::uint32_t radioTxCommands =
        shieldReceiverProbeReport.radioTxCommands +
        fullGuidedNrf24Report.txModeEntries +
        fullGuidedNrf24Report.txPayloadCommands +
        ccTxStrobes;
    auto& line = diagnosticJson;
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.self_test.active_rf.v1\",\"kind\":\"report\","
        "\"plan_version\":%u,\"step\":\"%s\",\"rx_only\":true,"
        "\"resource_acquired\":%s,\"resource_released\":%s,"
        "\"cleanup_complete\":%s,"
        "\"nrf24\":{\"complete\":%s,\"passed\":%s,\"sweeps\":%lu,"
        "\"channels\":83,\"modules\":%u,\"wire\":{"
        "\"register_reads\":%lu,\"register_writes\":%lu,"
        "\"spi_bytes_clocked\":%lu,\"receive_ce_high_events\":%lu},"
        "\"cleanup_complete\":%s},"
        "\"cc1101\":{\"complete\":%s,\"passed\":%s,"
        "\"band\":\"433\",\"bins\":%u,\"wire\":{"
        "\"register_reads\":%lu,\"register_writes\":%lu,"
        "\"spi_bytes_clocked\":%lu,\"command_strobes\":%lu,"
        "\"reset_strobes\":%lu,\"receive_strobes\":%lu,"
        "\"idle_strobes\":%lu},\"cleanup_complete\":%s},"
        "\"subghz_ook\":{\"complete\":%s,\"passed\":%s,"
        "\"frequency_khz\":433920,\"samples\":%u,"
        "\"report_samples\":%lu,\"cleanup_complete\":%s},"
        "\"subghz_fsk\":{\"complete\":%s,\"passed\":%s,"
        "\"frequency_khz\":433920,\"samples\":%u,\"edges\":%lu,"
        "\"overflow\":%s,\"report_samples\":%lu,"
        "\"async_capture_active\":%s,\"cleanup_complete\":%s},"
        "\"infrared\":{\"complete\":%s,\"passed\":%s,"
        "\"samples\":%u,\"report_samples\":%lu,"
        "\"transitions\":%lu,\"tx_held_low\":%s,"
        "\"nrf_ce_held_low\":%s,\"gpio21_input\":%s,"
        "\"cleanup_complete\":%s},"
        "\"side_effects\":{\"radio_tx_commands\":%lu,"
        "\"nrf_tx_mode_entries\":%lu,\"nrf_tx_payload_commands\":%lu,"
        "\"cc_tx_strobes\":%lu,\"cc_pa_table_writes\":%lu,"
        "\"cc_fifo_writes\":%lu,\"cc_rejected_strobes\":%lu,"
        "\"storage_write_commands\":0},"
        "\"current_owner\":\"%s\",\"current_lease_mask\":%lu}",
        static_cast<unsigned>(SelfTestReport::kPlanVersion),
        fullGuidedRfStepName(fullGuidedRfState.step),
        fullGuidedRfState.resourceAcquired ? "true" : "false",
        fullGuidedRfState.resourceReleased ? "true" : "false",
        fullGuidedRfState.cleanupComplete ? "true" : "false",
        fullGuidedRfState.nrf24Complete ? "true" : "false",
        fullGuidedRfState.nrf24Passed ? "true" : "false",
        static_cast<unsigned long>(fullGuidedNrf24Report.sweeps),
        static_cast<unsigned>(fullGuidedNrf24Report.detectedModules),
        static_cast<unsigned long>(fullGuidedNrf24Report.registerReads),
        static_cast<unsigned long>(fullGuidedNrf24Report.registerWrites),
        static_cast<unsigned long>(fullGuidedNrf24Report.spiBytesClocked),
        static_cast<unsigned long>(fullGuidedNrf24Report.receiveCeHighEvents),
        fullGuidedNrf24Report.cleanupComplete ? "true" : "false",
        fullGuidedRfState.cc1101Complete ? "true" : "false",
        fullGuidedRfState.cc1101Passed ? "true" : "false",
        static_cast<unsigned>(fullGuidedRfState.cc1101Bins),
        static_cast<unsigned long>(fullGuidedCc1101Report.registerReads),
        static_cast<unsigned long>(fullGuidedCc1101Report.registerWrites),
        static_cast<unsigned long>(fullGuidedCc1101Report.spiBytesClocked),
        static_cast<unsigned long>(fullGuidedCc1101Report.commandStrobes),
        static_cast<unsigned long>(fullGuidedCc1101Report.resetStrobes),
        static_cast<unsigned long>(fullGuidedCc1101Report.receiveStrobes),
        static_cast<unsigned long>(fullGuidedCc1101Report.idleStrobes),
        fullGuidedCc1101Report.cleanupComplete ? "true" : "false",
        fullGuidedRfState.subGhzOokComplete ? "true" : "false",
        fullGuidedRfState.subGhzOokPassed ? "true" : "false",
        static_cast<unsigned>(fullGuidedRfState.subGhzOokSamples),
        static_cast<unsigned long>(fullGuidedCc1101OokReport.samples),
        fullGuidedCc1101OokReport.cleanupComplete ? "true" : "false",
        fullGuidedRfState.subGhzFskComplete ? "true" : "false",
        fullGuidedRfState.subGhzFskPassed ? "true" : "false",
        static_cast<unsigned>(fullGuidedRfState.subGhzFskSamples),
        static_cast<unsigned long>(fullGuidedRfState.subGhzFskEdges),
        fullGuidedRfState.subGhzFskOverflow ? "true" : "false",
        static_cast<unsigned long>(fullGuidedCc1101FskReport.samples),
        boardCc1101Spectrum.asyncEdgeCaptureActive() ? "true" : "false",
        fullGuidedCc1101FskReport.cleanupComplete ? "true" : "false",
        fullGuidedRfState.infraredComplete ? "true" : "false",
        fullGuidedRfState.infraredPassed ? "true" : "false",
        static_cast<unsigned>(fullGuidedRfState.infraredSamples),
        static_cast<unsigned long>(fullGuidedInfraredReport.samples),
        static_cast<unsigned long>(fullGuidedInfraredReport.transitions),
        fullGuidedInfraredReport.txHeldLow ? "true" : "false",
        fullGuidedInfraredReport.nrfCeHeldLow ? "true" : "false",
        fullGuidedInfraredReport.gpio21Input ? "true" : "false",
        fullGuidedInfraredReport.cleanupComplete ? "true" : "false",
        static_cast<unsigned long>(radioTxCommands),
        static_cast<unsigned long>(fullGuidedNrf24Report.txModeEntries),
        static_cast<unsigned long>(fullGuidedNrf24Report.txPayloadCommands),
        static_cast<unsigned long>(ccTxStrobes),
        static_cast<unsigned long>(ccPaTableWrites),
        static_cast<unsigned long>(ccFifoWrites),
        static_cast<unsigned long>(ccRejectedStrobes),
        appRuntime.activeApp(),
        static_cast<unsigned long>(appRuntime.activeResources()));
    reply.println(line);
}

void emitFullGuidedArtifactReport(Stream& reply) {
    auto& line = diagnosticJson;
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.self_test.active_artifact.v1\","
        "\"kind\":\"report\",\"plan_version\":%u,\"step\":\"%s\","
        "\"read_only\":false,\"expected_cid\":\"%s\","
        "\"recovery\":{\"complete\":%s,\"passed\":%s,"
        "\"status\":\"%s\",\"generation_before\":%lu,"
        "\"generation_after\":%lu,\"observations_before\":%u,"
        "\"observations_after\":%u,\"mounted_read_only\":%s,"
        "\"cleanup_complete\":%s},"
        "\"library\":{\"complete\":%s,\"passed\":%s,"
        "\"json_bytes\":%u,\"metadata_bytes\":%u,"
        "\"csv_records\":%u,\"csv_bytes\":%u},"
        "\"capture\":{\"complete\":%s,\"applicable\":%s,"
        "\"passed\":%s,\"pcap_frames\":%u,\"pcap_bytes\":%u,"
        "\"pcap_fnv1a\":%lu},"
        "\"disposable\":{\"run_id\":\"%s\","
        "\"scratch_path\":\"%s\",\"observed_cid\":\"%s\","
        "\"identity_passed\":%s,\"scratch_preexisting\":%s,"
        "\"scratch_created\":%s,\"commit_complete\":%s,"
        "\"commit_passed\":%s,\"generation\":%lu,"
        "\"observations\":%u,\"write_calls\":%lu,"
        "\"write_bytes\":%llu,\"file_syncs\":%lu,"
        "\"directory_syncs\":%lu,\"remount_complete\":%s,"
        "\"remount_passed\":%s,\"export_complete\":%s,"
        "\"export_passed\":%s,\"json_bytes\":%u,"
        "\"metadata_bytes\":%u,\"csv_records\":%u,"
        "\"csv_bytes\":%u,\"cleanup_complete\":%s,"
        "\"cleanup_passed\":%s,\"files_removed\":%u,"
        "\"scratch_removed\":%s},"
        "\"product_continuity\":{\"complete\":%s,\"passed\":%s,"
        "\"generation_final\":%lu,\"observations_final\":%u},"
        "\"side_effects\":{\"radio_tx_commands\":0,"
        "\"disposable_storage_write_commands\":%lu,"
        "\"disposable_storage_write_bytes\":%llu,"
        "\"product_storage_write_commands\":0,"
        "\"blocked_write_attempts\":%lu},"
        "\"cleanup_complete\":%s,\"current_owner\":\"%s\","
        "\"current_lease_mask\":%lu}",
        static_cast<unsigned>(SelfTestReport::kPlanVersion),
        fullGuidedArtifactStepName(fullGuidedArtifactState.step),
        fullGuidedArtifactState.expectedFingerprint,
        fullGuidedArtifactState.recoveryComplete ? "true" : "false",
        fullGuidedArtifactState.recoveryPassed ? "true" : "false",
        productBootRecovery.status,
        static_cast<unsigned long>(
            fullGuidedArtifactState.generationBefore),
        static_cast<unsigned long>(fullGuidedArtifactState.generationAfter),
        static_cast<unsigned>(fullGuidedArtifactState.observationsBefore),
        static_cast<unsigned>(fullGuidedArtifactState.observationsAfter),
        productBootRecovery.readOnlyGuaranteed ? "true" : "false",
        productBootRecovery.cleanupComplete ? "true" : "false",
        fullGuidedArtifactState.libraryComplete ? "true" : "false",
        fullGuidedArtifactState.libraryPassed ? "true" : "false",
        static_cast<unsigned>(fullGuidedArtifactState.jsonBytes),
        static_cast<unsigned>(fullGuidedArtifactState.metadataBytes),
        static_cast<unsigned>(fullGuidedArtifactState.csvRecords),
        static_cast<unsigned>(fullGuidedArtifactState.csvBytes),
        fullGuidedArtifactState.captureComplete ? "true" : "false",
        fullGuidedArtifactState.captureApplicable ? "true" : "false",
        fullGuidedArtifactState.capturePassed ? "true" : "false",
        static_cast<unsigned>(fullGuidedArtifactState.pcapFrames),
        static_cast<unsigned>(fullGuidedArtifactState.pcapBytes),
        static_cast<unsigned long>(fullGuidedArtifactState.pcapFnv1a),
        kFullGuidedDisposableRunId,
        fullGuidedArtifactState.disposableScratchPath,
        fullGuidedArtifactState.disposableObservedFingerprint,
        fullGuidedArtifactState.disposableIdentityPassed ? "true" : "false",
        fullGuidedArtifactState.scratchPreexisting ? "true" : "false",
        fullGuidedArtifactState.scratchCreated ? "true" : "false",
        fullGuidedArtifactState.disposableCommitComplete ? "true" : "false",
        fullGuidedArtifactState.disposableCommitPassed ? "true" : "false",
        static_cast<unsigned long>(
            fullGuidedArtifactState.disposableGeneration),
        static_cast<unsigned>(
            fullGuidedArtifactState.disposableObservations),
        static_cast<unsigned long>(
            fullGuidedArtifactState.disposableStorageWriteCalls),
        static_cast<unsigned long long>(
            fullGuidedArtifactState.disposableStorageWriteBytes),
        static_cast<unsigned long>(
            fullGuidedArtifactState.disposableFileSyncs),
        static_cast<unsigned long>(
            fullGuidedArtifactState.disposableDirectorySyncs),
        fullGuidedArtifactState.disposableRemountComplete ? "true" : "false",
        fullGuidedArtifactState.disposableRemountPassed ? "true" : "false",
        fullGuidedArtifactState.disposableExportComplete ? "true" : "false",
        fullGuidedArtifactState.disposableExportPassed ? "true" : "false",
        static_cast<unsigned>(
            fullGuidedArtifactState.disposableJsonBytes),
        static_cast<unsigned>(
            fullGuidedArtifactState.disposableMetadataBytes),
        static_cast<unsigned>(
            fullGuidedArtifactState.disposableCsvRecords),
        static_cast<unsigned>(
            fullGuidedArtifactState.disposableCsvBytes),
        fullGuidedArtifactState.disposableCleanupComplete ? "true" : "false",
        fullGuidedArtifactState.disposableCleanupPassed ? "true" : "false",
        static_cast<unsigned>(
            fullGuidedArtifactState.disposableFilesRemoved),
        fullGuidedArtifactState.scratchRemoved ? "true" : "false",
        fullGuidedArtifactState.productVerifyComplete ? "true" : "false",
        fullGuidedArtifactState.productVerifyPassed ? "true" : "false",
        static_cast<unsigned long>(
            fullGuidedArtifactState.productGenerationFinal),
        static_cast<unsigned>(
            fullGuidedArtifactState.productObservationsFinal),
        static_cast<unsigned long>(
            fullGuidedArtifactState.disposableStorageWriteCalls),
        static_cast<unsigned long long>(
            fullGuidedArtifactState.disposableStorageWriteBytes),
        static_cast<unsigned long>(
            fullGuidedArtifactState.blockedWriteAttempts),
        fullGuidedArtifactState.cleanupComplete ? "true" : "false",
        appRuntime.activeApp(),
        static_cast<unsigned long>(appRuntime.activeResources()));
    reply.println(line);
}

void emitShieldReceiverProbeReport(Stream& reply) {
    const auto& report = shieldReceiverProbeReport;
    auto& line = diagnosticJson;
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.shield.receiver_probe.v1\",\"kind\":\"report\","
        "\"schema_version\":%u,\"status\":\"%s\",\"read_only\":%s,"
        "\"profile_declared\":%s,\"gps_excluded_by_profile\":%s,"
        "\"pn532_excluded_by_profile\":%s,\"nrf_slot3_gated\":%s,"
        "\"gpio21_stable_high\":%s,\"resource_acquired\":%s,"
        "\"resource_released\":%s,\"cleanup_complete\":%s,"
        "\"detected_receivers\":%u,"
        "\"nrf\":["
        "{\"slot\":1,\"detected\":%s,\"status\":%u,\"config\":%u,"
        "\"channel\":%u,\"rf_setup\":%u,\"feature\":%u},"
        "{\"slot\":2,\"detected\":%s,\"status\":%u,\"config\":%u,"
        "\"channel\":%u,\"rf_setup\":%u,\"feature\":%u}],"
        "\"cc1101\":{\"detected\":%s,\"ready\":%s,\"status\":%u,"
        "\"partnum\":%u,\"version\":%u},"
        "\"bus_line\":{\"complete\":%s,\"samples_per_pull\":%u,"
        "\"idle_pull_down_high_samples\":%u,"
        "\"idle_pull_up_high_samples\":%u,"
        "\"nrf_nop\":["
        "{\"slot\":1,\"pull_down_status\":%u,\"pull_up_status\":%u},"
        "{\"slot\":2,\"pull_down_status\":%u,\"pull_up_status\":%u}],"
        "\"nrf_nop_reads\":%u,\"bitbang_spi_bytes_clocked\":%u},"
        "\"chip_selects\":{\"complete\":%s,\"samples_per_pin\":%u,"
        "\"nrf\":["
        "{\"slot\":1,\"gpio\":4,\"pull_up_high_samples\":%u},"
        "{\"slot\":2,\"gpio\":48,\"pull_up_high_samples\":%u},"
        "{\"slot\":3,\"gpio\":21,\"pull_up_high_samples\":%u}],"
        "\"cc1101\":{\"gpio\":5,\"pull_up_high_samples\":%u}},"
        "\"wire\":{\"nrf_register_reads\":%u,\"cc_status_reads\":%u,"
        "\"spi_bytes_clocked\":%u},"
        "\"side_effects\":{\"nrf_ce_high_events\":%u,"
        "\"cc_command_strobes\":%u,\"radio_tx_commands\":%u},"
        "\"current_owner\":\"%s\",\"current_lease_mask\":%lu}",
        static_cast<unsigned>(ShieldReceiverProbeReport::kSchemaVersion),
        leshy1::drivers::radio::shieldReceiverProbeStatusName(report.status),
        report.readOnly ? "true" : "false",
        report.profileDeclared ? "true" : "false",
        report.gpsExcludedByProfile ? "true" : "false",
        report.pn532ExcludedByProfile ? "true" : "false",
        report.nrfSlot3Gated ? "true" : "false",
        report.gpio21StableHigh ? "true" : "false",
        report.resourceAcquired ? "true" : "false",
        report.resourceReleased ? "true" : "false",
        report.cleanupComplete ? "true" : "false",
        static_cast<unsigned>(report.detectedReceivers),
        report.nrf[0].detected ? "true" : "false",
        static_cast<unsigned>(report.nrf[0].status),
        static_cast<unsigned>(report.nrf[0].config),
        static_cast<unsigned>(report.nrf[0].channel),
        static_cast<unsigned>(report.nrf[0].rfSetup),
        static_cast<unsigned>(report.nrf[0].feature),
        report.nrf[1].detected ? "true" : "false",
        static_cast<unsigned>(report.nrf[1].status),
        static_cast<unsigned>(report.nrf[1].config),
        static_cast<unsigned>(report.nrf[1].channel),
        static_cast<unsigned>(report.nrf[1].rfSetup),
        static_cast<unsigned>(report.nrf[1].feature),
        report.cc1101.detected ? "true" : "false",
        report.cc1101.ready ? "true" : "false",
        static_cast<unsigned>(report.cc1101.status),
        static_cast<unsigned>(report.cc1101.partNumber),
        static_cast<unsigned>(report.cc1101.version),
        report.busLineCharacterizationComplete ? "true" : "false",
        static_cast<unsigned>(report.misoSamplesPerPull),
        static_cast<unsigned>(report.misoIdlePullDownHighSamples),
        static_cast<unsigned>(report.misoIdlePullUpHighSamples),
        static_cast<unsigned>(report.nrfNopStatusPullDown[0]),
        static_cast<unsigned>(report.nrfNopStatusPullUp[0]),
        static_cast<unsigned>(report.nrfNopStatusPullDown[1]),
        static_cast<unsigned>(report.nrfNopStatusPullUp[1]),
        static_cast<unsigned>(report.nrfNopReads),
        static_cast<unsigned>(report.bitBangSpiBytesClocked),
        report.chipSelectCharacterizationComplete ? "true" : "false",
        static_cast<unsigned>(report.chipSelectSamplesPerPin),
        static_cast<unsigned>(report.nrfCsnPullUpHighSamples[0]),
        static_cast<unsigned>(report.nrfCsnPullUpHighSamples[1]),
        static_cast<unsigned>(report.nrfCsnPullUpHighSamples[2]),
        static_cast<unsigned>(report.ccCsnPullUpHighSamples),
        static_cast<unsigned>(report.nrfRegisterReads),
        static_cast<unsigned>(report.ccStatusReads),
        static_cast<unsigned>(report.spiBytesClocked),
        static_cast<unsigned>(report.nrfCeHighEvents),
        static_cast<unsigned>(report.ccCommandStrobes),
        static_cast<unsigned>(report.radioTxCommands),
        appRuntime.activeApp(),
        static_cast<unsigned long>(appRuntime.activeResources()));
    reply.println(line);
}

