anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
bool parseWifiNetworkHilSelectCommand(const char* command,
                                      std::uint64_t* requestedHash) {
    if (command == nullptr || requestedHash == nullptr) return false;
    const std::size_t prefixLength = std::strlen(kWifiNetworkHilSelectPrefix);
    if (std::strncmp(command, kWifiNetworkHilSelectPrefix, prefixLength) != 0 ||
        std::strlen(command) != prefixLength + 16U) {
        return false;
    }
    std::uint64_t parsed = 0U;
    for (std::size_t index = 0; index < 16U; ++index) {
        const int nibble = hexNibble(command[prefixLength + index]);
        if (nibble < 0) return false;
        parsed = (parsed << 4U) | static_cast<std::uint64_t>(nibble);
    }
    if (parsed == 0U) return false;
    *requestedHash = parsed;
    return true;
}

void selectWifiNetworkForHil(Stream& reply, std::uint64_t requestedHash) {
    const bool correctView =
        wifiProductView == WifiProductView::Networks &&
        surveyWorkflow.state() == SurveyWorkflowState::Running;
    const bool correctRuntime =
        productSurveyControl() == ProductSurveyWorkerControl::Running &&
        productSurveyRuntime.workerReady &&
        std::strcmp(appRuntime.activeApp(), "wifi") == 0 &&
        resourceBroker.ownerOf(Resource::EspRf) ==
            AppRuntime::kForegroundOwner;
    const bool unlocked = !wifiNetworkNavigationOrder.locked();
    const bool admissible = hilSession.active() && correctView &&
        correctRuntime && unlocked;
    std::size_t matches = 0U;
    std::size_t selected = wifiNetworkCatalog.size();
    if (admissible) {
        selected = wifiNetworkNavigationOrder.indexOfLabelHash(
            wifiNetworkCatalog, requestedHash, &matches);
    }
    const bool found = admissible && matches != 0U &&
        selected < wifiNetworkCatalog.size();
    if (found) {
        wifiNetworkSelection = selected;
        lastRuntimeEvent = "wifi_network_hil_selected";
        renderInteractiveScreen(false);
    }
    const char* status = !hilSession.active()
        ? "hil_inactive"
        : !correctView
            ? "wrong_view"
            : !correctRuntime
                ? "runtime_not_ready"
                : !unlocked
                    ? "navigation_locked"
                    : found ? "selected" : "not_found";
    char line[512] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.wifi.network_hil_selector.v1\","
        "\"kind\":\"%s\",\"status\":\"%s\",\"selected\":%s,"
        "\"match_count\":%u,\"strongest_match\":%s,"
        "\"hil_active\":%s,\"display_touched\":%s,"
        "\"rf_hardware_touched\":false,\"radio_started\":false,"
        "\"storage_mounted\":false,\"storage_written\":false,"
        "\"identifier_disclosed\":false,\"response_complete\":true}",
        "state", status,
        found ? "true" : "false", static_cast<unsigned>(matches),
        found ? "true" : "false", hilSession.active() ? "true" : "false",
        found ? "true" : "false");
    reply.println(line);
}

bool parseBleDeviceHilSelectCommand(const char* command,
                                    std::uint64_t* requestedHash) {
    if (command == nullptr || requestedHash == nullptr) return false;
    const std::size_t prefixLength = std::strlen(kBleDeviceHilSelectPrefix);
    if (std::strncmp(command, kBleDeviceHilSelectPrefix, prefixLength) != 0 ||
        std::strlen(command) != prefixLength + 16U) {
        return false;
    }
    std::uint64_t parsed = 0U;
    for (std::size_t index = 0; index < 16U; ++index) {
        const int nibble = hexNibble(command[prefixLength + index]);
        if (nibble < 0) return false;
        parsed = (parsed << 4U) | static_cast<std::uint64_t>(nibble);
    }
    if (parsed == 0U) return false;
    *requestedHash = parsed;
    return true;
}

void selectBleDeviceForHil(Stream& reply, std::uint64_t requestedHash) {
    const bool correctView = bleProductView == BleProductView::Devices &&
        surveyWorkflow.state() == SurveyWorkflowState::Running;
    const bool correctRuntime =
        productSurveyControl() == ProductSurveyWorkerControl::Running &&
        productSurveyRuntime.workerReady &&
        std::strcmp(appRuntime.activeApp(), "ble") == 0 &&
        resourceBroker.ownerOf(Resource::EspRf) ==
            AppRuntime::kForegroundOwner;
    const bool unlocked = !bleDeviceNavigationOrder.locked();
    const Observation* current = bleDeviceAt(bleDeviceSelection);
    const bool alreadySelected = !unlocked && current != nullptr &&
        BleDeviceNavigationOrder::labelHash(*current) == requestedHash;
    const bool admissible = hilSession.active() && correctView &&
        correctRuntime && (unlocked || alreadySelected);
    std::size_t matches = 0U;
    std::size_t selected = bleDeviceCatalog.size();
    if (alreadySelected) {
        matches = 1U;
        selected = bleDeviceSelection;
    } else if (admissible) {
        selected = bleDeviceNavigationOrder.indexOfLabelHash(
            bleDeviceCatalog, requestedHash, &matches);
    }
    const Observation* observation =
        selected < bleDeviceCatalog.size() ? bleDeviceCatalog.at(selected)
                                           : nullptr;
    const bool found = admissible && matches != 0U && observation != nullptr;
    const bool connectable = found &&
        observation->bleAdvertisement.present &&
        observation->bleAdvertisement.connectable;
    if (found) {
        bleDeviceSelection = selected;
        bleDeviceNavigationOrder.lock(bleDeviceCatalog);
        lastRuntimeEvent = "ble_device_hil_selected";
        renderInteractiveScreen(false);
    }
    const char* status = !hilSession.active()
        ? "hil_inactive"
        : !correctView
            ? "wrong_view"
            : !correctRuntime
                ? "runtime_not_ready"
                : !unlocked
                    ? alreadySelected ? "already_selected"
                                      : "navigation_locked"
                    : found ? "selected" : "not_found";
    char line[512] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.ble.device_hil_selector.v1\","
        "\"kind\":\"state\",\"status\":\"%s\",\"selected\":%s,"
        "\"match_count\":%u,\"strongest_match\":%s,"
        "\"connectable\":%s,\"hil_active\":%s,"
        "\"navigation_locked\":%s,\"display_touched\":%s,"
        "\"rf_hardware_touched\":false,\"radio_started\":false,"
        "\"storage_mounted\":false,\"storage_written\":false,"
        "\"identifier_disclosed\":false,\"response_complete\":true}",
        status, found ? "true" : "false",
        static_cast<unsigned>(matches), found ? "true" : "false",
        connectable ? "true" : "false",
        hilSession.active() ? "true" : "false",
        bleDeviceNavigationOrder.locked() ? "true" : "false",
        found ? "true" : "false");
    reply.println(line);
}

