anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void emitWifiAuthenticationHilHold(Stream& reply) {
    expireWifiAuthenticationSurveyTerminalHold();
    const bool safeState = hilSession.active() &&
        wifiProductView == WifiProductView::NetworkDetail &&
        wifiAuthenticationProductState ==
            WifiAuthenticationProductState::Idle &&
        productSurveyControl() == ProductSurveyWorkerControl::Running &&
        std::strcmp(appRuntime.activeApp(), "wifi") == 0;
    const bool replayed = safeState &&
        wifiAuthenticationSurveyTerminalHoldArmed;
    const char* status = safeState ? "armed" : "unsafe_state";
    if (safeState && !replayed) {
        wifiAuthenticationSurveyTerminalHoldArmed = true;
        armWifiAuthenticationSurveyTerminalHoldDeadline();
    }
    char line[512] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.wifi.authentication.hil_hold.v1\","
        "\"kind\":\"%s\",\"status\":\"%s\",\"armed\":%s,"
        "\"one_shot\":true,\"replayed\":%s,\"timeout_ms\":%lu,"
        "\"hil_active\":%s,"
        "\"hardware_touched\":false,\"radio_started\":false,"
        "\"storage_mounted\":false,\"storage_written\":false}",
        safeState ? "armed" : "error", status,
        wifiAuthenticationSurveyTerminalHoldArmed ? "true" : "false",
        replayed ? "true" : "false",
        static_cast<unsigned long>(
            kWifiAuthenticationSurveyTerminalHoldTimeoutMs),
        hilSession.active() ? "true" : "false");
    reply.println(line);
}

void emitWifiAuthenticationSyntheticHilReport(Stream& reply) {
    const auto ingress = wifiFrameCapture.authenticationCaptureStats();
    const WifiAuthenticationSyntheticHilContext context{
        hilSession.active(),
        wifiProductView == WifiProductView::AuthenticationCapture,
        wifiAuthenticationProductState ==
            WifiAuthenticationProductState::Result,
        wifiFrameCapture.cleanupComplete() && ingress.cleanupComplete &&
            !ingress.active,
        !ingress.active,
        resourceBroker.ownerOf(Resource::EspRf) ==
                AppRuntime::kForegroundOwner &&
            std::strcmp(appRuntime.activeApp(), "wifi") == 0,
        wifiAuthenticationTarget.channel,
        millis(),
    };
    const WifiAuthenticationSyntheticHilStatus status =
        wifiAuthenticationSyntheticHilFixture.loadOnce(
            context, &wifiAuthenticationSyntheticHilReport,
            &wifiAuthenticationSyntheticHilController);
    const bool loaded =
        status == WifiAuthenticationSyntheticHilStatus::Loaded;
    const bool displayTouched = loaded;
    if (loaded) {
        wifiAuthenticationSynthetic = true;
        wifiAuthenticationRepeatRequested = false;
        wifiAuthenticationRenderedModelValid = false;
        display.startWrite();
        renderWifiAuthenticationCapture(false);
        renderNavigationFooter();
        display.endWrite();
        lastRuntimeEvent = "authentication_synthetic_hil_loaded";
    }
    const bool replayed = status ==
        WifiAuthenticationSyntheticHilStatus::ReplayRejected;
    char line[768] = {};
    const int formatted = std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.wifi.authentication.synthetic_fixture.v1\","
        "\"kind\":\"%s\",\"status\":\"%s\",\"loaded\":%s,"
        "\"synthetic\":true,\"profile\":\"%s\","
        "\"report_identity\":\"%s\",\"report_origin\":\"synthetic_hil\","
        "\"one_shot\":true,\"replayed\":%s,\"hil_active\":%s,"
        "\"display_touched\":%s,\"rf_hardware_touched\":false,"
        "\"radio_started\":false,"
        "\"persistence_allowed\":false,\"export_allowed\":false,"
        "\"storage_mounted\":false,\"storage_written\":false,"
        "\"connect_calls\":0,\"raw_tx_calls\":0,\"generation\":%lu,"
        "\"response_complete\":true}",
        loaded ? "loaded" : "error",
        leshy1::apps::auth::wifiAuthenticationSyntheticHilStatusName(
            status),
        loaded ? "true" : "false",
        WifiAuthenticationSyntheticHilFixture::kProfile,
        WifiAuthenticationSyntheticHilFixture::kReportIdentity,
        replayed ? "true" : "false",
        hilSession.active() ? "true" : "false",
        displayTouched ? "true" : "false",
        static_cast<unsigned long>(wifiAuthenticationGeneration));
    if (formatted < 0 ||
        static_cast<std::size_t>(formatted) >= sizeof(line)) {
        reply.println(loaded
            ? "{\"schema\":\"leshy.wifi.authentication.synthetic_fixture.v1\",\"kind\":\"error\",\"status\":\"response_truncated\",\"loaded\":true,\"synthetic\":true,\"display_touched\":true,\"rf_hardware_touched\":false,\"radio_started\":false,\"persistence_allowed\":false,\"export_allowed\":false,\"response_complete\":false}"
            : "{\"schema\":\"leshy.wifi.authentication.synthetic_fixture.v1\",\"kind\":\"error\",\"status\":\"response_truncated\",\"loaded\":false,\"synthetic\":true,\"display_touched\":false,\"rf_hardware_touched\":false,\"radio_started\":false,\"persistence_allowed\":false,\"export_allowed\":false,\"response_complete\":false}");
        return;
    }
    reply.println(line);
}

void emitWifiAuthenticationPersistenceHilFixture(Stream& reply) {
    const auto ingress = wifiFrameCapture.authenticationCaptureStats();
    std::uint64_t nowUs = static_cast<std::uint64_t>(esp_timer_get_time());
    if (nowUs == 0U) nowUs = 1U;
    const bool syntheticStateAdmissible = !wifiAuthenticationSynthetic ||
        wifiAuthenticationPersistenceHil;
    const bool fixtureContextAdmissible =
        hilSession.active() &&
        wifiProductView == WifiProductView::AuthenticationCapture &&
        wifiAuthenticationProductState ==
            WifiAuthenticationProductState::Result &&
        syntheticStateAdmissible && wifiFrameCapture.cleanupComplete() &&
        ingress.cleanupComplete && !ingress.active &&
        captureStoreTaskHandle == nullptr &&
        resourceBroker.ownerOf(Resource::EspRf) ==
            AppRuntime::kForegroundOwner &&
        std::strcmp(appRuntime.activeApp(), "wifi") == 0;
    WifiFrameCapture* persistenceCapture =
        wifiAuthenticationPersistenceHilCapture;
    if (persistenceCapture == nullptr && fixtureContextAdmissible) {
        persistenceCapture =
            ensureWifiAuthenticationPersistenceHilCapture();
    }
    const WifiAuthenticationPersistenceHilContext context{
        hilSession.active(),
        wifiProductView == WifiProductView::AuthenticationCapture,
        wifiAuthenticationProductState ==
                WifiAuthenticationProductState::Result &&
            syntheticStateAdmissible,
        wifiFrameCapture.cleanupComplete() && ingress.cleanupComplete &&
            !ingress.active && captureStoreTaskHandle == nullptr,
        !ingress.active && persistenceCapture != nullptr &&
            persistenceCapture->stats().state ==
                WifiFrameCaptureState::Idle,
        resourceBroker.ownerOf(Resource::EspRf) ==
                AppRuntime::kForegroundOwner &&
            std::strcmp(appRuntime.activeApp(), "wifi") == 0,
        millis(),
        nowUs,
    };
    const WifiAuthenticationPersistenceHilStatus status =
        wifiAuthenticationPersistenceHilFixture.loadOnce(
            context, persistenceCapture,
            &wifiAuthenticationSyntheticHilReport,
            &wifiAuthenticationSyntheticHilController);
    const bool loaded =
        status == WifiAuthenticationPersistenceHilStatus::Loaded;
    if (loaded) {
        wifiAuthenticationTarget = {};
        wifiAuthenticationTarget.accessPoint =
            WifiAuthenticationPersistenceHilFixture::kAccessPoint;
        std::copy(
            WifiAuthenticationPersistenceHilFixture::kSsid.begin(),
            WifiAuthenticationPersistenceHilFixture::kSsid.end(),
            wifiAuthenticationTarget.ssid.begin());
        wifiAuthenticationTarget.ssidLength = static_cast<std::uint8_t>(
            WifiAuthenticationPersistenceHilFixture::kSsid.size());
        wifiAuthenticationTarget.ssidKnown = true;
        wifiAuthenticationTarget.channel =
            WifiAuthenticationPersistenceHilFixture::kChannel;
        wifiAuthenticationSynthetic = true;
        wifiAuthenticationPersistenceHil = true;
        wifiAuthenticationRepeatRequested = false;
        wifiAuthenticationPersistState = CapturePersistState::Result;
        wifiAuthenticationPersistStatus = "volatile";
        wifiAuthenticationPersistGeneration = 0U;
        wifiAuthenticationPcapReady = false;
        wifiAuthenticationStandardReady = false;
        ++wifiAuthenticationGeneration;
        if (wifiAuthenticationGeneration == 0U) {
            ++wifiAuthenticationGeneration;
        }
        wifiAuthenticationRenderedModelValid = false;
        display.startWrite();
        renderWifiAuthenticationCapture(false);
        renderNavigationFooter();
        display.endWrite();
        lastRuntimeEvent =
            "authentication_persistence_hil_fixture_loaded";
    } else if (!wifiAuthenticationPersistenceHil) {
        // A rejected first load must restore the product heap immediately.
        releaseWifiAuthenticationPersistenceHilCapture();
        persistenceCapture = nullptr;
    }
    const bool replayed = status ==
        WifiAuthenticationPersistenceHilStatus::ReplayRejected;
    char line[896] = {};
    const int formatted = std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.wifi.authentication.persistence_fixture.v1\","
        "\"kind\":\"%s\",\"status\":\"%s\",\"loaded\":%s,"
        "\"synthetic\":true,\"profile\":\"%s\","
        "\"report_identity\":\"%s\","
        "\"report_origin\":\"synthetic_hil_persistence\","
        "\"one_shot\":true,\"replayed\":%s,\"hil_active\":%s,"
        "\"fixture_frames\":%u,\"strict_message_pair\":%s,"
        "\"display_touched\":%s,\"rf_hardware_touched\":false,"
        "\"radio_started\":false,\"persistence_allowed\":%s,"
        "\"export_allowed\":%s,\"storage_mounted\":false,"
        "\"storage_written\":false,\"connect_calls\":0,"
        "\"raw_tx_calls\":0,\"raw_payload_disclosed\":false,"
        "\"public_test_identifiers_only\":true,\"generation\":%lu,"
        "\"response_complete\":true}",
        loaded ? "loaded" : "error",
        leshy1::apps::auth::
            wifiAuthenticationPersistenceHilStatusName(status),
        loaded ? "true" : "false",
        WifiAuthenticationPersistenceHilFixture::kProfile,
        WifiAuthenticationPersistenceHilFixture::kReportIdentity,
        replayed ? "true" : "false",
        hilSession.active() ? "true" : "false",
        static_cast<unsigned>(loaded && persistenceCapture != nullptr
            ? persistenceCapture->size() : 0U),
        loaded ? "true" : "false",
        loaded ? "true" : "false",
        loaded ? "true" : "false",
        loaded ? "true" : "false",
        static_cast<unsigned long>(wifiAuthenticationGeneration));
    if (formatted < 0 ||
        static_cast<std::size_t>(formatted) >= sizeof(line)) {
        reply.println(
            "{\"schema\":\"leshy.wifi.authentication.persistence_fixture.v1\","
            "\"kind\":\"error\",\"status\":\"response_truncated\","
            "\"loaded\":false,\"synthetic\":true,"
            "\"rf_hardware_touched\":false,\"radio_started\":false,"
            "\"persistence_allowed\":false,\"export_allowed\":false,"
            "\"raw_payload_disclosed\":false,"
            "\"response_complete\":false}");
        return;
    }
    reply.println(line);
}

