anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void emitWifiAuthenticationCaptureState(Stream& reply) {
    const auto capture = activeWifiAuthenticationFrameCaptureStats();
    const auto ingress = activeWifiAuthenticationIngressStats();
    const WorkerDeadlineSnapshot worker = workerDeadlineSnapshot();
    const WifiAuthenticationCaptureUiModel presenter =
        leshy1::ui::presentWifiAuthenticationCapture(
            wifiAuthenticationCaptureUiInput());
    const WifiAuthenticationCaptureReport& report =
        activeWifiAuthenticationCaptureReport();
    const WifiAuthenticationCaptureController& controller =
        activeWifiAuthenticationCaptureController();
    const auto& counters = report.counters;
    std::size_t completePeers = 0;
    std::size_t partialPeers = 0;
    for (std::size_t index = 0;
         index < report.peerCount; ++index) {
        if (report.peers[index].complete) {
            ++completePeers;
        } else if (report.peers[index].messageMask != 0U) {
            ++partialPeers;
        }
    }
    const bool controllerReady = controller.ready();
    const char* reportOrigin = wifiAuthenticationPersistenceHil
        ? "synthetic_hil_persistence"
        : wifiAuthenticationSynthetic
        ? "synthetic_hil"
        : (controllerReady && wifiAuthenticationProductState ==
                    WifiAuthenticationProductState::Result
               ? "ambient_rf" : "none");
    const auto* selectedPeer = controllerReady
        ? controller.selectedPeer() : nullptr;
    const auto* selectedEvidence = controllerReady
        ? controller.selectedEvidence() : nullptr;
    const std::size_t selectedEvidenceReportIndex = controllerReady
        ? controller.selectedEvidenceReportIndex() : 0U;
    const bool presenterSyntheticLabelVisible = presenter.synthetic &&
        presenter.note == UiTextId::SimulatedData;
    const std::uint64_t analysisReported =
        static_cast<std::uint64_t>(ingress.candidates) +
        ingress.framesInvalid;
    const std::uint64_t analysisAccounted =
        static_cast<std::uint64_t>(ingress.candidatesAccepted) +
        ingress.candidatesDropped + ingress.framesInvalid;
    const bool analysisAccountingValid =
        analysisReported <= UINT32_MAX &&
        analysisAccounted == analysisReported &&
        capture.framesReported == ingress.candidates &&
        capture.framesAccepted == ingress.candidatesAccepted;
    char productionReportFingerprint[17] = {};
    const bool productionReportFingerprintAvailable =
        formatWifiAuthenticationProductionReportFingerprint(
            productionReportFingerprint,
            sizeof(productionReportFingerprint));
    auto& line = diagnosticJson;
    line[0] = '\0';
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.wifi.authentication_capture.v1\","
        "\"kind\":\"state\",\"view\":\"%s\",\"state\":\"%s\","
        "\"synthetic\":%s,\"report_origin\":\"%s\","
        "\"generation\":%lu,\"cancel_pending\":%s,"
        "\"production_report_fingerprint\":\"%s\","
        "\"production_report_fingerprint_scope\":\"%s\","
        "\"production_controller_ready\":%s,"
        "\"production_controller_view\":\"%s\","
        "\"production_controller_action_selection\":%u,"
        "\"production_controller_peer_selection\":%u,"
        "\"production_controller_evidence_selection\":%u,"
        "\"production_controller_report_bound\":%s,"
        "\"back_during_wait_observed\":%s,\"failure\":\"%s\","
        "\"survey_terminal_hold_armed\":%s,"
        "\"adapter_driver_error\":%ld,"
        "\"adapter_failure_stage\":\"%s\","
        "\"adapter_heap_free_before_init\":%lu,"
        "\"adapter_heap_largest_before_init\":%lu,"
        "\"passive\":true,\"tx_path\":false,\"connect_path\":false,"
        "\"target_selected\":%s,\"target_selection_continuity\":%s,"
        "\"channel\":%u,\"duration_ms\":%lu,"
        "\"maximum_frames\":%u,\"snap_length\":%u,"
        "\"capture_state\":\"%s\",\"frames_reported\":%lu,"
        "\"frames_accepted\":%lu,\"frames_dropped_capacity\":%lu,"
        "\"frames_dropped_invalid\":%lu,\"frames_observed\":%lu,"
        "\"frames_ignored\":%lu,\"ingress_invalid\":%lu,"
        "\"candidates\":%lu,\"candidates_accepted\":%lu,"
        "\"candidates_dropped\":%lu,\"capture_active\":%s,"
        "\"analysis_frames_reported\":%llu,"
        "\"analysis_frames_accepted\":%lu,"
        "\"analysis_dropped_capacity\":%lu,"
        "\"analysis_dropped_invalid\":%lu,"
        "\"analysis_accounting_valid\":%s,"
        "\"capture_cleanup_complete\":%s,"
        "\"adapter_cleanup_complete\":%s,"
        "\"presenter_view\":\"%s\",\"presenter_tone\":\"%s\","
        "\"presenter_evidence_incomplete\":%s,"
        "\"presenter_report_openable\":%s,"
        "\"presenter_cleanup_complete\":%s,"
        "\"presenter_row_count\":%u,\"presenter_title\":%u,"
        "\"presenter_headline\":%u,\"presenter_note\":%u,"
        "\"presenter_synthetic\":%s,"
        "\"presenter_synthetic_label_visible\":%s,"
        "\"presenter_title_semantic\":\"%s\","
        "\"presenter_headline_semantic\":\"%s\","
        "\"presenter_note_semantic\":\"%s\","
        "\"synthetic_persistence_allowed\":%s,"
        "\"synthetic_export_allowed\":%s,"
        "\"controller_ready\":%s,\"controller_view\":\"%s\","
        "\"controller_action_count\":%u,"
        "\"controller_action_selection\":%u,"
        "\"controller_selected_action\":\"%s\","
        "\"controller_peer_count\":%u,"
        "\"controller_peer_selection\":%u,"
        "\"controller_peer_position\":%u,"
        "\"controller_selected_peer_mask\":%u,"
        "\"controller_selected_peer_evidence_count\":%u,"
        "\"controller_evidence_count\":%u,"
        "\"controller_evidence_selection\":%u,"
        "\"controller_selected_evidence_present\":%s,"
        "\"controller_selected_evidence_report_index\":%u,"
        "\"controller_selected_evidence_source_frame\":%u,"
        "\"controller_selected_evidence_message\":\"%s\","
        "\"controller_selected_evidence_has_pmkid\":%s,"
        "\"repeat_requested\":%s,"
        "\"repeat_request_generation\":%lu,"
        "\"source_frames\":%lu,\"frames_read\":%lu,"
        "\"data_frames\":%lu,\"analysis_frames_ignored\":%lu,"
        "\"eapol_frames\":%lu,\"eapol_key_frames\":%lu,"
        "\"classified_key_frames\":%lu,"
        "\"unclassified_key_frames\":%lu,"
        "\"unsupported_key_frames\":%lu,"
        "\"sequence_rejected\":%lu,\"malformed_frames\":%lu,"
        "\"truncated_frames\":%lu,\"source_read_failures\":%lu,"
        "\"evidence_dropped\":%lu,\"peers_dropped\":%lu,"
        "\"pmkids_dropped\":%lu,"
        "\"report_capture_frames_reported\":%lu,"
        "\"report_capture_frames_accepted\":%lu,"
        "\"report_capture_frames_dropped_capacity\":%lu,"
        "\"report_capture_frames_dropped_invalid\":%lu,"
        "\"outcome\":\"%s\",\"uncertainty\":%u,"
        "\"evidence\":%u,\"peers\":%u,\"complete_peers\":%u,"
        "\"partial_peers\":%u,"
        "\"pmkids\":%u,"
        "\"content_repaints\":%lu,\"full_repaints\":%lu,"
        "\"chrome_repaints\":%lu,"
        "\"survey_worker_deadline_armed\":%s,"
        "\"esp_rf_owned_by_foreground\":%s,"
        "\"read_only_query\":true}",
        wifiProductViewName(wifiProductView),
        wifiAuthenticationProductStateName(
            wifiAuthenticationProductState),
        wifiAuthenticationSynthetic ? "true" : "false",
        reportOrigin,
        static_cast<unsigned long>(wifiAuthenticationGeneration),
        wifiAuthenticationReturnAfterSurveyStop ? "true" : "false",
        productionReportFingerprintAvailable
            ? productionReportFingerprint : "unavailable",
        productionReportFingerprintAvailable ? "hil_session" : "none",
        wifiAuthenticationController.ready() ? "true" : "false",
        wifiAuthenticationController.ready()
            ? leshy1::apps::auth::wifiAuthenticationCaptureViewName(
                  wifiAuthenticationController.view())
            : "unavailable",
        static_cast<unsigned>(wifiAuthenticationController.actionSelection()),
        static_cast<unsigned>(wifiAuthenticationController.peerSelection()),
        static_cast<unsigned>(
            wifiAuthenticationController.evidenceSelection()),
        wifiAuthenticationController.report() == &wifiAuthenticationReport
            ? "true" : "false",
        wifiAuthenticationBackDuringWaitObserved ? "true" : "false",
        wifiAuthenticationUiFailureName(wifiAuthenticationFailure),
        wifiAuthenticationSurveyTerminalHoldArmed ? "true" : "false",
        static_cast<long>(wifiFrameCapture.beginDriverError()),
        boardWifiPassiveBeginFailureStageName(
            wifiFrameCapture.beginFailureStage()),
        static_cast<unsigned long>(wifiFrameCapture.heapFreeBeforeInit()),
        static_cast<unsigned long>(wifiFrameCapture.heapLargestBeforeInit()),
        wifiAuthenticationTargetValid() ? "true" : "false",
        (wifiAuthenticationPersistenceHil ||
         wifiAuthenticationTargetMatchesSelectedDetail()) ? "true" : "false",
        static_cast<unsigned>(wifiAuthenticationTarget.channel),
        static_cast<unsigned long>(capture.state != WifiFrameCaptureState::Idle
            ? activeWifiAuthenticationFrameCapture().plan().durationMs
            : kWifiAuthenticationCaptureDurationMs),
        static_cast<unsigned>(capture.state != WifiFrameCaptureState::Idle
            ? activeWifiAuthenticationFrameCapture().plan().maximumFrames
            : kWifiAuthenticationCaptureMaximumFrames),
        static_cast<unsigned>(capture.state != WifiFrameCaptureState::Idle
            ? activeWifiAuthenticationFrameCapture().plan().snapLength
            : kWifiAuthenticationCaptureSnapLength),
        leshy1::apps::capture::wifiFrameCaptureStateName(capture.state),
        static_cast<unsigned long>(capture.framesReported),
        static_cast<unsigned long>(capture.framesAccepted),
        static_cast<unsigned long>(capture.framesDroppedCapacity),
        static_cast<unsigned long>(capture.framesDroppedInvalid),
        static_cast<unsigned long>(ingress.framesObserved),
        static_cast<unsigned long>(ingress.framesIgnored),
        static_cast<unsigned long>(ingress.framesInvalid),
        static_cast<unsigned long>(ingress.candidates),
        static_cast<unsigned long>(ingress.candidatesAccepted),
        static_cast<unsigned long>(ingress.candidatesDropped),
        ingress.active ? "true" : "false",
        static_cast<unsigned long long>(analysisReported),
        static_cast<unsigned long>(ingress.candidatesAccepted),
        static_cast<unsigned long>(ingress.candidatesDropped),
        static_cast<unsigned long>(ingress.framesInvalid),
        analysisAccountingValid ? "true" : "false",
        activeWifiAuthenticationCaptureCleanupComplete() ? "true" : "false",
        ingress.cleanupComplete ? "true" : "false",
        wifiAuthenticationUiViewName(presenter.view),
        wifiAuthenticationUiToneName(presenter.tone),
        presenter.evidenceIncomplete ? "true" : "false",
        presenter.reportOpenable ? "true" : "false",
        presenter.cleanupComplete ? "true" : "false",
        static_cast<unsigned>(presenter.rowCount),
        static_cast<unsigned>(presenter.title),
        static_cast<unsigned>(presenter.headline),
        static_cast<unsigned>(presenter.note),
        presenter.synthetic ? "true" : "false",
        presenterSyntheticLabelVisible ? "true" : "false",
        wifiAuthenticationPresenterTitleSemantic(presenter.title),
        wifiAuthenticationPresenterHeadlineSemantic(presenter.headline),
        wifiAuthenticationPresenterNoteSemantic(presenter.note),
        wifiAuthenticationPersistenceHil ? "true" : "false",
        wifiAuthenticationPersistenceHil ? "true" : "false",
        controllerReady ? "true" : "false",
        controllerReady
            ? leshy1::apps::auth::wifiAuthenticationCaptureViewName(
                  controller.view())
            : "unavailable",
        static_cast<unsigned>(controllerReady
            ? controller.actionCount() : 0U),
        static_cast<unsigned>(controllerReady
            ? controller.actionSelection() : 0U),
        controllerReady
            ? leshy1::apps::auth::wifiAuthenticationCaptureActionName(
                  controller.selectedAction())
            : "none",
        static_cast<unsigned>(controllerReady
            ? controller.peerCount() : 0U),
        static_cast<unsigned>(controllerReady
            ? controller.peerSelection() : 0U),
        static_cast<unsigned>(controllerReady
            ? controller.selectedPeerPosition() : 0U),
        static_cast<unsigned>(selectedPeer != nullptr
            ? selectedPeer->messageMask : 0U),
        static_cast<unsigned>(controllerReady
            ? controller.selectedPeerEvidenceCount()
            : 0U),
        static_cast<unsigned>(controllerReady
            ? controller.evidenceCount() : 0U),
        static_cast<unsigned>(controllerReady
            ? controller.evidenceSelection() : 0U),
        selectedEvidence != nullptr ? "true" : "false",
        static_cast<unsigned>(selectedEvidence != nullptr
            ? selectedEvidenceReportIndex : 0U),
        static_cast<unsigned>(selectedEvidence != nullptr
            ? selectedEvidence->sourceFrameIndex : 0U),
        selectedEvidence != nullptr
            ? leshy1::services::auth::wifiEapolKeyMessageName(
                  selectedEvidence->message)
            : "unknown",
        controllerReady &&
                controller.selectedEvidenceHasPmkid()
            ? "true" : "false",
        wifiAuthenticationRepeatRequested ? "true" : "false",
        static_cast<unsigned long>(
            wifiAuthenticationRepeatRequestGeneration),
        static_cast<unsigned long>(counters.sourceFrames),
        static_cast<unsigned long>(counters.framesRead),
        static_cast<unsigned long>(counters.dataFrames),
        static_cast<unsigned long>(counters.framesIgnored),
        static_cast<unsigned long>(counters.eapolFrames),
        static_cast<unsigned long>(counters.eapolKeyFrames),
        static_cast<unsigned long>(counters.classifiedKeyFrames),
        static_cast<unsigned long>(counters.unclassifiedKeyFrames),
        static_cast<unsigned long>(counters.unsupportedKeyFrames),
        static_cast<unsigned long>(counters.sequenceRejected),
        static_cast<unsigned long>(counters.malformedFrames),
        static_cast<unsigned long>(counters.truncatedFrames),
        static_cast<unsigned long>(counters.sourceReadFailures),
        static_cast<unsigned long>(counters.evidenceDropped),
        static_cast<unsigned long>(counters.peersDropped),
        static_cast<unsigned long>(counters.pmkidsDropped),
        static_cast<unsigned long>(counters.captureFramesReported),
        static_cast<unsigned long>(counters.captureFramesAccepted),
        static_cast<unsigned long>(
            counters.captureFramesDroppedCapacity),
        static_cast<unsigned long>(counters.captureFramesDroppedInvalid),
        leshy1::services::auth::wifiAuthenticationCaptureOutcomeName(
            report.outcome),
        static_cast<unsigned>(report.uncertainty),
        static_cast<unsigned>(report.evidenceCount),
        static_cast<unsigned>(report.peerCount),
        static_cast<unsigned>(completePeers),
        static_cast<unsigned>(partialPeers),
        static_cast<unsigned>(report.pmkidCount),
        static_cast<unsigned long>(wifiAuthenticationContentRepaints),
        static_cast<unsigned long>(wifiAuthenticationFullRepaints),
        static_cast<unsigned long>(wifiAuthenticationChromeRepaints),
        worker.armed ? "true" : "false",
        resourceBroker.ownerOf(Resource::EspRf) ==
                AppRuntime::kForegroundOwner
            ? "true" : "false");
    reply.println(line);
}

void emitWifiAuthenticationPersistenceState(Stream& reply) {
    const auto capture = activeWifiAuthenticationFrameCaptureStats();
    char line[640] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.wifi.authentication_persistence.v1\","
        "\"kind\":\"state\",\"state\":\"%s\",\"status\":\"%s\","
        "\"generation\":%lu,\"pcap_ready\":%s,\"hc22000_ready\":%s,"
        "\"capture_complete\":%s,\"capture_frames\":%u,"
        "\"cleanup_complete\":%s,\"worker_active\":%s,"
        "\"store_kind\":\"%s\",\"explicit_save\":true,"
        "\"atomic_commit\":true,\"reopen_verified\":%s,"
        "\"radio_touched_by_query\":false}",
        capturePersistStateName(wifiAuthenticationPersistState),
        wifiAuthenticationPersistStatus,
        static_cast<unsigned long>(wifiAuthenticationPersistGeneration),
        wifiAuthenticationPcapReady ? "true" : "false",
        wifiAuthenticationStandardReady ? "true" : "false",
        capture.state == WifiFrameCaptureState::Complete
            ? "true" : "false",
        static_cast<unsigned>(activeWifiAuthenticationFrameCapture().size()),
        activeWifiAuthenticationCaptureCleanupComplete() ? "true" : "false",
        captureStoreTaskHandle != nullptr ? "true" : "false",
        wifiCaptureStoreKind == WifiCaptureStoreKind::Authentication
            ? "authentication" : "generic",
        wifiAuthenticationPersistState == CapturePersistState::Saved
            ? "true" : "false");
    reply.println(line);
}

void emitBleDeviceDetailState(Stream& reply) {
    const std::size_t catalogIndex =
        bleDeviceCatalog.indexOfIdentity(bleDeviceDetail);
    const bool live = bleProductView == BleProductView::DeviceDetail &&
        catalogIndex < bleDeviceCatalog.size();
    const Observation& device = *liveBleDeviceDetail();
    const BleDeviceSignalStats& signal = *liveBleDeviceSignal();
    const auto& facts = device.bleAdvertisement;
    char vendor[BleCompanyDatabase::kNameSize + 1U] = {};
    const bool vendorKnown = bleDeviceVendor(device, vendor, sizeof(vendor));
    for (char* byte = vendor; *byte != '\0'; ++byte) {
        const bool safe = (*byte >= 'A' && *byte <= 'Z') ||
            (*byte >= 'a' && *byte <= 'z') ||
            (*byte >= '0' && *byte <= '9') || *byte == ' ' ||
            *byte == '.' || *byte == '-' || *byte == '_' ||
            *byte == '/' || *byte == '&' || *byte == '(' || *byte == ')';
        if (!safe) *byte = '?';
    }
    char service[24] = {};
    compactBleService(device, service, sizeof(service));
    std::uint32_t identityHash = 2166136261U;
    for (std::size_t index = 0; index < device.identityLength; ++index) {
        identityHash ^= device.identity[index];
        identityHash *= 16777619U;
    }
    const BleSubtype subtype =
        leshy1::apps::ble::classifyBleSubtype(device);
    const BleTrackerKind tracker =
        leshy1::apps::ble::classifyBleTracker(device);
    const char* trackerName = tracker == BleTrackerKind::FindMy
        ? "find_my" : (tracker == BleTrackerKind::SmartTag
            ? "smart_tag" : (tracker == BleTrackerKind::Tile
                ? "tile" : "none"));
    auto& line = diagnosticJson;
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.ble.device_detail.v1\",\"kind\":\"state\","
        "\"active\":%s,\"passive\":true,\"active_probe_allowed\":false,"
        "\"identity_hash\":%lu,\"label_known\":%s,"
        "\"company_database_available\":%s,"
        "\"company_database_records\":%u,"
        "\"facts_known\":%s,\"vendor_known\":%s,\"vendor\":\"%s\","
        "\"company_known\":%s,\"company_id\":%u,"
        "\"device_kind\":%u,\"subtype\":\"%s\","
        "\"tracker\":\"%s\",\"address_type\":%u,"
        "\"advertisement_type\":%u,\"legacy\":%s,"
        "\"scannable\":%s,\"connectable\":%s,"
        "\"tx_power_known\":%s,\"tx_power_dbm\":%d,"
        "\"appearance_known\":%s,\"appearance\":%u,"
        "\"service\":\"%s\",\"service_uuid_hash\":%lu,"
        "\"known_service_mask\":%u,"
        "\"service_uuid_count\":%u,\"service_data_count\":%u,"
        "\"manufacturer_data_length\":%u,\"payload_length\":%u,"
        "\"rssi_dbm\":%d,\"signal_samples\":%u,"
        "\"minimum_rssi_dbm\":%d,\"maximum_rssi_dbm\":%d,"
        "\"rssi_trend_db\":%d,\"catalog_revision\":%lu,"
        "\"list_row_repaints\":%lu,\"list_content_clears\":%lu,"
        "\"detail_content_clears\":%lu,"
        "\"radar_full_repaints\":%lu,\"radar_delta_repaints\":%lu,"
        "\"detail_refreshes\":%lu,\"detail_refreshes_deferred\":%lu,"
        "\"detail_refresh_period_us\":%llu,"
        "\"detail_refresh_pending\":%s,"
        "\"atomic_text_row_pushes\":%lu,"
        "\"atomic_text_row_allocation_failures\":%lu,"
        "\"direct_text_row_fallbacks\":%lu}",
        live ? "true" : "false",
        static_cast<unsigned long>(identityHash),
        device.labelLength != 0U ? "true" : "false",
        bleCompanyDatabase.available() ? "true" : "false",
        static_cast<unsigned>(bleCompanyDatabase.records()),
        facts.present ? "true" : "false",
        vendorKnown ? "true" : "false", vendor,
        facts.companyKnown ? "true" : "false",
        static_cast<unsigned>(facts.companyId),
        static_cast<unsigned>(leshy1::apps::ble::classifyBleDevice(device)),
        leshy1::apps::ble::bleSubtypeName(subtype), trackerName,
        static_cast<unsigned>(facts.addressType),
        static_cast<unsigned>(facts.advertisementType),
        facts.legacy ? "true" : "false",
        facts.scannable ? "true" : "false",
        facts.connectable ? "true" : "false",
        facts.txPowerKnown ? "true" : "false",
        static_cast<int>(facts.txPowerDbm),
        facts.appearanceKnown ? "true" : "false",
        static_cast<unsigned>(facts.appearance), service,
        static_cast<unsigned long>(facts.firstServiceUuidHash),
        static_cast<unsigned>(facts.knownServiceMask),
        static_cast<unsigned>(facts.serviceUuidCount),
        static_cast<unsigned>(facts.serviceDataCount),
        static_cast<unsigned>(facts.manufacturerDataLength),
        static_cast<unsigned>(facts.payloadLength),
        static_cast<int>(device.rssiDbm),
        static_cast<unsigned>(signal.samples),
        static_cast<int>(signal.minimumRssiDbm),
        static_cast<int>(signal.maximumRssiDbm),
        static_cast<int>(signal.rssiTrendDb),
        static_cast<unsigned long>(bleDeviceCatalog.revision()),
        static_cast<unsigned long>(bleDeviceListRowRepaints),
        static_cast<unsigned long>(bleDeviceListContentClears),
        static_cast<unsigned long>(bleDeviceDetailContentClears),
        static_cast<unsigned long>(bleDeviceRadarFullRepaints),
        static_cast<unsigned long>(bleDeviceRadarDeltaRepaints),
        static_cast<unsigned long>(bleDeviceDetailRefreshes),
        static_cast<unsigned long>(bleDeviceDetailRefreshesDeferred),
        static_cast<unsigned long long>(kBleDeviceUiRefreshPeriodUs),
        bleDeviceUiRefreshPending ? "true" : "false",
        static_cast<unsigned long>(bleDeviceAtomicTextRowPushes),
        static_cast<unsigned long>(
            bleDeviceAtomicTextRowAllocationFailures),
        static_cast<unsigned long>(bleDeviceDirectTextRowFallbacks));
    reply.println(line);
}

