anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void emitBleInspectorCaptureState(Stream& reply) {
    const BleInspectorCaptureSummary summary = bleInspectorCaptureSnapshot();
    std::uint32_t identityHash = 0U;
    if (leshy1::services::ble::validBleInspectorTarget(summary.target)) {
        identityHash = 2166136261U;
        for (const std::uint8_t byte : summary.target.address) {
            identityHash ^= byte;
            identityHash *= 16777619U;
        }
    }
    auto& line = diagnosticJson;
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.ble.inspector.state.v1\",\"kind\":\"state\","
        "\"view\":\"%s\",\"capture_state\":\"%s\","
        "\"passive\":true,\"receive_only\":true,"
        "\"selected_identity_hash\":%lu,\"address_type\":%u,"
        "\"records\":%u,\"capacity\":%u,\"observed\":%lu,"
        "\"accepted\":%lu,\"different_target\":%lu,"
        "\"invalid\":%lu,\"dropped\":%lu,"
        "\"latest_present\":%s,\"latest_rssi_dbm\":%d,"
        "\"latest_event_type\":%u,\"latest_payload_length\":%u,"
        "\"export_ready\":%s,\"content_clears\":%lu,"
        "\"atomic_row_pushes\":%lu,"
        "\"atomic_row_allocation_failures\":%lu,"
        "\"direct_row_fallbacks\":%lu,\"gatt_started\":false}",
        bleProductViewName(bleProductView),
        summary.state == BleInspectorCaptureState::Running
            ? "running" : (summary.state == BleInspectorCaptureState::Frozen
                ? "frozen" : "idle"),
        static_cast<unsigned long>(identityHash),
        static_cast<unsigned>(summary.target.addressType),
        static_cast<unsigned>(summary.records),
        static_cast<unsigned>(BleInspectorCapture::kRecordCapacity),
        static_cast<unsigned long>(summary.counters.observed),
        static_cast<unsigned long>(summary.counters.accepted),
        static_cast<unsigned long>(summary.counters.differentTarget),
        static_cast<unsigned long>(summary.counters.invalid),
        static_cast<unsigned long>(summary.counters.dropped),
        summary.latestPresent ? "true" : "false",
        summary.latestPresent ? static_cast<int>(summary.latest.rssiDbm) : 0,
        summary.latestPresent
            ? static_cast<unsigned>(summary.latest.eventType) : 0U,
        summary.latestPresent
            ? static_cast<unsigned>(summary.latest.payloadLength) : 0U,
        summary.state == BleInspectorCaptureState::Frozen
            ? "true" : "false",
        static_cast<unsigned long>(bleInspectorContentClears),
        static_cast<unsigned long>(bleInspectorAtomicRowPushes),
        static_cast<unsigned long>(
            bleDeviceAtomicTextRowAllocationFailures),
        static_cast<unsigned long>(bleDeviceDirectTextRowFallbacks));
    reply.println(line);
}

void emitBleGattInspectorState(Stream& reply) {
    BleInspectorTarget target{};
    const bool targetPresent = bleGattTransport.copyTarget(&target);
    std::uint32_t identityHash = 0U;
    if (targetPresent) {
        identityHash = 2166136261U;
        for (const std::uint8_t byte : target.address) {
            identityHash ^= byte;
            identityHash *= 16777619U;
        }
    }
    const BleGattInspectorState state = bleGattTransport.state();
    const BleGattInspectorFailure failure = bleGattTransport.failure();
    const BleGattInspectorFailure cleanupCause =
        bleGattTransport.cleanupCause();
    const auto owner = resourceBroker.ownerOf(Resource::EspRf);
    auto& line = diagnosticJson;
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.ble.inspector.gatt.v1\",\"kind\":\"state\","
        "\"view\":\"%s\",\"state\":\"%s\",\"failure\":\"%s\","
        "\"cleanup_cause\":\"%s\",\"target_present\":%s,"
        "\"selected_identity_hash\":%lu,\"address_type\":%u,"
        "\"permission_visible\":%s,\"confirmation_required\":true,"
        "\"waiting_for_passive_stop\":%s,"
        "\"return_after_cleanup\":%s,"
        "\"services\":%u,\"service_capacity\":%u,"
        "\"characteristics\":%u,\"characteristic_capacity\":%u,"
        "\"host_ready\":%s,\"connected\":%s,"
        "\"transport_connecting\":%s,\"transport_disconnected\":%s,"
        "\"cleanup_requested\":%s,"
        "\"cleanup_complete\":%s,\"owns_radio\":%s,"
        "\"esp_rf_owner\":%u,\"gatt_owner\":%u,"
        "\"heap_free_before\":%lu,\"heap_largest_before\":%lu,"
        "\"heap_free_after_init\":%lu,"
        "\"heap_largest_after_init\":%lu,\"heap_minimum\":%lu,"
        "\"content_clears\":%lu,\"row_repaints\":%lu,"
        "\"hil_fault_armed\":\"%s\","
        "\"hil_fault_last_consumed\":\"%s\","
        "\"hil_fault_consumed_count\":%lu,"
        "\"enumeration_only\":true,\"pairing_allowed\":false,"
        "\"read_allowed\":false,\"write_allowed\":false,"
        "\"subscribe_allowed\":false,\"read_only_query\":true}",
        bleProductViewName(bleProductView),
        leshy1::services::ble::bleGattInspectorStateName(state),
        leshy1::services::ble::bleGattInspectorFailureName(failure),
        leshy1::services::ble::bleGattInspectorFailureName(cleanupCause),
        targetPresent ? "true" : "false",
        static_cast<unsigned long>(identityHash),
        targetPresent ? static_cast<unsigned>(target.addressType) : 0U,
        (state == BleGattInspectorState::PermissionReview ||
         state == BleGattInspectorState::AwaitingConfirmation)
            ? "true" : "false",
        bleGattWaitingForSurveyStop ? "true" : "false",
        bleGattReturnAfterCleanup ? "true" : "false",
        static_cast<unsigned>(bleGattTransport.serviceCount()),
        static_cast<unsigned>(BleGattInspector::kServiceCapacity),
        static_cast<unsigned>(bleGattTransport.characteristicCount()),
        static_cast<unsigned>(BleGattInspector::kCharacteristicCapacity),
        bleGattTransport.hostReady() ? "true" : "false",
        bleGattTransport.connected() ? "true" : "false",
        bleGattTransport.connecting() ? "true" : "false",
        bleGattTransport.disconnected() ? "true" : "false",
        bleGattTransport.cleanupRequested() ? "true" : "false",
        bleGattTransport.cleanupComplete() ? "true" : "false",
        bleGattTransport.ownsRadio() ? "true" : "false",
        static_cast<unsigned>(owner),
        static_cast<unsigned>(BleGattInspector::kDefaultResourceOwner),
        static_cast<unsigned long>(bleGattTransport.heapFreeBefore()),
        static_cast<unsigned long>(bleGattTransport.heapLargestBefore()),
        static_cast<unsigned long>(bleGattTransport.heapFreeAfterInit()),
        static_cast<unsigned long>(bleGattTransport.heapLargestAfterInit()),
        static_cast<unsigned long>(bleGattTransport.heapMinimum()),
        static_cast<unsigned long>(bleGattContentClears),
        static_cast<unsigned long>(bleGattRowRepaints),
        boardBleGattHilFaultName(bleGattTransport.armedHilFault()),
        boardBleGattHilFaultName(bleGattTransport.lastConsumedHilFault()),
        static_cast<unsigned long>(
            bleGattTransport.hilFaultConsumedCount()));
    reply.println(line);
}

void emitBleGattHilFault(Stream& reply, const char* command) {
    constexpr const char* prefix = "ble.inspector.gatt.hil-fault ";
    const char* requested = command + std::strlen(prefix);
    BoardBleGattHilFault fault = BoardBleGattHilFault::None;
    if (std::strcmp(requested, "wrong-peer") == 0) {
        fault = BoardBleGattHilFault::UnexpectedPeer;
    } else if (std::strcmp(requested, "timeout") == 0) {
        fault = BoardBleGattHilFault::Timeout;
    } else if (std::strcmp(requested, "resource-conflict") == 0) {
        fault = BoardBleGattHilFault::ResourceConflict;
    } else if (std::strcmp(requested, "failed-cleanup") == 0) {
        fault = BoardBleGattHilFault::DisconnectFailure;
    }
    const bool clear = std::strcmp(requested, "clear") == 0;
    const bool inspect = std::strcmp(requested, "state") == 0;
    const BleGattInspectorState state = bleGattTransport.state();
    const bool preConnectFault =
        fault == BoardBleGattHilFault::UnexpectedPeer ||
        fault == BoardBleGattHilFault::Timeout ||
        fault == BoardBleGattHilFault::ResourceConflict;
    const bool safeState = hilSession.active() &&
        bleProductView == BleProductView::InspectorGatt &&
        !bleGattWaitingForSurveyStop &&
        ((preConnectFault &&
          (state == BleGattInspectorState::PermissionReview ||
           state == BleGattInspectorState::AwaitingConfirmation)) ||
         (fault == BoardBleGattHilFault::DisconnectFailure &&
          state == BleGattInspectorState::Ready));
    const char* status = "invalid_request";
    if (inspect) {
        status = "state";
    } else if (clear && hilSession.active()) {
        bleGattTransport.clearHilFault();
        resourceBroker.releaseAll(kBleGattHilConflictOwner);
        status = "cleared";
    } else if (fault != BoardBleGattHilFault::None && safeState &&
               bleGattTransport.armHilFault(fault)) {
        status = "armed";
    } else if (fault != BoardBleGattHilFault::None) {
        status = "unsafe_state";
    }
    auto& line = diagnosticJson;
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.ble.inspector.gatt_hil_fault.v1\","
        "\"kind\":\"state\",\"status\":\"%s\","
        "\"requested\":\"%s\",\"armed\":\"%s\","
        "\"last_consumed\":\"%s\",\"consumed_count\":%lu,"
        "\"hil_active\":%s,\"view\":\"%s\",\"gatt_state\":\"%s\","
        "\"one_shot\":true,\"enumeration_only\":true,"
        "\"pairing_allowed\":false,\"read_allowed\":false,"
        "\"write_allowed\":false,\"subscribe_allowed\":false,"
        "\"storage_mounted\":false,\"storage_written\":false,"
        "\"physical_write_calls\":0}",
        status, requested,
        boardBleGattHilFaultName(bleGattTransport.armedHilFault()),
        boardBleGattHilFaultName(bleGattTransport.lastConsumedHilFault()),
        static_cast<unsigned long>(
            bleGattTransport.hilFaultConsumedCount()),
        hilSession.active() ? "true" : "false",
        bleProductViewName(bleProductView),
        leshy1::services::ble::bleGattInspectorStateName(state));
    reply.println(line);
}

void emitBleInspectorCaptureExport(Stream& reply) {
    auto& line = diagnosticJson;
    std::size_t size = 0U;
    const auto emitError = [&](BleInspectorExportStatus status) {
        std::snprintf(
            line, sizeof(line),
            "{\"schema\":\"leshy.ble.inspector.capture.v1\","
            "\"kind\":\"error\",\"status\":\"%s\","
            "\"complete\":false}",
            leshy1::services::ble::bleInspectorExportStatusName(status));
        reply.println(line);
    };
    if (bleInspectorCapture == nullptr) {
        emitError(BleInspectorExportStatus::InvalidCapture);
        return;
    }
    BleInspectorExportStatus status =
        leshy1::services::ble::formatBleInspectorExportHeader(
            *bleInspectorCapture, line, sizeof(line), &size);
    if (status != BleInspectorExportStatus::Formatted) {
        emitError(status);
        return;
    }
    reply.println(line);
    for (std::size_t index = 0U; index < bleInspectorCapture->size(); ++index) {
        status = leshy1::services::ble::formatBleInspectorExportRecord(
            *bleInspectorCapture, index, line, sizeof(line), &size);
        if (status != BleInspectorExportStatus::Formatted) {
            emitError(status);
            return;
        }
        reply.println(line);
    }
    status = leshy1::services::ble::formatBleInspectorExportEnd(
        *bleInspectorCapture, line, sizeof(line), &size);
    if (status != BleInspectorExportStatus::Formatted) {
        emitError(status);
        return;
    }
    reply.println(line);
}

bool commandAllowedDuringSafetyStop(const char* command) {
    if (command == nullptr) return false;
    return std::strncmp(command, "hil.begin ", 10) == 0 ||
           std::strcmp(command, "hil.state") == 0 ||
           std::strncmp(command, "hil.end ", 8) == 0 ||
           std::strcmp(command, "metrics") == 0 ||
           std::strcmp(command, "inventory") == 0 ||
           std::strcmp(command, "ping") == 0 ||
           std::strcmp(command, "hardware.safe-outputs") == 0 ||
           std::strcmp(command, "safety.state") == 0 ||
           std::strcmp(command, "device-lock.state") == 0 ||
           std::strcmp(command,
                       "action.status serial.console.start") == 0 ||
           std::strcmp(command,
                       "action.cancel serial.console.start") == 0 ||
           std::strcmp(command, "safety.restart-test confirm") == 0 ||
           std::strcmp(command, "safety.clear confirm") == 0 ||
           std::strcmp(command, "ui.state") == 0 ||
           std::strcmp(command, "survey.field-visit") == 0 ||
           std::strncmp(command, "ui.key ", 7) == 0 ||
           std::strcmp(command, "ui.capture") == 0 ||
           std::strcmp(command, "input.state") == 0 ||
           std::strcmp(command, "touch.state") == 0 ||
           std::strcmp(command, "storage.product.boot-recovery") == 0;
}

