anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
const char* targetsStoreCodecWorkspaceOwnerName() {
    switch (targetsStoreCodecWorkspaceOwner) {
        case TargetsStoreCodecWorkspaceOwner::Session: return "session";
        case TargetsStoreCodecWorkspaceOwner::TargetDecision:
            return "target_decision";
        case TargetsStoreCodecWorkspaceOwner::AdmissionScratch:
            return "admission_scratch";
        case TargetsStoreCodecWorkspaceOwner::Spectrum: return "spectrum";
    }
    return "unknown";
}

bool commandAllowedWhileSessionWorkspaceBorrowed(const char* command) {
    if (command == nullptr) return false;
    const bool spectrumOwner = targetsStoreCodecWorkspaceOwner ==
        TargetsStoreCodecWorkspaceOwner::Spectrum;
    return std::strncmp(command, "hil.begin ", 10) == 0 ||
           std::strcmp(command, "hil.state") == 0 ||
           std::strncmp(command, "hil.end ", 8) == 0 ||
           std::strcmp(command, "metrics") == 0 ||
           std::strcmp(command, "inventory") == 0 ||
           std::strcmp(command, "hardware.safe-outputs") == 0 ||
           std::strcmp(command, "hardware.nrf24.spectrum") == 0 ||
           std::strcmp(command, "hardware.nrf24.finder") == 0 ||
           std::strcmp(command, "hardware.cc1101.spectrum") == 0 ||
           std::strcmp(command, "hardware.cc1101.finder") == 0 ||
           std::strcmp(command, "safety.state") == 0 ||
           std::strcmp(command, "device-lock.state") == 0 ||
           std::strcmp(command,
                       "action.status serial.console.start") == 0 ||
           std::strcmp(command,
                       "action.cancel serial.console.start") == 0 ||
           std::strcmp(command, "ping") == 0 ||
           std::strcmp(command, "ui.state") == 0 ||
           std::strcmp(command, "survey.field-visit") == 0 ||
           std::strcmp(command, "ui.capture") == 0 ||
           std::strcmp(command, "input.state") == 0 ||
           std::strcmp(command, "touch.state") == 0 ||
           std::strcmp(command, "self-test.report") == 0 ||
           std::strcmp(command, "self-test.active-rf") == 0 ||
           (spectrumOwner && std::strncmp(command, "ui.key ", 7) == 0) ||
           (spectrumOwner && std::strncmp(command, "ui.touch ", 9) == 0);
}

void addCompanionSessionBinding(
    const TargetProductBinding& binding,
    leshy1::services::companion::CompanionReadContext* context) {
    if (context == nullptr || binding.session == nullptr ||
        binding.generation == 0 ||
        context->sessionCount >= context->sessions.size()) {
        return;
    }
    leshy1::domain::targets::SourceId sourceId{};
    if (!leshy1::services::targets::sourceIdForSession(
            *binding.session, &sourceId)) {
        return;
    }
    auto& output = context->sessions[context->sessionCount++];
    output.source = {sourceId, binding.generation};
    output.session = binding.session;
}

leshy1::services::companion::CompanionReadContext companionReadContext() {
    leshy1::services::companion::CompanionReadContext context{};
    const bool runtimeReady = targetsProductRuntime != nullptr &&
        std::strcmp(targetsProductStatus, "ready") == 0;
    const bool webReady = webCompanionTargetsSuspended() &&
        std::strcmp(targetsProductStatus, "web_suspended") == 0;
    if (uiController.page() != 7 || (!runtimeReady && !webReady)) {
        return context;
    }
    if (targetsComparisonLoaded) {
        addCompanionSessionBinding(targetsBaselineBinding, &context);
    }
    addCompanionSessionBinding(targetsCurrentBinding, &context);
    context.targets = runtimeReady
        ? &targetsProductRuntime->workspace.catalog : webCompanionCatalog;
    if (targetsComparisonLoaded && context.sessionCount == 2 &&
        ((runtimeReady &&
          targetsProductRuntime->workspace.comparison.compared()) ||
         (webReady && webCompanionComparison->compared()))) {
        context.comparison = runtimeReady
            ? &targetsProductRuntime->workspace.comparison
            : webCompanionComparison;
    }
    return context;
}

leshy1::services::companion::CompanionScopeMask companionAvailableScopes(
    leshy1::services::companion::CompanionCapabilityMask capabilities) {
    using leshy1::services::companion::CompanionCapability;
    using leshy1::services::companion::CompanionScope;
    using leshy1::services::companion::companionCapabilityMask;
    using leshy1::services::companion::companionScopeMask;
    leshy1::services::companion::CompanionScopeMask scopes = 0;
    if ((capabilities &
         companionCapabilityMask(CompanionCapability::SessionList)) != 0 &&
        (capabilities &
         companionCapabilityMask(CompanionCapability::SessionDetail)) != 0) {
        scopes |= companionScopeMask(CompanionScope::SessionRead);
    }
    if ((capabilities &
         companionCapabilityMask(CompanionCapability::TargetList)) != 0 &&
        (capabilities &
         companionCapabilityMask(CompanionCapability::TargetDetail)) != 0) {
        scopes |= companionScopeMask(CompanionScope::TargetRead);
    }
    if ((capabilities &
         companionCapabilityMask(CompanionCapability::TargetCompare)) != 0) {
        scopes |= companionScopeMask(CompanionScope::TargetCompare);
    }
    if ((capabilities &
         leshy1::services::companion::
             kCompanionTargetMutationCapabilities) ==
        leshy1::services::companion::
            kCompanionTargetMutationCapabilities) {
        scopes |= companionScopeMask(CompanionScope::TargetMutate);
    }
    return scopes;
}

void writeCompanionFrame(Stream& reply, const char* frame,
                         std::size_t length) {
    if (frame != nullptr && length != 0) {
        reply.write(reinterpret_cast<const std::uint8_t*>(frame), length);
    }
}

class FixedCompanionResponse final : public Stream {
public:
    FixedCompanionResponse(char* output, std::size_t capacity)
        : output_(output), capacity_(capacity) {
        if (output_ != nullptr && capacity_ != 0) output_[0] = '\0';
    }

    std::size_t write(std::uint8_t value) override {
        if (output_ == nullptr || length_ + 1U >= capacity_) {
            overflow_ = true;
            return 0;
        }
        output_[length_++] = static_cast<char>(value);
        output_[length_] = '\0';
        return 1;
    }
    std::size_t write(const std::uint8_t* data,
                      std::size_t size) override {
        if (data == nullptr || output_ == nullptr ||
            length_ + size >= capacity_) {
            overflow_ = true;
            return 0;
        }
        std::memcpy(output_ + length_, data, size);
        length_ += size;
        output_[length_] = '\0';
        return size;
    }
    int available() override { return 0; }
    int read() override { return -1; }
    int peek() override { return -1; }
    void flush() override {}

    bool valid() const { return !overflow_ && length_ != 0; }
    std::size_t length() const { return length_; }

