anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
private:
    char* output_ = nullptr;
    std::size_t capacity_ = 0;
    std::size_t length_ = 0;
    bool overflow_ = false;
};

void emitCompanionConnectParseError(
    Stream& reply,
    leshy1::services::companion::CompanionParseStatus status) {
    char frame[192] = {};
    const int length = std::snprintf(
        frame, sizeof(frame),
        "{\"schema\":\"leshy.companion.response.v1\",\"kind\":\"error\","
        "\"request_id\":\"\",\"status\":\"error\",\"reason\":\"%s\"}\n",
        leshy1::services::companion::companionParseReason(status));
    if (length > 0 && static_cast<std::size_t>(length) < sizeof(frame)) {
        writeCompanionFrame(reply, frame, static_cast<std::size_t>(length));
    }
}

void emitCompanionEncodingError(Stream& reply) {
    reply.println(
        "{\"schema\":\"leshy.companion.response.v1\",\"kind\":\"error\","
        "\"request_id\":\"\",\"status\":\"error\","
        "\"reason\":\"response_encoding_failed\"}");
}

leshy1::services::companion::CompanionMutationId
newCompanionMutationId() {
    namespace companion = leshy1::services::companion;
    companion::CompanionMutationId id{};
    esp_fill_random(id.data(), id.size());
    if (!companion::companionMutationIdValid(id)) {
        id[0] = 0x4c;
        id[1] = 0x53;
        id[2] = static_cast<std::uint8_t>(targetsStateGeneration >> 24U);
        id[3] = static_cast<std::uint8_t>(targetsStateGeneration >> 16U);
        id[4] = static_cast<std::uint8_t>(targetsStateGeneration >> 8U);
        id[5] = static_cast<std::uint8_t>(targetsStateGeneration);
        id.back() = 1;
    }
    return id;
}

bool companionMutationIdEqual(
    const leshy1::services::companion::CompanionMutationId& left,
    const leshy1::services::companion::CompanionMutationId& right) {
    return std::equal(left.begin(), left.end(), right.begin());
}

void setCompanionMutationRequestId(
    const leshy1::services::companion::CompanionMutationRequest& request,
    leshy1::services::companion::CompanionMutationResponse* response) {
    if (response == nullptr) return;
    response->requestId = request.requestId;
    response->requestIdLength = request.requestIdLength;
}

void emitCompanionMutationResponse(
    Stream& reply,
    const leshy1::services::companion::CompanionMutationResponse& response,
    char* frame, std::size_t frameCapacity) {
    std::size_t responseLength = 0;
    if (leshy1::services::companion::encodeCompanionMutationResponse(
            response, frame, frameCapacity, &responseLength)) {
        writeCompanionFrame(reply, frame, responseLength);
    } else {
        emitCompanionEncodingError(reply);
    }
}

void handleCompanionMutation(
    Stream& reply,
    const leshy1::services::companion::CompanionMutationRequest& request,
    char* frame, std::size_t frameCapacity,
    leshy1::services::companion::CompanionConnection& connection,
    CompanionMutationRuntime& mutation, bool webRequest) {
    namespace companion = leshy1::services::companion;
    companion::CompanionMutationResponse response{};
    response.kind = request.kind;
    setCompanionMutationRequestId(request, &response);

    if (request.kind == companion::CompanionMutationRequestKind::Preview) {
        response.actionKind = request.action.kind;
        response.targetId = request.action.targetId;
        response.expectedRevision = request.action.expectedRevision;
        if (targetsMutationState == TargetsMutationState::Saving ||
            mutation.state ==
                companion::CompanionMutationState::Saving) {
            response.status = companion::CompanionMutationStatus::Busy;
            emitCompanionMutationResponse(
                reply, response, frame, frameCapacity);
            return;
        }
        const companion::CompanionReadContext context = companionReadContext();
        const auto assessment = companion::assessCompanionMutationPreview(
            connection, context.targets, request);
        response.status = assessment.status;
        response.targetRevision = assessment.action.revision;
        response.stateGeneration = targetsStateGeneration;
        if (assessment.ready()) {
            mutation = {};
            mutation.state =
                companion::CompanionMutationState::Previewed;
            mutation.status =
                companion::CompanionMutationStatus::Ready;
            mutation.id = newCompanionMutationId();
            mutation.action = request.action;
            mutation.targetRevision = assessment.action.revision;
            mutation.stateGeneration = targetsStateGeneration;
            response.state = mutation.state;
            response.mutationId = mutation.id;
        }
        emitCompanionMutationResponse(reply, response, frame, frameCapacity);
        return;
    }

    const bool known = companion::companionMutationIdValid(
                           mutation.id) &&
        companionMutationIdEqual(request.mutationId,
                                 mutation.id);
    if (!known) {
        response.status = companion::CompanionMutationStatus::UnknownMutation;
        emitCompanionMutationResponse(reply, response, frame, frameCapacity);
        return;
    }
    response.mutationId = mutation.id;
    response.actionKind = mutation.action.kind;
    response.targetId = mutation.action.targetId;
    response.expectedRevision =
        mutation.action.expectedRevision;
    response.targetRevision = mutation.targetRevision;
    response.stateGeneration = mutation.stateGeneration;

    if (!connection.ready() ||
        (connection.grantedScopes &
         companion::kCompanionS65MutationScopes) !=
            companion::kCompanionS65MutationScopes) {
        response.status = connection.ready()
            ? companion::CompanionMutationStatus::CapabilityDenied
            : companion::CompanionMutationStatus::NotConnected;
        emitCompanionMutationResponse(reply, response, frame, frameCapacity);
        return;
    }

    if (request.kind == companion::CompanionMutationRequestKind::Status) {
        response.status = mutation.status;
        response.state = mutation.state;
        emitCompanionMutationResponse(reply, response, frame, frameCapacity);
        return;
    }

    if (mutation.state !=
        companion::CompanionMutationState::Previewed) {
        response.status = companion::CompanionMutationStatus::AlreadyConfirmed;
        response.state = mutation.state;
        emitCompanionMutationResponse(reply, response, frame, frameCapacity);
        return;
    }

