anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    companion::CompanionMutationRequest recheck{};
    recheck.kind = companion::CompanionMutationRequestKind::Preview;
    recheck.action = mutation.action;
    const companion::CompanionReadContext context = companionReadContext();
    const auto assessment = companion::assessCompanionMutationPreview(
        connection, context.targets, recheck);
    if (!assessment.ready()) {
        mutation.status = assessment.status;
        mutation.state = companion::CompanionMutationState::Failed;
        mutation.targetRevision = assessment.action.revision;
        response.status = mutation.status;
        response.state = mutation.state;
        response.targetRevision = mutation.targetRevision;
        emitCompanionMutationResponse(reply, response, frame, frameCapacity);
        return;
    }

    const bool handled = requestTargetsMutationExact(
        mutation.action, true, webRequest);
    if (handled && targetsMutationState == TargetsMutationState::Saving) {
        mutation.status =
            companion::CompanionMutationStatus::Accepted;
        mutation.state = companion::CompanionMutationState::Saving;
    } else {
        mutation.status = companion::CompanionMutationStatus::Failed;
        mutation.state = companion::CompanionMutationState::Failed;
    }
    response.status = mutation.status;
    response.state = mutation.state;
    emitCompanionMutationResponse(reply, response, frame, frameCapacity);
}

void handleCompanionFrame(
    Stream& reply, char* frame, std::size_t frameCapacity,
    leshy1::services::companion::CompanionConnection& connection,
    CompanionMutationRuntime& mutation,
    leshy1::services::companion::CompanionTransport transport,
    bool webRequest) {
    namespace companion = leshy1::services::companion;
    const std::size_t frameLength = std::strlen(frame);
    companion::CompanionConnectRequest connectRequest{};
    const companion::CompanionParseStatus connectStatus =
        companion::parseCompanionConnectRequest(
            frame, frameLength, &connectRequest);
    std::size_t responseLength = 0;
    if (connectStatus == companion::CompanionParseStatus::Parsed) {
        const companion::CompanionReadContext context = companionReadContext();
        const bool hilReadOnly =
            deviceLockProtectedReadHilActive && hilSession.active();
        const companion::CompanionCapabilityMask capabilities =
            companion::companionReadCapabilities(context) |
            (hilReadOnly
                 ? 0U
                 : companion::companionMutationCapabilities(context.targets));
        companion::CompanionConnectionPolicy policy{};
        policy.deviceSessionScopes = companion::kCompanionS65ReadScopes;
        if (!hilReadOnly) {
            policy.deviceSessionScopes |= companion::companionScopeMask(
                companion::CompanionScope::TargetMutate);
        }
        policy.availableScopes = companionAvailableScopes(capabilities);
        policy.availableCapabilities = capabilities;
        connection = companion::negotiateCompanionConnection(
            connectRequest, policy);
        if (connection.ready() &&
            mutation.state !=
                companion::CompanionMutationState::Saving) {
            mutation = {};
        }
        if (companion::encodeCompanionConnectResponse(
                connection, transport, frame,
                frameCapacity, &responseLength)) {
            writeCompanionFrame(reply, frame, responseLength);
        } else {
            emitCompanionEncodingError(reply);
        }
        return;
    }

    if (!deviceLockOperationAllowed(
            leshy1::services::security::DeviceLockOperation::Companion)) {
        char blocked[256] = {};
        const int length = std::snprintf(
            blocked, sizeof(blocked),
            "{\"schema\":\"leshy.device_lock.admission.v1\","
            "\"kind\":\"blocked\",\"operation\":\"companion\","
            "\"access\":\"%s\",\"protected_content_returned\":false}",
            leshy1::services::security::deviceLockAccessName(
                deviceLockLastAdmissionAccess));
        if (length > 0 && static_cast<std::size_t>(length) <
                              sizeof(blocked)) {
            writeCompanionFrame(
                reply, blocked, static_cast<std::size_t>(length));
        } else {
            emitCompanionEncodingError(reply);
        }
        return;
    }

    companion::CompanionMutationRequest mutationRequest{};
    const companion::CompanionMutationParseStatus mutationStatus =
        companion::parseCompanionMutationRequest(
            frame, frameLength, &mutationRequest);
    if (mutationStatus == companion::CompanionMutationParseStatus::Parsed) {
        handleCompanionMutation(
            reply, mutationRequest, frame, frameCapacity, connection,
            mutation, webRequest);
        return;
    }

    companion::CompanionReadRequest readRequest{};
    const companion::CompanionReadParseStatus readStatus =
        companion::parseCompanionReadRequest(
            frame, frameLength, &readRequest);
    if (readStatus == companion::CompanionReadParseStatus::Parsed) {
        const companion::CompanionReadContext context = companionReadContext();
        if (companion::encodeCompanionReadResponse(
                connection, context, readRequest, frame,
                frameCapacity, &responseLength)) {
            writeCompanionFrame(reply, frame, responseLength);
        } else {
            emitCompanionEncodingError(reply);
        }
        return;
    }

    // Routing only selects the most useful parse reason. Both parsers remain
    // authoritative before any scope can be granted or projection executed.
    if (std::strstr(frame, "\"kind\":\"connect\"") != nullptr) {
        emitCompanionConnectParseError(reply, connectStatus);
    } else if (std::strstr(frame, "\"kind\":\"target.mutation.") !=
                   nullptr &&
               companion::encodeCompanionMutationParseError(
                   mutationStatus, frame, frameCapacity, &responseLength)) {
        writeCompanionFrame(reply, frame, responseLength);
    } else if (companion::encodeCompanionReadParseError(
                   readStatus, frame, frameCapacity, &responseLength)) {
        writeCompanionFrame(reply, frame, responseLength);
    } else {
        emitCompanionEncodingError(reply);
    }
}

