anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void handleUsbCompanionFrame(Stream& reply, char* frame,
                             std::size_t frameCapacity) {
    handleCompanionFrame(
        reply, frame, frameCapacity, usbCompanionConnection,
        usbCompanionMutation,
        leshy1::services::companion::CompanionTransport::UsbSerial, false);
}

bool handleWebCompanionRequest(
    char* request, std::size_t requestLength, char* response,
    std::size_t responseCapacity, std::size_t* responseLength,
    void* context) {
    static_cast<void>(context);
    if (request == nullptr || response == nullptr || responseLength == nullptr ||
        requestLength == 0 ||
        requestLength > leshy1::services::companion::kCompanionMaxFrameBytes) {
        return false;
    }
    FixedCompanionResponse reply(response, responseCapacity);
    handleCompanionFrame(
        reply, request,
        leshy1::services::companion::kCompanionMaxFrameBytes + 1U,
        webCompanionConnection, webCompanionMutation,
        leshy1::services::companion::CompanionTransport::LocalWeb, true);
    if (!reply.valid()) {
        *responseLength = 0;
        return false;
    }
    *responseLength = reply.length();
    return true;
}

bool commandRequiresDeviceLockExport(const char* command) {
    if (command == nullptr) return false;
    constexpr std::array<const char*, 10> commands{{
        "ble.inspector.export.raw",
        "capture.export.pcap",
        "library.field-survey.export.native",
        "library.field-survey.export.wigle",
        "capture.subghz.export.csv",
        "capture.ir.export.csv",
        "library.export",
        "library.export.csv",
        "library.export.pcap",
        "library.export.hc22000",
    }};
    for (const char* candidate : commands) {
        if (std::strcmp(command, candidate) == 0) return true;
    }
    return false;
}

void emitDeviceLockBlocked(Stream& reply,
                           leshy1::services::security::DeviceLockOperation
                               operation,
                           leshy1::services::security::DeviceLockAccess
                               access) {
    char line[256] = {};
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.device_lock.admission.v1\","
        "\"kind\":\"blocked\",\"operation\":\"%s\","
        "\"access\":\"%s\",\"protected_content_returned\":false}",
        leshy1::services::security::deviceLockOperationName(operation),
        leshy1::services::security::deviceLockAccessName(access));
    reply.println(line);
}

leshy1::services::serial::SerialConsoleHardware serialConsoleHardware() {
    leshy1::services::serial::SerialConsoleHardware hardware{};
    hardware.externalMux56UartDeclared =
        BoardProfile::kExternalMux56UartDeclared;
    hardware.rfShieldDeclared = BoardProfile::kRfShieldDeclared;
    hardware.gpsDeclared = BoardProfile::kGpsDeclared;
    hardware.pn532Declared = BoardProfile::kPn532Declared;
    hardware.logicMillivolts = 3300U;
    return hardware;
}

leshy1::services::actions::ActionContext serialConsoleActionContext(
    const leshy1::services::actions::ActionDescriptor& descriptor,
    bool confirmed) {
    using leshy1::services::security::DeviceLockState;
    const bool authenticated = deviceLock.state() == DeviceLockState::Unlocked;
    leshy1::services::actions::ActionContext context{};
    context.requestSchemaVersion = descriptor.requestSchemaVersion;
    context.availableCapabilities =
        serialConsoleLastPreflight ==
                leshy1::services::serial::SerialConsolePreflightStatus::Ready
            ? leshy1::services::serial::kExternalMux56UartCapability : 0U;
    context.grantedPermissions = authenticated
        ? descriptor.requiredPermissions : 0U;
    context.authenticated = authenticated;
    context.confirmed = confirmed;
    return context;
}

const char* actionsCliKindName(
    leshy1::services::actions::ActionsCliRequestKind kind) {
    using leshy1::services::actions::ActionsCliRequestKind;
    switch (kind) {
        case ActionsCliRequestKind::Preview: return "preview";
        case ActionsCliRequestKind::Run: return "run";
        case ActionsCliRequestKind::Status: return "status";
        case ActionsCliRequestKind::Cancel: return "cancel";
    }
    return "invalid";
}

void emitSerialConsoleActionState(
    Stream& reply, const char* kind,
    leshy1::services::actions::ActionsCliParseStatus parseStatus,
    leshy1::services::actions::ActionStatus actionStatus) {
    const auto stats = serialConsoleEndpoint.stats();
    const auto resources = serialConsoleActionDispatcher.ownedResources();
    char line[640] = {};
    const char* preflight = parseStatus ==
            leshy1::services::actions::ActionsCliParseStatus::Parsed
        ? leshy1::services::serial::serialConsolePreflightStatusName(
              serialConsoleLastPreflight)
        : "not_evaluated";
    std::snprintf(
        line, sizeof(line),
        "{\"schema\":\"leshy.actions.serial_console.v1\","
        "\"kind\":\"%s\",\"parse\":\"%s\","
        "\"preflight\":\"%s\",\"action_status\":\"%s\","
        "\"active\":%s,\"action\":\"%s\",\"profile\":\"mux56-3v3\","
        "\"mode\":\"%s\",\"baud\":%lu,\"framing\":\"%s\","
        "\"duration_ms\":%lu,\"rx_bytes\":%lu,\"tx_bytes\":%lu,"
        "\"dropped_bytes\":%lu,\"buffered_bytes\":%u,"
        "\"buffer_high_water\":%u,\"resources\":%lu,"
        "\"cleanup_complete\":%s,\"pins_touched\":%s}",
        kind,
        leshy1::services::actions::actionsCliParseStatusName(parseStatus),
        preflight,
        leshy1::services::actions::actionStatusName(actionStatus),
        serialConsoleActionDispatcher.running() ? "true" : "false",
        serialConsoleActionDispatcher.activeActionId(),
        leshy1::services::serial::serialConsoleModeName(
            serialConsoleLastConfig.mode),
        static_cast<unsigned long>(serialConsoleLastConfig.baud),
        leshy1::services::serial::serialConsoleFramingName(
            serialConsoleLastConfig.framing),
        static_cast<unsigned long>(serialConsoleLastConfig.durationMs),
        static_cast<unsigned long>(stats.bytesReceived),
        static_cast<unsigned long>(stats.bytesTransmitted),
        static_cast<unsigned long>(stats.droppedBytes),
        static_cast<unsigned>(stats.bufferedBytes),
        static_cast<unsigned>(stats.highWaterBytes),
        static_cast<unsigned long>(resources),
        stats.cleanupComplete ? "true" : "false",
        stats.active ? "true" : "false");
    reply.println(line);
}

bool handleActionsCliCommand(Stream& reply, const char* command) {
    if (command == nullptr || std::strncmp(command, "action.", 7U) != 0) {
        return false;
    }
    using namespace leshy1::services::actions;
    ActionsCliRequest request{};
    const ActionsCliParseStatus parseStatus = parseActionsCliRequest(
        command, std::strlen(command), &request);
    if (parseStatus != ActionsCliParseStatus::Parsed) {
        emitSerialConsoleActionState(reply, "error", parseStatus,
                                     ActionStatus::InvalidDescriptor);
        return true;
    }

    if (request.kind == ActionsCliRequestKind::Status) {
        emitSerialConsoleActionState(reply, actionsCliKindName(request.kind),
                                     parseStatus,
                                     serialConsoleActionDispatcher.status());
        return true;
    }
    if (request.kind == ActionsCliRequestKind::Cancel) {
        const ActionStatus status = serialConsoleActionDispatcher.cancel();
        emitSerialConsoleActionState(reply, actionsCliKindName(request.kind),
                                     parseStatus, status);
        return true;
    }

    serialConsoleLastConfig = request.serialConfig;
    serialConsoleLastPreflight =
        leshy1::services::serial::validateSerialConsoleConfig(
            request.serialConfig, serialConsoleHardware());
    if (serialConsoleLastPreflight !=
        leshy1::services::serial::SerialConsolePreflightStatus::Ready) {
        emitSerialConsoleActionState(
            reply, actionsCliKindName(request.kind), parseStatus,
            ActionStatus::CapabilityUnavailable);
        return true;
    }

    const ActionDescriptor descriptor =
        leshy1::services::serial::serialConsoleActionDescriptor(
            request.serialConfig);
    const ActionContext context =
        serialConsoleActionContext(descriptor, request.confirmed);
    ActionStatus status = ActionStatus::Ready;
    if (request.kind == ActionsCliRequestKind::Preview) {
        status = serialConsoleActionDispatcher.preview(descriptor, context)
                     .status;
    } else {
        serialConsoleLastPreflight = serialConsoleEndpoint.configure(
            request.serialConfig, serialConsoleHardware());
        status = serialConsoleLastPreflight ==
                leshy1::services::serial::SerialConsolePreflightStatus::Ready
            ? serialConsoleActionDispatcher.invoke(
                  descriptor, context, serialConsoleEndpoint, millis())
            : ActionStatus::CapabilityUnavailable;
        if (status != ActionStatus::Running) {
            serialConsoleEndpoint.cancel();
        }
    }
    emitSerialConsoleActionState(reply, actionsCliKindName(request.kind),
                                 parseStatus, status);
    return true;
}

void serviceSerialConsoleAction() {
    if (safetySupervisor.latched()) {
        if (serialConsoleActionDispatcher.running()) {
            serialConsoleUiActionStatus =
                serialConsoleActionDispatcher.cancel();
            clearSerialConsoleLivePreview();
            if (serialConsoleUiView == SerialConsoleUiView::Running) {
                serialConsoleUiView = SerialConsoleUiView::Result;
            }
            lastRuntimeEvent = "serial_console_safety_cancelled";
        }
        return;
    }
    const std::uint32_t nowMs = millis();
    const auto before = serialConsoleActionDispatcher.status();
    const auto after = serialConsoleActionDispatcher.tick(nowMs);
    bool received = false;
    std::uint8_t value = 0U;
    while (serialConsoleEndpoint.pop(&value)) {
        received = true;
        char printable = value >= 0x20U && value <= 0x7eU
            ? static_cast<char>(value) : ' ';
        if (serialConsoleLiveLineLength + 1U >=
            serialConsoleLiveLine.size()) {
            std::memmove(serialConsoleLiveLine.data(),
                         serialConsoleLiveLine.data() + 1U,
                         serialConsoleLiveLine.size() - 2U);
            serialConsoleLiveLineLength = static_cast<std::uint8_t>(
                serialConsoleLiveLine.size() - 2U);
        }
        serialConsoleLiveLine[serialConsoleLiveLineLength++] = printable;
        serialConsoleLiveLine[serialConsoleLiveLineLength] = '\0';
    }
    if (received) serialConsoleLiveDirty = true;
    if (before == leshy1::services::actions::ActionStatus::Running &&
        after != before) {
        serialConsoleUiActionStatus = after;
        clearSerialConsoleLivePreview();
        if (serialConsoleUiView == SerialConsoleUiView::Running) {
            serialConsoleUiView = SerialConsoleUiView::Result;
        }
        lastRuntimeEvent = "serial_console_terminal";
        if (uiController.page() == kSerialConsolePage) {
            renderInteractiveScreen(false);
        }
        return;
    }
    if (serialConsoleLiveDirty &&
        uiController.page() == kSerialConsolePage &&
        serialConsoleUiView == SerialConsoleUiView::Running &&
        static_cast<std::int32_t>(nowMs - serialConsoleNextUiRefreshMs) >= 0) {
        serialConsoleNextUiRefreshMs = nowMs + 100U;
        renderInteractiveScreen(false);
    }
}

