anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
void handleCommand(Stream& reply, char* command, std::size_t capacity,
                   bool companionAllowed) {
    if (safetySupervisor.latched() &&
        !commandAllowedDuringSafetyStop(command)) {
        reply.println(
            "{\"schema\":\"leshy.safety.v1\",\"kind\":\"blocked\","
            "\"reason\":\"safety_latched\"}");
        return;
    }
    if (!sessionStoreWorkspaceAvailable() &&
        !commandAllowedWhileSessionWorkspaceBorrowed(command)) {
        char line[160] = {};
        std::snprintf(
            line, sizeof(line),
            "{\"schema\":\"leshy.shared_workspace.v1\","
            "\"kind\":\"blocked\",\"reason\":\"session_workspace_borrowed\","
            "\"owner\":\"%s\"}",
            targetsStoreCodecWorkspaceOwnerName());
        reply.println(line);
        return;
    }
    if (commandRequiresDeviceLockExport(command)) {
        const auto access = checkDeviceLockAdmission(
            leshy1::services::security::DeviceLockOperation::Export);
        if (access !=
            leshy1::services::security::DeviceLockAccess::Allowed) {
            emitDeviceLockBlocked(
                reply,
                leshy1::services::security::DeviceLockOperation::Export,
                access);
            return;
        }
    }
    if (companionAllowed && command[0] == '{') {
        handleUsbCompanionFrame(reply, command, capacity);
        return;
    }
    if (handleActionsCliCommand(reply, command)) {
        return;
    }
    if (std::strncmp(command, "hil.begin ", 10) == 0) {
        emitHilSessionBegin(reply, command);
    } else if (std::strcmp(command, "hil.state") == 0) {
        emitHilSessionState(reply);
    } else if (std::strncmp(command, "hil.end ", 8) == 0) {
        emitHilSessionEnd(reply, command);
    } else if (std::strcmp(command, "metrics") == 0) {
        emitMetrics();
    } else if (std::strcmp(command, "inventory") == 0) {
        emitInventory();
    } else if (std::strcmp(command, "hardware.safe-outputs") == 0) {
        emitSafeOutputs(reply);
    } else if (std::strcmp(command, "power.state") == 0) {
        emitPowerState(reply);
    } else if (std::strcmp(command,
                           "power.low-voltage-test confirm") == 0) {
        runPowerLowVoltageAdmissionTest(reply);
    } else if (std::strcmp(command, "power.sleep-test confirm") == 0) {
        runPowerSleepTest(reply);
    } else if (std::strcmp(command, "power.sleep-test state") == 0) {
        emitPowerSleepTestReport(reply);
    } else if (std::strcmp(command, "safety.state") == 0) {
        emitSafetyState(reply);
    } else if (std::strcmp(command, "device-lock.state") == 0) {
        emitDeviceLockState(reply);
    } else if (std::strcmp(command, "device-lock.admission") == 0) {
        emitDeviceLockAdmissionMatrix(reply);
    } else if (std::strncmp(
                   command, "device-lock.persistence-fixture ", 32) == 0) {
        runDeviceLockPersistenceFixture(reply, command);
    } else if (std::strncmp(
                   command, "device-lock.protected-ui-fixture ",
                   sizeof("device-lock.protected-ui-fixture ") - 1U) == 0) {
        runDeviceLockProtectedUiFixture(reply, command);
    } else if (std::strncmp(
                   command, "device-lock.protected-read-fixture ",
                   sizeof("device-lock.protected-read-fixture ") - 1U) == 0) {
        runDeviceLockProtectedReadFixture(reply, command);
    } else if (std::strcmp(
                   command,
                   "device-lock.kdf-benchmark confirm-no-persist") == 0) {
        triggerDeviceLockKdfBenchmark(reply);
    } else if (std::strcmp(command,
                           "safety.watchdog-test confirm") == 0) {
        triggerRuntimeSafetyWatchdogTest(reply);
    } else if (std::strcmp(command,
                           "safety.worker-deadline-test confirm") == 0) {
        triggerWorkerDeadlineTest(reply);
    } else if (std::strcmp(command,
                           "safety.worker-preparation-deadline-test confirm") == 0) {
        triggerPreparationDeadlineTest(reply);
    } else if (std::strcmp(command,
                           "safety.capture-store-deadline-test confirm") == 0) {
        triggerWifiCaptureStoreDeadlineTest(reply);
    } else if (std::strcmp(
                   command,
                   "safety.capture-ir-store-deadline-test confirm") == 0) {
        triggerPulseCaptureStoreDeadlineTest(reply, true);
    } else if (std::strcmp(
                   command,
                   "safety.capture-subghz-store-deadline-test confirm") == 0) {
        triggerPulseCaptureStoreDeadlineTest(reply, false);
    } else if (std::strcmp(command,
                           "safety.early-boot-watchdog-test confirm") == 0) {
        triggerEarlyBootSafetyWatchdogTest(reply);
    } else if (std::strcmp(command,
                           "safety.restart-test confirm") == 0) {
        restartLatchedSafetyStopForTest(reply);
    } else if (std::strcmp(command, "safety.clear confirm") == 0) {
        clearSafetyStopFromConsole(reply);
    } else if (std::strcmp(command, "hardware.shield.receivers") == 0) {
        emitShieldReceiverProbeReport(reply);
    } else if (std::strcmp(command, "hardware.nrf24.spectrum") == 0) {
        emitNrf24SpectrumReport(reply);
    } else if (std::strcmp(command, "hardware.nrf24.finder") == 0) {
        emitNrf24FinderReport(reply);
    } else if (std::strcmp(command, "hardware.cc1101.finder") == 0) {
        emitCc1101FinderReport(reply);
    } else if (std::strcmp(command, "hardware.cc1101.spectrum") == 0) {
        emitCc1101SpectrumReport(reply);
    } else if (std::strcmp(
                   command,
                   "capture.subghz.test-fixture fixed-rx-only") == 0) {
        emitSubGhzRawStoreTestFixture(reply);
    } else if (std::strcmp(command, "ping") == 0) {
        broadcast("{\"schema\":\"leshy.boot.v1\",\"kind\":\"pong\"}");
    } else if (std::strcmp(command, "ui.state") == 0) {
        emitUiState(reply, UiAction::Unknown, false);
    } else if (std::strcmp(
                   command, "targets.merge-split-fixture state") == 0) {
        emitTargetsMergeFixtureState(reply);
    } else if (std::strncmp(
                   command, kTargetsMergeFixturePreparePrefix,
                   std::strlen(kTargetsMergeFixturePreparePrefix)) == 0) {
        char fingerprint[65] = {};
        char runId[33] = {};
        if (parseTargetsMergeFixtureCommand(
                command, kTargetsMergeFixturePreparePrefix, fingerprint,
                sizeof(fingerprint), runId, sizeof(runId))) {
            emitTargetsMergeFixturePrepare(reply, fingerprint, runId);
        } else {
            reply.println(
                "{\"schema\":\"leshy.targets_merge_split_fixture.v1\","
                "\"kind\":\"error\",\"mode\":\"prepare\","
                "\"reason\":\"invalid_explicit_scope\"}");
        }
    } else if (std::strncmp(
                   command, kTargetsMergeFixtureClearPrefix,
                   std::strlen(kTargetsMergeFixtureClearPrefix)) == 0) {
        char fingerprint[65] = {};
        char runId[33] = {};
        if (parseTargetsMergeFixtureCommand(
                command, kTargetsMergeFixtureClearPrefix, fingerprint,
                sizeof(fingerprint), runId, sizeof(runId))) {
            emitTargetsMergeFixtureClear(reply, fingerprint, runId);
        } else {
            reply.println(
                "{\"schema\":\"leshy.targets_merge_split_fixture.v1\","
                "\"kind\":\"error\",\"mode\":\"clear\","
                "\"reason\":\"invalid_explicit_scope\"}");
        }
    } else if (std::strcmp(command, "targets.state") == 0) {
        emitTargetsState(reply);
    } else if (std::strncmp(command, "companion.web.hil-seed ", 23) == 0) {
        armCompanionWebHilEntropy(reply, command);
    } else if (std::strcmp(command, "companion.web.hil-proof") == 0) {
        emitCompanionWebHilProof(reply);
    } else if (std::strcmp(command, "companion.web.state") == 0) {
        emitCompanionWebState(reply);
    } else if (std::strncmp(
                   command, kWifiNetworkHilSelectPrefix,
                   std::strlen(kWifiNetworkHilSelectPrefix)) == 0) {
        std::uint64_t requestedHash = 0U;
        if (parseWifiNetworkHilSelectCommand(command, &requestedHash)) {
            selectWifiNetworkForHil(reply, requestedHash);
        } else {
            char line[512] = {};
            std::snprintf(
                line, sizeof(line),
                "{\"schema\":\"leshy.wifi.network_hil_selector.v1\","
                "\"kind\":\"state\",\"status\":\"invalid_scope\","
                "\"selected\":false,\"match_count\":0,"
                "\"strongest_match\":false,\"hil_active\":%s,"
                "\"display_touched\":false,"
                "\"rf_hardware_touched\":false,\"radio_started\":false,"
                "\"storage_mounted\":false,\"storage_written\":false,"
                "\"identifier_disclosed\":false,"
                "\"response_complete\":true}",
                hilSession.active() ? "true" : "false");
            reply.println(line);
        }
    } else if (std::strncmp(
                   command, kBleDeviceHilSelectPrefix,
                   std::strlen(kBleDeviceHilSelectPrefix)) == 0) {
        std::uint64_t requestedHash = 0U;
        if (parseBleDeviceHilSelectCommand(command, &requestedHash)) {
            selectBleDeviceForHil(reply, requestedHash);
        } else {
            char line[512] = {};
            std::snprintf(
                line, sizeof(line),
                "{\"schema\":\"leshy.ble.device_hil_selector.v1\","
                "\"kind\":\"state\",\"status\":\"invalid_scope\","
                "\"selected\":false,\"match_count\":0,"
                "\"strongest_match\":false,\"connectable\":false,"
                "\"hil_active\":%s,\"navigation_locked\":false,"
                "\"display_touched\":false,"
                "\"rf_hardware_touched\":false,\"radio_started\":false,"
                "\"storage_mounted\":false,\"storage_written\":false,"
                "\"identifier_disclosed\":false,"
                "\"response_complete\":true}",
                hilSession.active() ? "true" : "false");
            reply.println(line);
        }
    } else if (std::strcmp(command, "wifi.network.detail") == 0) {
        emitWifiNetworkDetailState(reply);
    } else if (std::strcmp(
                   command,
                   "wifi.authentication.hil-hold-survey-stop once") == 0) {
        emitWifiAuthenticationHilHold(reply);
    } else if (std::strcmp(
                   command,
                   "wifi.authentication.hil-load-synthetic-report once") ==
               0) {
        emitWifiAuthenticationSyntheticHilReport(reply);
    } else if (std::strcmp(
                   command,
                   "wifi.authentication.hil-load-persistence-fixture once") ==
               0) {
        emitWifiAuthenticationPersistenceHilFixture(reply);
    } else if (std::strcmp(command, "wifi.authentication.state") == 0) {
        emitWifiAuthenticationCaptureState(reply);
    } else if (std::strcmp(
                   command, "wifi.authentication.persistence.state") == 0) {
        emitWifiAuthenticationPersistenceState(reply);
    } else if (std::strcmp(command, "ble.device.detail") == 0) {
        emitBleDeviceDetailState(reply);
    } else if (std::strcmp(command, "ble.inspector.state") == 0) {
        emitBleInspectorCaptureState(reply);
    } else if (std::strcmp(command, "ble.inspector.gatt.state") == 0) {
        emitBleGattInspectorState(reply);
    } else if (std::strncmp(
                   command, "ble.inspector.gatt.hil-fault ",
                   std::strlen("ble.inspector.gatt.hil-fault ")) == 0) {
        emitBleGattHilFault(reply, command);
    } else if (std::strcmp(command, "ble.inspector.export.raw") == 0) {
        emitBleInspectorCaptureExport(reply);
    } else if (std::strcmp(command, "survey.browser") == 0) {
        emitSurveyBrowser(reply);
    } else if (std::strcmp(command, "survey.field-visit") == 0) {
        emitFieldSurveyState(reply);
    } else if (std::strcmp(
                   command, "survey.field-visit.test-incomplete once") == 0) {
        emitFieldSurveyIncompleteTest(reply);
    } else if (std::strcmp(command, "capture.state") == 0) {
        emitWifiFrameCaptureState(reply);
    } else if (std::strcmp(command, "airspace.guard.state") == 0) {
        emitAirspaceGuardState(reply);
    } else if (std::strcmp(command, "capture.export.pcap") == 0) {
        emitWifiFrameCapturePcap(reply);
    } else if (std::strcmp(
                   command, "library.field-survey.export.native") == 0) {
        emitLibraryFieldSurveyNative(reply);
    } else if (std::strcmp(
                   command, "library.field-survey.export.wigle") == 0) {
        emitLibraryFieldSurveyWigle(reply);
    } else if (std::strcmp(command, "capture.subghz.state") == 0) {
        emitSubGhzRawCaptureState(reply);
    } else if (std::strcmp(command,
                           "capture.subghz.export.csv") == 0) {
        emitSubGhzRawCaptureCsv(reply);
    } else if (std::strcmp(command, "capture.ir.state") == 0) {
        emitInfraredRawCaptureState(reply);
    } else if (std::strcmp(command, "capture.ir.export.csv") == 0) {
        emitInfraredRawCaptureCsv(reply);
    } else if (std::strcmp(command, "input.state") == 0) {
        emitInputState(reply);
    } else if (std::strcmp(command, "touch.state") == 0) {
        emitTouchState(reply);
    } else if (std::strcmp(command, "touch.calibrate confirm") == 0) {
        calibrateTouch(reply);
    } else if (std::strncmp(command, "ui.touch ", 9) == 0) {
        handleSyntheticTouch(reply, command);
    } else if (std::strcmp(command, "self-test.report") == 0) {
        emitSelfTestReport(reply);
    } else if (std::strcmp(command, "self-test.active-rf") == 0) {
        emitFullGuidedRfReport(reply);
    } else if (std::strcmp(command, "self-test.active-artifact") == 0) {
        emitFullGuidedArtifactReport(reply);
    } else if (std::strncmp(command, "ui.language ", 12) == 0) {
        UiLanguage requested = UiLanguage::English;
        if (!leshy1::ui::uiLanguageFromName(command + 12, &requested)) {
            reply.println("{\"schema\":\"leshy.ui.language.v1\","
                          "\"kind\":\"error\",\"reason\":\"invalid_language\"}");
        } else if (!saveUiLanguage(requested)) {
            reply.println("{\"schema\":\"leshy.ui.language.v1\","
                          "\"kind\":\"error\",\"reason\":\"persist_failed\"}");
        } else {
            const bool changed = languageController.active() != requested;
            languageController.restore(requested);
            lastRuntimeEvent = "language_persisted";
            renderInteractiveScreen();
            emitUiState(reply, UiAction::Unknown, changed);
        }
    } else if (std::strncmp(command, "ui.key ", 7) == 0) {
        const UiAction action = leshy1::ui::uiActionFromName(command + 7);
        if (action == UiAction::Unknown) {
            reply.println("{\"schema\":\"leshy.ui.v1\",\"kind\":\"error\","
                          "\"reason\":\"unknown_action\"}");
        } else {
            emitUiState(reply, action, applyUiAction(action));
        }
    } else if (std::strcmp(command, "ui.capture") == 0) {
        captureDisplay(reply);
    } else if (std::strcmp(command, "storage.contract") == 0) {
        emitStorageContract(reply);
    } else if (std::strcmp(command, "storage.guard") == 0) {
        emitStorageGuard(reply);
    } else if (std::strcmp(command, "storage.discovery") == 0) {
        emitStorageDiscovery(reply);
    } else if (std::strcmp(command, "storage.mount.policy") == 0) {
        emitStorageMountPolicy(reply);
    } else if (std::strcmp(command, "storage.product.boot-recovery") == 0) {
        emitProductBootRecovery(reply);
    } else if (std::strcmp(
                   command,
                   "airspace-guard.test-capacity-drop once") == 0 ||
               std::strcmp(
                   command,
                   "airspace-guard.test-capacity-drop clear") == 0) {
        emitAirspaceGuardCapacityDropTest(reply, command);
    } else if (std::strcmp(
                   command,
                   "storage.product.boot-watchdog-test confirm") == 0) {
        triggerProductBootWatchdogTest(reply);
    } else if (std::strcmp(command, "storage.product.unenroll confirm") == 0) {
        emitProductUnenrollment(reply);
    } else if (std::strcmp(command, "survey.product.admission") == 0) {
        emitProductSurveyAdmission(reply);
    } else if (std::strncmp(
                   command, "survey.product.test-source-unavailable ", 39) == 0) {
        emitProductSurveySourceUnavailableTest(reply, command);
    } else if (std::strncmp(
                   command, "survey.product.test-runtime-unavailable ", 40) == 0) {
        emitProductSurveyRuntimeUnavailableTest(reply, command);
    } else if (std::strncmp(command, kLittleFsParityPrefix,
                            std::strlen(kLittleFsParityPrefix)) == 0) {
        char fingerprint[65] = {};
        char runId[33] = {};
        if (parseLittleFsParityCommand(
                command, fingerprint, sizeof(fingerprint), runId,
                sizeof(runId))) {
            emitLittleFsParity(reply, fingerprint, runId);
        } else {
            reply.println(
                "{\"schema\":\"leshy.storage.littlefs.parity.v1\","
                "\"kind\":\"error\",\"reason\":\"invalid_explicit_scope\"}");
        }
    } else if (std::strncmp(
                   command, kLittleFsResetRecoverPrefix,
                   std::strlen(kLittleFsResetRecoverPrefix)) == 0) {
        char fingerprint[65] = {};
        char runId[33] = {};
        unsigned boundaryNumber = 0;
        if (parseLittleFsResetCommand(
                command, kLittleFsResetRecoverPrefix, fingerprint,
                sizeof(fingerprint), runId, sizeof(runId), &boundaryNumber)) {
            emitLittleFsResetRecovery(
                reply, fingerprint, runId, boundaryNumber);
        } else {
            reply.println(
                "{\"schema\":\"leshy.storage.littlefs.reset.v1\","
                "\"kind\":\"error\",\"mode\":\"recovery\","
                "\"reason\":\"invalid_explicit_scope\"}");
        }
    } else if (std::strncmp(command, kLittleFsResetPrefix,
                            std::strlen(kLittleFsResetPrefix)) == 0) {
        char fingerprint[65] = {};
        char runId[33] = {};
        unsigned boundaryNumber = 0;
        if (parseLittleFsResetCommand(
                command, kLittleFsResetPrefix, fingerprint,
                sizeof(fingerprint), runId, sizeof(runId), &boundaryNumber)) {
            emitLittleFsResetArm(reply, fingerprint, runId, boundaryNumber);
        } else {
            reply.println(
                "{\"schema\":\"leshy.storage.littlefs.reset.v1\","
                "\"kind\":\"error\",\"mode\":\"arm\","
                "\"reason\":\"invalid_explicit_scope\"}");
        }
    } else if (std::strcmp(command, "storage.sd.protocol") == 0) {
        emitSdReadOnlyProtocol(reply);
    } else if (std::strcmp(command, "storage.sd.identification.fixture") == 0) {
        emitSdIdentificationFixture(reply);
    } else if (std::strcmp(command, "storage.sd.transport.fixture") == 0) {
        emitSdTransportFixture(reply);
    } else if (std::strcmp(command, "storage.sd.wire") == 0) {
        emitSdWireContract(reply);
    } else if (std::strcmp(command,
                           "storage.sd.identify disposable-read-only") == 0) {
        emitPhysicalSdIdentification(reply);
    } else if (std::strcmp(command,
                           "storage.sd.inspect-lba0 disposable-read-only") == 0) {
        emitPhysicalSdSector0(reply);
    } else if (std::strcmp(command,
                           "storage.sd.inspect-boot disposable-read-only") == 0) {
        emitPhysicalSdBoot(reply);
    } else if (std::strcmp(command,
                           "storage.sd.inspect-fsinfo disposable-read-only") == 0) {
        emitPhysicalSdFsInfo(reply);
    } else if (std::strcmp(
                   command,
                   "storage.sd.inspect-fat-reserved disposable-read-only") == 0) {
        emitPhysicalSdFatReserved(reply);
    } else if (std::strcmp(
                   command,
                   "storage.sd.inspect-root-cluster disposable-read-only") == 0) {
        emitPhysicalSdRootMetadata(reply);
    } else if (std::strncmp(command, kSdReadOnlyMountPrefix,
                            std::strlen(kSdReadOnlyMountPrefix)) == 0) {
        char fingerprint[33] = {};
        if (parseExactFingerprintCommand(
                command, kSdReadOnlyMountPrefix, fingerprint,
                sizeof(fingerprint))) {
            emitPhysicalSdReadOnlyMount(reply, fingerprint);
        } else {
            reply.println(
                "{\"schema\":\"leshy.storage.sd.readonly_mount.v1\","
                "\"kind\":\"error\",\"reason\":\"invalid_explicit_scope\"}");
        }
    } else if (std::strncmp(command, kProductBootstrapPrefix,
                            std::strlen(kProductBootstrapPrefix)) == 0) {
        char fingerprint[33] = {};
        if (parseExactFingerprintCommand(
                command, kProductBootstrapPrefix, fingerprint,
                sizeof(fingerprint))) {
            emitProductStoreBootstrap(reply, fingerprint);
        } else {
            reply.println(
                "{\"schema\":\"leshy.storage.product_bootstrap.v1\","
                "\"kind\":\"error\",\"reason\":\"invalid_explicit_scope\"}");
        }
    } else if (std::strncmp(command, kProductEnrollPrefix,
                            std::strlen(kProductEnrollPrefix)) == 0) {
        char fingerprint[33] = {};
        if (parseExactFingerprintCommand(
                command, kProductEnrollPrefix, fingerprint,
                sizeof(fingerprint))) {
            emitProductEnrollment(reply, fingerprint);
        } else {
            reply.println(
                "{\"schema\":\"leshy.storage.product_enrollment.v1\","
                "\"kind\":\"error\",\"mode\":\"enroll\","
                "\"reason\":\"invalid_explicit_scope\"}");
        }
    } else if (std::strncmp(command, kSdSessionPowerCutPrefix,
                            std::strlen(kSdSessionPowerCutPrefix)) == 0) {
        char fingerprint[33] = {};
        char runId[33] = {};
        unsigned boundaryNumber = 0;
        if (parseSdSessionResetCommand(
                command, kSdSessionPowerCutPrefix, fingerprint,
                sizeof(fingerprint), runId, sizeof(runId), &boundaryNumber)) {
            emitPhysicalSdSessionResetArm(reply, fingerprint, runId,
                                          boundaryNumber, true);
        } else {
            reply.println(
                "{\"schema\":\"leshy.storage.sd.session_store_reset.v1\","
                "\"kind\":\"error\",\"mode\":\"power_cut_arm\","
                "\"reason\":\"invalid_explicit_scope\"}");
        }
    } else if (std::strncmp(command, kSdSessionPowerCutRecoverPrefix,
                            std::strlen(kSdSessionPowerCutRecoverPrefix)) == 0) {
        char fingerprint[33] = {};
        char runId[33] = {};
        unsigned boundaryNumber = 0;
        if (parseSdSessionResetCommand(
                command, kSdSessionPowerCutRecoverPrefix, fingerprint,
                sizeof(fingerprint), runId, sizeof(runId), &boundaryNumber)) {
            emitPhysicalSdSessionResetRecovery(reply, fingerprint, runId,
                                               boundaryNumber, true);
        } else {
            reply.println(
                "{\"schema\":\"leshy.storage.sd.session_store_reset.v1\","
                "\"kind\":\"error\",\"mode\":\"power_cut_recovery\","
                "\"reason\":\"invalid_explicit_scope\"}");
        }
