anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    } else if (std::strncmp(command, kSdSessionResetPrefix,
                            std::strlen(kSdSessionResetPrefix)) == 0) {
        char fingerprint[33] = {};
        char runId[33] = {};
        unsigned boundaryNumber = 0;
        if (parseSdSessionResetCommand(
                command, kSdSessionResetPrefix, fingerprint,
                sizeof(fingerprint), runId, sizeof(runId), &boundaryNumber)) {
            emitPhysicalSdSessionResetArm(reply, fingerprint, runId,
                                          boundaryNumber, false);
        } else {
            reply.println(
                "{\"schema\":\"leshy.storage.sd.session_store_reset.v1\","
                "\"kind\":\"error\",\"mode\":\"arm\","
                "\"reason\":\"invalid_explicit_scope\"}");
        }
    } else if (std::strncmp(command, kSdSessionRecoverPrefix,
                            std::strlen(kSdSessionRecoverPrefix)) == 0) {
        char fingerprint[33] = {};
        char runId[33] = {};
        unsigned boundaryNumber = 0;
        if (parseSdSessionResetCommand(
                command, kSdSessionRecoverPrefix, fingerprint,
                sizeof(fingerprint), runId, sizeof(runId), &boundaryNumber)) {
            emitPhysicalSdSessionResetRecovery(reply, fingerprint, runId,
                                               boundaryNumber, false);
        } else {
            reply.println(
                "{\"schema\":\"leshy.storage.sd.session_store_reset.v1\","
                "\"kind\":\"error\",\"mode\":\"recovery\","
                "\"reason\":\"invalid_explicit_scope\"}");
        }
    } else if (std::strncmp(command, kSdSessionBatchThroughputPrefix,
                            std::strlen(kSdSessionBatchThroughputPrefix)) == 0) {
        char fingerprint[33] = {};
        char runId[33] = {};
        if (parseSdSessionStoreCommand(
                command, kSdSessionBatchThroughputPrefix, fingerprint,
                sizeof(fingerprint), runId, sizeof(runId))) {
            emitPhysicalSdSessionStore(reply, fingerprint, runId, true, true,
                                       false, 0);
        } else {
            reply.println(
                "{\"schema\":\"leshy.storage.sd.session_store_batch_throughput.v1\","
                "\"kind\":\"error\",\"reason\":\"invalid_explicit_scope\"}");
        }
    } else if (std::strncmp(command, kSdSessionThroughputPrefix,
                            std::strlen(kSdSessionThroughputPrefix)) == 0) {
        char fingerprint[33] = {};
        char runId[33] = {};
        if (parseSdSessionStoreCommand(
                command, kSdSessionThroughputPrefix, fingerprint,
                sizeof(fingerprint), runId, sizeof(runId))) {
            emitPhysicalSdSessionStore(reply, fingerprint, runId, true, false,
                                       false, 0);
        } else {
            reply.println(
                "{\"schema\":\"leshy.storage.sd.session_store_throughput.v1\","
                "\"kind\":\"error\",\"reason\":\"invalid_explicit_scope\"}");
        }
    } else if (std::strncmp(command, kSdSessionStorePrefix,
                            std::strlen(kSdSessionStorePrefix)) == 0) {
        char fingerprint[33] = {};
        char runId[33] = {};
        if (parseSdSessionStoreCommand(
                command, kSdSessionStorePrefix, fingerprint,
                sizeof(fingerprint), runId, sizeof(runId))) {
            emitPhysicalSdSessionStore(reply, fingerprint, runId, false, false,
                                       false, 0);
        } else {
            reply.println(
                "{\"schema\":\"leshy.storage.sd.session_store.v1\","
                "\"kind\":\"error\",\"reason\":\"invalid_explicit_scope\"}");
        }
    } else if (std::strncmp(command, kWifiPersistPrefix,
                            std::strlen(kWifiPersistPrefix)) == 0) {
        char fingerprint[33] = {};
        char runId[33] = {};
        unsigned maximumScans = 0;
        if (parseWifiPersistCommand(
                command, fingerprint, sizeof(fingerprint), runId,
                sizeof(runId), &maximumScans)) {
            emitPhysicalSdSessionStore(reply, fingerprint, runId, false,
                                       false, true, maximumScans);
        } else {
            reply.println(
                "{\"schema\":\"leshy.survey.wifi_passive_persist.v1\","
                "\"kind\":\"error\",\"reason\":\"invalid_explicit_scope\"}");
        }
    } else if (std::strncmp(command, kWifiIngressPrefix,
                            std::strlen(kWifiIngressPrefix)) == 0) {
        unsigned samples = 0;
        if (parseWifiIngressCommand(command, &samples)) {
            emitPhysicalWifiPassiveIngress(reply, samples);
        } else {
            reply.println(
                "{\"schema\":\"leshy.survey.wifi_passive_ingress.v1\","
                "\"kind\":\"error\",\"reason\":\"invalid_explicit_scope\"}");
        }
    } else if (std::strcmp(command, "survey.contract") == 0) {
        emitSurveyContract(reply);
    } else if (std::strcmp(command, "session.fixture") == 0) {
        emitSessionFixture(reply);
    } else if (std::strcmp(command, "session.store.fixture") == 0) {
        emitSessionStoreFixture(reply);
    } else if (std::strcmp(command, "library.fixture") == 0) {
        emitLibraryFixture(reply);
    } else if (std::strcmp(command, "library.export") == 0) {
        emitLibraryExport(reply);
    } else if (std::strcmp(command, "library.capture") == 0) {
        emitLibraryCaptureMetadata(reply);
    } else if (std::strcmp(command, "library.export.csv") == 0) {
        emitLibraryCsvExport(reply);
    } else if (std::strcmp(command, "library.export.pcap") == 0) {
        emitLibraryPcapStatus(reply);
    } else if (std::strcmp(command, "library.export.hc22000") == 0) {
        emitLibraryHc22000(reply);
    } else if (command[0] != '\0') {
        reply.println("{\"schema\":\"leshy.boot.v1\",\"kind\":\"error\","
                      "\"reason\":\"unknown_command\"}");
    }
}

void poll(Stream& stream, char* command, std::size_t& length,
          std::size_t capacity, bool companionAllowed, bool& overflow) {
    while (stream.available() > 0) {
        const char value = static_cast<char>(stream.read());
        if (value == '\r') continue;
        if (value == '\n') {
            if (overflow) {
                if (companionAllowed) {
                    std::size_t responseLength = 0;
                    if (leshy1::services::companion::
                            encodeCompanionReadParseError(
                                leshy1::services::companion::
                                    CompanionReadParseStatus::TooLarge,
                                command, capacity, &responseLength)) {
                        writeCompanionFrame(
                            stream, command, responseLength);
                    } else {
                        emitCompanionEncodingError(stream);
                    }
                } else {
                    stream.println(
                        "{\"schema\":\"leshy.boot.v1\",\"kind\":\"error\","
                        "\"reason\":\"frame_too_large\"}");
                }
            } else {
                command[length] = '\0';
                handleCommand(stream, command, capacity, companionAllowed);
            }
            length = 0;
            overflow = false;
        } else if (length + 1 < capacity) {
            if (!overflow) command[length++] = value;
        } else {
            overflow = true;
        }
    }
}

}  // namespace

void setup() {
    bootMetrics.setupEnterUs = static_cast<std::uint64_t>(esp_timer_get_time());
    BoardSafeOutputs::establishBootInvariant();
    Serial.setRxBufferSize(kUsbRxBufferCapacity);
    Serial.begin(kConsoleBaud);
    Serial0.begin(kConsoleBaud);
    // ESP-IDF lazily allocates the newlib stream and UART VFS locks on the
    // first system log write.  A Wi-Fi scan can otherwise make that first
    // write while the radio heaps are at their low-water mark, where the
    // lock allocator aborts instead of returning an error.  Pre-warm the
    // locks while the boot heap is unconstrained.
    std::fputc('\n', stdout);
    std::fflush(stdout);
    BoardSdSpiTransport::holdRadioTransmitPathsInactive();
    const bool flashMatches = ESP.getFlashChipSize() == BoardProfile::kExpectedFlashBytes;
    const bool psramMatches = psramFound() == BoardProfile::kExpectedPsram;

    bootMetrics.version = LESHY1_VERSION;
    bootMetrics.profile = BoardProfile::kId;
    bootMetrics.profileRevision = BoardProfile::kEnvelopeRevision;
    const esp_app_desc_t* appDescription = esp_app_get_description();
    if (appDescription != nullptr &&
        appDescription->magic_word == ESP_APP_DESC_MAGIC_WORD) {
        constexpr char kHex[] = "0123456789abcdef";
        for (std::size_t i = 0; i < sizeof(appDescription->app_elf_sha256); ++i) {
            const std::uint8_t value = appDescription->app_elf_sha256[i];
            runningAppElfSha256[i * 2] = kHex[value >> 4U];
            runningAppElfSha256[i * 2 + 1] = kHex[value & 0x0FU];
        }
        runningAppElfSha256[64] = '\0';
        std::memcpy(&runningAppIdentity, appDescription->app_elf_sha256,
                    sizeof(runningAppIdentity));
    }
    bootMetrics.appElfSha256 = runningAppElfSha256;
    bootMetrics.resetReason = static_cast<std::uint32_t>(esp_reset_reason());
    earlyBootGuardTrippedAtBoot =
        earlyBootGuardTripRtcState == kEarlyBootGuardTripRtcMagic &&
        earlyBootGuardTripRtcStateInverse == ~kEarlyBootGuardTripRtcMagic;
    earlyBootGuardTripRtcState = 0;
    earlyBootGuardTripRtcStateInverse = 0;
    if (earlyBootGuardTrippedAtBoot) {
        persistSafetyStop(SafetyReason::RuntimeWatchdog, 1, 1);
    }
    const SafetyRetainedRecord retainedSafety = snapshotSafetyRetainedRecord();
    safetySupervisor.restore(
        retainedSafety, runningAppIdentity,
        safetyWatchdogResetReason(bootMetrics.resetReason));
    if (safetySupervisor.latched()) {
        confirmRetainedSafetyLatch(retainedSafety);
    } else {
        clearSafetyRetainedRecord();
    }
    bootMetrics.flashBytes = ESP.getFlashChipSize();
    bootMetrics.psramFound = psramFound();
    bootMetrics.psramBytes = ESP.getPsramSize();
    bootMetrics.heapTotal = ESP.getHeapSize();
    bootMetrics.buzzerSafetyConfigured = true;
    bootMetrics.buzzerInactive = BoardSafeOutputs::buzzerHeldInactive();
    bootMetrics.runtimeReadyUs = static_cast<std::uint64_t>(esp_timer_get_time());

    // Transfer protection from the pre-app RTC guard to the loop-task WDT.
    // The exact-app ISR latch is already restorable and every software output
    // is at its boot-safe level before the RTC guard is released.
    if (!armRuntimeSafetyWatchdog()) {
        latchSafetyStopInTask(SafetyReason::SupervisorUnavailable);
    } else {
        disarmEarlyBootGuard();
    }

    // Restore only: dev.277 links and exercises the production crypto/store
    // boundary without silently enrolling or weakening an existing device.
    // UI setup and protected-operation admission are the next CAP-052 slice.
    deviceLockRestoreSucceeded = deviceLock.restore(
        static_cast<std::uint64_t>(esp_timer_get_time()));

    interfaceSettingsController.restore(loadUiBrightnessIndex(), loadUiTheme());
    antennaStatusController.restoreBrightness(
        loadStatusLedBrightnessIndex());
    boardAntennaStatusLeds.begin(antennaStatusController.brightnessRaw());
    leshy1::ui::visual::applyTheme(interfaceSettingsController.theme());
    ledcAttach(BoardProfile::kBacklightPin, 5000, 8);
    ledcWrite(BoardProfile::kBacklightPin,
              interfaceSettingsController.brightnessDuty());
    display.init();
    display.setRotation(2);
    boardTouchInput.begin(display, millis());
    touchCalibrationRequiredAtBoot =
        boardTouchInput.calibrationSource() ==
        leshy1::platform::arduino::TouchCalibrationSource::DefaultProfile;
    touchCalibrationSucceededAtBoot = !touchCalibrationRequiredAtBoot;
    languageController.restore(loadUiLanguage());
    bootMetrics.displayReadyUs = static_cast<std::uint64_t>(esp_timer_get_time());
    feedRuntimeSafetyWatchdog();

