anton-vinogradov/esp32-leshy/firmware/leshy1/src/platform/arduino/ArduinoEntry.cpp
    Wire.begin(BoardProfile::kI2cSdaPin, BoardProfile::kI2cSclPin, kI2cHz);
    bootMetrics.inputDetected =
        probeInputAtBoot(&lastInputRaw, &bootMetrics.inputProbeAttempts);
    powerManagerAddressAck =
        probeI2cAddressAck(BoardProfile::kPowerManagerAddress);
    bootMetrics.inputProbeTransientRetries =
        bootMetrics.inputProbeAttempts == 0
            ? 0
            : static_cast<std::uint8_t>(bootMetrics.inputProbeAttempts - 1U);
    bootMetrics.inputRaw = lastInputRaw;
    physicalButtonInput.reset(lastInputRaw, millis());
    physicalInputEvents = xQueueCreate(kPhysicalInputQueueCapacity,
                                       sizeof(PhysicalInputEvent));
    if (physicalInputEvents != nullptr) {
        physicalInputTaskStarted =
            xTaskCreatePinnedToCore(pollPhysicalInput, "leshy-input", 4096,
                                    nullptr, 2, &physicalInputTaskHandle, 0) == pdPASS;
    }
    bootMetrics.inputDetected =
        bootMetrics.inputDetected && physicalInputTaskStarted;
    bootMetrics.inputReadyUs = static_cast<std::uint64_t>(esp_timer_get_time());
    feedRuntimeSafetyWatchdog();
    if (!safetySupervisor.latched()) {
        surveyDemoReady = prepareSurveyDemo();
        libraryDemoReady = prepareLibraryDemo();
        recoverProductCatalogAtBoot();
        storageDiscovery = boardStorageAdapter.discoverReadOnly();
        storageDiscoveryReady =
            leshy1::storage::validateMediaDiscovery(storageDiscovery) ==
            leshy1::storage::MediaDiscoveryValidation::Valid;
        productSurveyWorkerReady = initializeProductSurveyWorker();
        captureStoreEvents = xQueueCreate(1, sizeof(CaptureStoreEvent));
        subGhzCaptureStoreEvents = xQueueCreate(1, sizeof(CaptureStoreEvent));
        infraredCaptureStoreEvents = xQueueCreate(1, sizeof(CaptureStoreEvent));
        targetsMutationEvents = xQueueCreate(1, sizeof(TargetsMutationEvent));
        deviceLockWorkerEvents = xQueueCreate(
            1, sizeof(DeviceLockWorkerEvent));
    } else {
        productBootRecovery.status = "safety_latched";
        productBootRecovery.cleanupComplete = true;
    }
    feedRuntimeSafetyWatchdog();
    if (!BoardSafeOutputs::buzzerHeldInactive() ||
        !BoardSafeOutputs::radioTransmitPathsHeldInactive()) {
        latchSafetyStopInTask(SafetyReason::OutputInvariant);
    }

    inventory.add({"board.profile",
                   flashMatches && psramMatches ? CapabilityState::Available
                                                : CapabilityState::Fault,
                   "runtime_flash_psram",
                   flashMatches && psramMatches ? "profile_match" : "profile_mismatch"});
    inventory.add({"display.tft", CapabilityState::Declared, "render_attempted",
                   "awaiting_visual_observation"});
    inventory.add({"output.buzzer.safe",
                   bootMetrics.buzzerInactive ? CapabilityState::Available
                                              : CapabilityState::Fault,
                   "gpio2_output_low_runtime_check",
                   bootMetrics.buzzerInactive ? "inactive_boot_invariant"
                                              : "unsafe_level_or_mode"});
    inventory.add({
        "safety.supervisor",
        safetySupervisor.latched() || runtimeSafetyWatchdogReady
            ? CapabilityState::Available : CapabilityState::Declared,
        "panic_task_wdt_plus_rtc_latch",
        safetySupervisor.latched() ? "latched_safe_mode"
                                   : "runtime_watchdog_armed"});
    inventory.add({
        "security.device_lock",
        deviceLockRestoreSucceeded ? CapabilityState::Declared
                                   : CapabilityState::Fault,
        "pbkdf2_sha256_nvs_record_v1",
        leshy1::services::security::deviceLockStateName(deviceLock.state())});
    inventory.add({"input.pcf8574",
                   bootMetrics.inputDetected ? CapabilityState::Detected
                                             : CapabilityState::Unknown,
                   "i2c_read_only_0x20",
                   bootMetrics.inputDetected ? "raw_byte_available" : "no_read_response"});
    inventory.add({
        "power.manager",
        powerManagerAddressAck ? CapabilityState::Detected
                               : CapabilityState::Unknown,
        "i2c_address_only_ack_0x75",
        powerManagerAddressAck ? "present_register_map_unidentified"
                               : "no_address_ack"});
    inventory.add({
        "power.voltage",
        CapabilityState::Unknown,
        "gpio2_reserved_output_low",
        "unavailable_buzzer_shared_adc_forbidden"});
    inventory.add({
        "power.safe_write",
        CapabilityState::Available,
        "atomic_store_plus_confirmed_low_voltage_gate",
        "atomic_only_without_trusted_voltage"});
    inventory.add({
        "power.sleep_resume",
        CapabilityState::Declared,
        "bounded_timer_light_sleep",
        "runtime_gate_available"});
    inventory.add({
        "input.touch",
        boardTouchInput.ready() ? CapabilityState::Available
                                : CapabilityState::Declared,
        leshy1::platform::arduino::touchCalibrationSourceName(
            boardTouchInput.calibrationSource()),
        boardTouchInput.calibrationSource() == TouchCalibrationSource::Leshy1
            ? "v1_calibration_loaded"
            : (boardTouchInput.calibrationSource() ==
                       TouchCalibrationSource::Legacy0x
                   ? "legacy_0x_calibration_loaded"
                   : "calibration_required")});
    inventory.add({"radio.wifi", CapabilityState::Declared, "esp32_s3_builtin",
                   "passive_contract_ready_driver_not_started"});
    inventory.add({
        "capture.wifi_passive",
        flashMatches && psramMatches ? CapabilityState::Available
                                     : CapabilityState::Fault,
        "explicit_promiscuous_rx_only_adapter",
        flashMatches && psramMatches ? "bounded_ram_capture_ready"
                                     : "board_profile_mismatch"});
    inventory.add({
        "capture.wifi_persistent",
        captureStoreEvents != nullptr && productBootRecovery.catalogAdmitted
            ? CapabilityState::Available : CapabilityState::Fault,
        "schema_v4_exact_media_background_commit",
        captureStoreEvents != nullptr && productBootRecovery.catalogAdmitted
            ? "privacy_confirmed_atomic_capture_ready"
            : "capture_worker_or_exact_media_unavailable"});
    inventory.add({
        "radio.ble",
        productSurveyWorkerReady && productBootRecovery.catalogAdmitted
            ? CapabilityState::Available : CapabilityState::Declared,
        "esp32_s3_builtin_receive_only_bounded_lifecycle",
        productSurveyWorkerReady && productBootRecovery.catalogAdmitted
            ? "passive_ble_worker_ready"
            : "worker_or_media_unavailable"});
    inventory.add({"survey.simulated",
                   surveyDemoReady ? CapabilityState::Available : CapabilityState::Fault,
                   "E-SURVEY-001_golden_trace",
                   surveyDemoReady ? "golden_data_rf_off" : "golden_data_invalid"});
    inventory.add({"library.simulated",
                   libraryDemoReady ? CapabilityState::Available : CapabilityState::Fault,
                   "E-STORAGE-005_ram_reopen",
                   libraryDemoReady ? "volatile_offline_fixture" : "ram_fixture_invalid"});
    if (productBootRecovery.catalogAdmitted) {
        inventory.add({"library.persistent_session", CapabilityState::Available,
                       "boot_readonly_product_catalog",
                       "validated_session_open"});
        inventory.add({
            "survey.persistent_passive",
            productSurveyWorkerReady ? CapabilityState::Available
                                     : CapabilityState::Fault,
            "boot_catalog_plus_bounded_worker",
            productSurveyWorkerReady
                ? "exact_media_and_cancellable_worker_ready"
                : "worker_initialization_failed"});
    }
    inventory.add({"storage.sd", CapabilityState::Unknown,
                   "E-STORAGE-006_gpio38_non_authoritative",
                   storageDiscoveryReady ? storageDiscovery.reason
                                         : "invalid_discovery_record"});
    inventory.add({"storage.atomicity", CapabilityState::Declared,
                   "E-STORAGE-001+guard_policy", "filesystem_backend_not_started"});
    inventory.add({"assembly.profile", CapabilityState::Available,
                   BoardProfile::kAssemblyProfileId,
                   "explicit_no_autodetect"});
    inventory.add({
        "serial.console",
        BoardProfile::kExternalMux56UartDeclared &&
                !BoardProfile::kRfShieldDeclared &&
                !BoardProfile::kGpsDeclared && !BoardProfile::kPn532Declared
            ? CapabilityState::Available : CapabilityState::NotApplicable,
        "typed_action_mux56_3v3",
        BoardProfile::kRfShieldDeclared
            ? "mux_conflict_rf_shield_gpio5_gpio6"
            : (BoardProfile::kExternalMux56UartDeclared
                   ? "bounded_monitor_bridge_ready"
                   : "external_mux56_profile_not_declared")});
    inventory.add({"assembly.gps", CapabilityState::NotApplicable,
                   BoardProfile::kAssemblyProfileId,
                   "not_fitted_by_explicit_profile"});
    inventory.add({"assembly.pn532", CapabilityState::NotApplicable,
                   BoardProfile::kAssemblyProfileId,
                   "not_fitted_by_explicit_profile"});
    inventory.add({
        "shield.ir",
        BoardProfile::kRfShieldDeclared && BoardProfile::kIrDeclared
            ? CapabilityState::Declared : CapabilityState::Unknown,
        "explicit_board_profile_rx_only_gpio21",
        BoardProfile::kRfShieldDeclared && BoardProfile::kIrDeclared
            ? "raw_capture_ready_awaiting_physical_signal"
            : "explicit_profile_required"});
    inventory.add({
        "capture.ir_passive",
        BoardProfile::kRfShieldDeclared && BoardProfile::kIrDeclared &&
                infraredCaptureStoreEvents != nullptr
            ? CapabilityState::Declared : CapabilityState::Unknown,
        "bounded_polling_raw_nec_schema_v6",
        BoardProfile::kRfShieldDeclared && BoardProfile::kIrDeclared &&
                infraredCaptureStoreEvents != nullptr
            ? "rx_only_runtime_ready_awaiting_physical_signal"
            : "profile_or_worker_unavailable"});
    inventory.add({"shield.receivers",
                   BoardProfile::kRfShieldDeclared ? CapabilityState::Declared
                                                   : CapabilityState::Unknown,
                   "board_profile_full_guided_identity_probe",
                   BoardProfile::kRfShieldDeclared
                       ? "nrf1_nrf2_cc1101_read_only_probe_available"
                       : "rf_shield_not_declared"});

    appCatalog.rebuild(inventory, targetsMergeFixtureContinuityValid());
    feedRuntimeSafetyWatchdog();
    renderInteractiveScreen();
    bootMetrics.interactiveReadyUs = static_cast<std::uint64_t>(esp_timer_get_time());
    feedRuntimeSafetyWatchdog();

    emitMetrics();
    emitInventory();
    broadcast("{\"schema\":\"leshy.boot.v1\",\"kind\":\"help\",\"commands\":["
              "\"hil.begin <session-id> <app-elf-sha256>\","
              "\"hil.state\","
              "\"hil.end <session-id>\","
              "\"wifi.authentication.hil-hold-survey-stop once\","
              "\"wifi.authentication.hil-load-synthetic-report once\","
              "\"wifi.authentication.hil-load-persistence-fixture once\","
              "\"metrics\",\"inventory\",\"hardware.safe-outputs\",\"ping\","
              "\"power.state\",\"power.low-voltage-test confirm\","
              "\"power.sleep-test confirm\",\"power.sleep-test state\","
              "\"safety.state\",\"safety.watchdog-test confirm\","
              "\"device-lock.state\","
              "\"device-lock.kdf-benchmark confirm-no-persist\","
              "\"action.preview serial.console.start profile=mux56-3v3 target=<id> baud=<supported> framing=8N1|8E1|8O1|8N2 mode=monitor|bridge duration_ms=<1000..300000>\","
              "\"action.run serial.console.start profile=mux56-3v3 target=<id> baud=<supported> framing=8N1|8E1|8O1|8N2 mode=monitor|bridge duration_ms=<1000..300000> confirm=yes\","
              "\"action.status serial.console.start\","
              "\"action.cancel serial.console.start\","
              "\"safety.worker-deadline-test confirm\","
              "\"safety.worker-preparation-deadline-test confirm\","
              "\"safety.capture-store-deadline-test confirm\","
              "\"safety.capture-ir-store-deadline-test confirm\","
              "\"safety.capture-subghz-store-deadline-test confirm\","
              "\"safety.early-boot-watchdog-test confirm\","
              "\"safety.clear confirm\","
              "\"hardware.shield.receivers\","
              "\"hardware.nrf24.spectrum\","
              "\"hardware.nrf24.finder\","
              "\"hardware.cc1101.finder\","
              "\"hardware.cc1101.spectrum\","
              "\"capture.subghz.test-fixture fixed-rx-only\","
              "\"ui.state\",\"ui.key <action>\",\"survey.browser\","
              "\"survey.field-visit\","
              "\"survey.field-visit.test-incomplete once\","
              "\"wifi.network.detail\","
              "\"wifi.network.hil-select-label-fnv1a64 <16-hex-hash>\","
              "\"ble.device.hil-select-label-fnv1a64 <16-hex-hash>\","
              "\"ble.inspector.gatt.hil-fault wrong-peer|timeout|resource-conflict|failed-cleanup|state|clear\","
              "\"wifi.authentication.state\","
              "\"wifi.authentication.persistence.state\","
              "\"companion.web.hil-seed <32-hex-entropy>\","
              "\"companion.web.hil-proof\","
              "\"companion.web.state\","
              "\"capture.state\",\"capture.export.pcap\","
              "\"airspace.guard.state\","
              "\"capture.subghz.state\","
              "\"capture.subghz.export.csv\","
              "\"capture.ir.state\",\"capture.ir.export.csv\","
              "\"input.state\",\"touch.state\","
              "\"ui.touch <x> <y>\",\"touch.calibrate confirm\","
              "\"self-test.report\",\"self-test.active-rf\","
              "\"self-test.active-artifact\","
              "\"ui.capture\",\"storage.contract\",\"storage.guard\","
              "\"storage.discovery\",\"storage.mount.policy\","
              "\"storage.product.boot-recovery\","
              "\"storage.product.boot-watchdog-test confirm\","
              "\"storage.product.unenroll confirm\","
              "\"survey.product.admission\","
              "\"survey.product.test-source-unavailable once|clear\","
              "\"airspace-guard.test-capacity-drop once|clear\","
              "\"survey.product.test-runtime-unavailable wifi|ble|clear\","
              "\"storage.littlefs.parity disposable-ota1 <OTA1-SHA256> <run-id>\","
              "\"storage.littlefs.reset disposable-ota1 <OTA1-SHA256> <run-id> <1..6>\","
              "\"storage.littlefs.reset recover read-only <OTA1-SHA256> <run-id> <1..6>\","
              "\"storage.sd.protocol\",\"storage.sd.identification.fixture\","
              "\"storage.sd.transport.fixture\","
              "\"storage.sd.wire\","
              "\"storage.sd.identify disposable-read-only\","
              "\"storage.sd.inspect-lba0 disposable-read-only\","
              "\"storage.sd.inspect-boot disposable-read-only\","
              "\"storage.sd.inspect-fsinfo disposable-read-only\","
              "\"storage.sd.inspect-fat-reserved disposable-read-only\","
              "\"storage.sd.inspect-root-cluster disposable-read-only\","
              "\"storage.sd.readonly-mount disposable-read-only <CID32>\","
              "\"storage.product.enroll disposable-read-only <CID32>\","
              "\"storage.product.bootstrap disposable-write <CID32>\","
              "\"storage.sd.session-store disposable-write <CID32> <run-id>\","
              "\"storage.sd.session-store throughput disposable-write <CID32> <run-id>\","
              "\"storage.sd.session-store batch-throughput disposable-write <CID32> <run-id>\","
              "\"storage.sd.session-store reset disposable-write <CID32> <run-id> <1..6>\","
              "\"storage.sd.session-store recover disposable-read-only <CID32> <run-id> <1..6>\","
              "\"storage.sd.session-store power-cut disposable-write <CID32> <run-id> <1..6>\","
              "\"storage.sd.session-store power-cut-recover disposable-read-only <CID32> <run-id> <1..6>\","
              "\"survey.wifi.passive-persist disposable-write <CID32> <run-id> <1..8>\","
              "\"survey.wifi.passive-ingress measure passive-only <1..32>\","
              "\"survey.contract\",\"session.fixture\",\"session.store.fixture\","
              "\"library.fixture\",\"library.export\",\"library.capture\","
              "\"library.export.csv\",\"library.export.pcap\","
              "\"library.export.hc22000\"]}");
}

void loop() {
    const std::uint64_t loopStartedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    if (activeReceiveSampling()) {
        if (spectrumLoopPreviousUs != 0) {
            const std::uint64_t intervalUs =
                loopStartedUs - spectrumLoopPreviousUs;
            spectrumLoopIntervalTotalUs += intervalUs;
            if (intervalUs > spectrumLoopIntervalMaxUs) {
                spectrumLoopIntervalMaxUs = intervalUs;
            }
        }
        spectrumLoopPreviousUs = loopStartedUs;
        ++spectrumLoopCount;
    }
    serviceWorkerDeadlineSupervisor();
    serviceDeviceLock();
    serviceSerialConsoleAction();
    serviceWifiAuthenticationSyntheticHilExpiry();
    if (safetySupervisor.latched()) {
        quiesceSpectrumOnSafetyStop();
        quiesceAirspaceGuardOnSafetyStop();
        quiesceWifiAuthenticationOnSafetyStop();
        quiesceBleGattOnSafetyStop();
    }
    if (!safetySupervisor.latched()) {
        serviceAutomationPackageUi();
        serviceProductSurveyWorker();
        serviceBleGattProduct();
        serviceWifiDevicesProduct();
        serviceWifiChannelsProduct();
        serviceAirspaceGuardProduct();
        serviceWifiAuthenticationCapture();
        serviceWifiFrameCapture();
        serviceWifiFrameCapturePersist();
        serviceSubGhzRawCapturePersist();
        serviceInfraredRawCapturePersist();
        serviceTargetsMutationWorker();
        serviceFullGuidedRfChecks();
        serviceNrf24Spectrum();
        serviceCc1101Spectrum();
        serviceCc1101Finder();
        serviceSubGhzRawCapture();
        serviceInfraredCapture();
        serviceSpectrumWaterfallCadence();
    }
    if (serviceWebCompanion() && uiController.page() == 7) {
        renderInteractiveScreen();
    }
    serviceAntennaStatusLeds();
    const auto rawCaptureState = subGhzRawCapture.stats().state;
    const auto infraredState = infraredCapture.stats().state;
    const bool rawPulseTimingCritical =
        rawCaptureState == SubGhzRawCaptureState::Capturing ||
        infraredState == InfraredCaptureState::Capturing;
    const bool rawReceiveActive = rawPulseTimingCritical ||
        rawCaptureState == SubGhzRawCaptureState::Waiting ||
        infraredState == InfraredCaptureState::Waiting;
    // Once a burst starts, even a large diagnostic response would become a
    // fake pulse. Commands remain buffered by USB/UART and are answered after
    // the terminal gap; no evidence path is allowed to perturb the waveform.
    if (!rawPulseTimingCritical) {
        poll(Serial, usbCommand, usbLength, sizeof(usbCommand), true,
             usbCommandOverflow);
        poll(Serial0, uartCommand, uartLength, sizeof(uartCommand), false,
             uartCommandOverflow);
    }
    TouchPoint touchPress;
    const std::uint64_t touchStartedUs =
        static_cast<std::uint64_t>(esp_timer_get_time());
    // The RAW page has no touch action. Avoid sharing the display/touch SPI
    // path while the receiver is waiting for or timing a burst.
    const bool touchPressed = !safetySupervisor.latched() &&
        !rawReceiveActive &&
        boardTouchInput.poll(millis(), &touchPress);
    const std::uint64_t touchElapsedUs =
        static_cast<std::uint64_t>(esp_timer_get_time()) - touchStartedUs;
    feedRuntimeSafetyWatchdog();
    if (activeReceiveSampling()) {
        spectrumTouchPollTotalUs += touchElapsedUs;
        if (touchElapsedUs > spectrumTouchPollMaxUs) {
            spectrumTouchPollMaxUs = touchElapsedUs;
        }
        ++spectrumTouchPollCount;
    }
    if (touchPressed) {
        dispatchTouchPoint(touchPress);
    }
    PhysicalInputEvent inputEvent;
    // Preserve the 0.x one-key/one-repaint order even when presses are queued.
    if (!rawPulseTimingCritical && physicalInputEvents != nullptr &&
        xQueueReceive(physicalInputEvents, &inputEvent, 0) == pdTRUE) {
        const std::uint64_t dequeuedUs =
            static_cast<std::uint64_t>(esp_timer_get_time());
        lastPhysicalInputQueueUs = dequeuedUs >= inputEvent.atUs
            ? dequeuedUs - inputEvent.atUs : 0;
        if (lastPhysicalInputQueueUs > maximumPhysicalInputQueueUs) {
            maximumPhysicalInputQueueUs = lastPhysicalInputQueueUs;
        }
        lastInputRaw = inputEvent.raw;
        bootMetrics.inputRaw = inputEvent.raw;
        const bool changed = applyUiAction(inputEvent.action, false);
        lastPhysicalInputAction = inputEvent.action;
        lastPhysicalInputChanged = changed;
        ++physicalInputDispatchedPresses;
        if (changed) {
            renderInteractiveScreen(!lastUiActionUsedIncrementalRender);
        }
        lastPhysicalInputRenderUs = changed ? lastUiRenderUs : 0;
        const std::uint64_t finishedUs =
            static_cast<std::uint64_t>(esp_timer_get_time());
        lastPhysicalInputEndToEndUs = finishedUs >= inputEvent.atUs
            ? finishedUs - inputEvent.atUs : 0;
        if (lastPhysicalInputEndToEndUs > maximumPhysicalInputEndToEndUs) {
            maximumPhysicalInputEndToEndUs = lastPhysicalInputEndToEndUs;
        }
        portENTER_CRITICAL(&physicalInputMux);
        lastInputRaw = physicalButtonInput.stableRaw();
        portEXIT_CRITICAL(&physicalInputMux);
        bootMetrics.inputRaw = lastInputRaw;
    }
    if (activeReceiveSampling()) {
        // The receiver itself now clocks the waterfall: yield to the RTOS but
        // do not add an artificial per-bin delay to a physical sweep.
        yield();
    } else {
        delay(2);
    }
}
